[
  {
    "id": "00433299-6763-45a9-a1f1-4d965dec5f5d",
    "questions": [
      "What is the birth year of Hareth?",
      "Who is Hareth's spouse?",
      "How many sons did Hareth have?",
      "What is the relationship between Hareth and Haldir?",
      "In which realm did Hareth marry Galdor?"
    ]
  },
  {
    "id": "0083b05a-c118-42ae-9994-61b520bd2623",
    "questions": [
      "What is the full name of Otho Sackville-Baggins' spouse?",
      "In what year was Otho Sackville-Baggins born?",
      "What is the height of Otho Sackville-Baggins?",
      "Who were the parents of Otho Sackville-Baggins?",
      "What ambitions did Otho's son Lotho have regarding the Baggins family?"
    ]
  },
  {
    "id": "00a82c62-edb2-49db-8f2f-7ff8e3e1534e",
    "questions": [
      "What year was Éomund born?",
      "Who was Éomund's spouse?",
      "In which year did Éomund die?",
      "What was Éomund known for in his role as a captain?",
      "Who fostered Éomund's children after his death?"
    ]
  },
  {
    "id": "0133aee4-a276-4231-bb85-b8d1491eab9b",
    "questions": [
      "What was the birth period of Belegund?",
      "Who was Belegund's father?",
      "What significant event did Belegund participate in during the First Age?",
      "Who betrayed Belegund and his band to Sauron?",
      "How is Belegund related to Tuor?"
    ]
  },
  {
    "id": "01590dc0-9d6f-4358-9a37-17388797deb3",
    "questions": [
      "What tribe did Uldor belong to?",
      "Who did Uldor serve with since FA 457?",
      "What was Uldor's role in the Nírnaeth Arnoediad?",
      "Who killed Uldor?",
      "What significant action did Uldor take that aided Morgoth in battle?"
    ]
  },
  {
    "id": "01cd9337-4d60-4089-abb4-ac2b8fae7ded",
    "questions": [
      "What year was Gerontius Took born?",
      "Who was Gerontius Took's spouse?",
      "How many children did Gerontius Took have?",
      "What was Gerontius Took's role in the Shire?",
      "Which famous hobbits are direct descendants of Gerontius Took?"
    ]
  },
  {
    "id": "02380f21-81e8-4f0e-9e79-e15f348a7b30",
    "questions": [
      "What was Rómendacil I's original name before he renamed himself?",
      "In which year did Rómendacil I succeed his father as king?",
      "What significant military event did Rómendacil I lead against the Easterlings?",
      "What title did Rómendacil I create that became important for the future governance of Gondor?",
      "Who succeeded Rómendacil I after his death in TA 541?"
    ]
  },
  {
    "id": "026e3b09-c5ee-4815-ac8f-8ce71dafe548",
    "questions": [
      "What year was Gollum born?",
      "Who was Gollum's cousin that he killed over the Ring?",
      "In which location did Gollum live for over four hundred years?",
      "What was the name of the personality that represented Gollum's 'good' side?",
      "How did Gollum ultimately meet his death?"
    ]
  },
  {
    "id": "02bb30c2-1fee-41c4-a0b2-22f8d8b826f2",
    "questions": [
      "What race is Forthwini?",
      "In what year did Forthwini die?",
      "What was Forthwini's role in the conflict with the Wainriders?",
      "Who did Forthwini warn about the impending invasion?",
      "What happened to Forthwini's fate after the battle near the Black Gate?"
    ]
  },
  {
    "id": "02d89fdc-1bba-4c79-951b-ce23ee8eddce",
    "questions": [
      "What was the name of Thengel's spouse?",
      "In which year was Thengel born?",
      "Who was Thengel's father and what was his title?",
      "How many children did Thengel have and what were their genders?",
      "Which language did Thengel learn while living in Gondor?"
    ]
  },
  {
    "id": "02f8e2c7-ec62-4310-a960-88cb878280c9",
    "questions": [
      "What significant battle did Óin fight in alongside Thorin Oakenshield?",
      "Who were Óin's immediate family members mentioned in the biography?",
      "In which year did Óin join Thorin's company on the quest to reclaim the Lonely Mountain?",
      "What role did Óin and his brother Glóin play in the Company during their journey?",
      "How did Óin meet his end according to the Book of Mazarbul?"
    ]
  },
  {
    "id": "02faf2ea-fba6-4965-8a40-5b9dc05112c8",
    "questions": [
      "What is the birth year of Erling Greenhand?",
      "Who are the siblings of Erling Greenhand?",
      "What is the race of Erling Greenhand?",
      "What was the social class of Erling Greenhand?",
      "Who were Erling Greenhand's parents?"
    ]
  },
  {
    "id": "03357be8-b059-4fe5-9c95-f661d1519a4c",
    "questions": [
      "What significant event led Turgon to leave Eldamar and become an exile in Middle-earth?",
      "Who was Turgon's wife and what happened to her during their journey?",
      "What was the name of the secret kingdom that Turgon prepared as instructed by Ulmo?",
      "How long did Turgon rule Gondolin before its fall?",
      "What relationship did Turgon have with Maeglin and how did it affect his daughter Idril?"
    ]
  },
  {
    "id": "0343ebad-fb20-4ad3-9522-cac95175ca16",
    "questions": [
      "What year was Halbarad born?",
      "Who did Halbarad lead to aid Aragorn?",
      "What significant item did Halbarad bring to Aragorn from Arwen?",
      "On what date did Halbarad die?",
      "What emblem did Halbarad's standard bear during the battle at Pelennor Fields?"
    ]
  },
  {
    "id": "03a63d87-96f8-4e02-b5b2-76cacf19cc3c",
    "questions": [
      "What significant event occurred in the Year of the Sun 463 of the First Age involving Bór?",
      "Who were Bór's sons?",
      "To whom did Bór and his followers swear allegiance?",
      "What happened to most of Bór's people during the Nírnaeth Arnoediad?",
      "How did Bór's lineage influence the ancient Men in the north during the Second Age?"
    ]
  },
  {
    "id": "044c8e65-803a-4115-8c02-54d31768123a",
    "questions": [
      "What year was Flambard Took born?",
      "Who were Flambard Took's parents?",
      "In what year did Flambard Took die?",
      "What is the name of Flambard Took's son?",
      "What is the significance of the years TA 2887 and TA 2989 in Flambard Took's life?"
    ]
  },
  {
    "id": "04c3f129-7ea8-4deb-9cf5-a898fe901984",
    "questions": [
      "What significant event did Pelendur help Gondor navigate following the death of King Ondoher?",
      "In what year did Pelendur die, and how old was he at the time of his death?",
      "Who were the two claimants to the throne that Pelendur had to consider during the constitutional crisis?",
      "What was Pelendur's stance on the claim made by Fíriel regarding her right to the throne?",
      "What political precedent established by Pelendur influenced Aragorn's approach to assuming the throne of Gondor?"
    ]
  },
  {
    "id": "05943f30-3a38-4762-b8bc-43886b77e0ee",
    "questions": [
      "What was the birth year of Ar-Pharazôn?",
      "Who was Ar-Pharazôn's spouse?",
      "In which realm did Ar-Pharazôn rule?",
      "What significant action did Ar-Pharazôn take against Valinor?",
      "How did Ar-Pharazôn's reign affect the royal line of Númenor?"
    ]
  },
  {
    "id": "05ce22d9-dfa2-4e87-aa70-040849138b8c",
    "questions": [
      "What year was Morwen Steelsheen born?",
      "Who was Morwen Steelsheen's spouse?",
      "How many children did Morwen Steelsheen have?",
      "In which realm did Morwen become queen?",
      "What notable physical trait did Morwen inherit from her Dúnedain heritage?"
    ]
  },
  {
    "id": "05e09923-7044-437e-ae99-72c063526376",
    "questions": [
      "What year was Thráin II born?",
      "Who were Thráin II's children?",
      "What significant event led to Thráin II's exile from Erebor?",
      "Which battle marked the climax of the War of the Dwarves and Orcs?",
      "What happened to Thráin II in TA 2845?"
    ]
  },
  {
    "id": "05e3632c-af78-4d3a-b27b-c32579c67a19",
    "questions": [
      "What role did Grimbold play during the War of the Ring?",
      "Who did Grimbold fight alongside in the Battles of the Fords of Isen?",
      "What was Grimbold's fate in the Battle of the Pelennor Fields?",
      "How did Grimbold manage to save Théodred's body?",
      "What position did Grimbold hold after being promoted for his valour?"
    ]
  },
  {
    "id": "06013678-2724-4296-9137-cf86742caf60",
    "questions": [
      "What year was Lotho Sackville-Baggins born?",
      "Who were Lotho's parents?",
      "What actions did Lotho take after inheriting his father's pipe-weed plantations?",
      "How did Lotho's rule over the Shire come to an end?",
      "What title did Lotho declare for himself during his time in power?"
    ]
  },
  {
    "id": "06215790-e3cd-4dd8-9875-7abf0b3fcea8",
    "questions": [
      "What region of Númenor is Henderch likely from?",
      "Who was Henderch's close companion and nobleman?",
      "In what year did Henderch serve as a steward to Prince Aldarion?",
      "What was the name of the ship that Henderch traveled on with Aldarion?",
      "What significant event did Henderch accompany Aldarion for during their night ride?"
    ]
  },
  {
    "id": "07001164-344a-4bd8-a586-fb4ad70358ec",
    "questions": [
      "What was the birth year of Hildifons Took?",
      "Who were Hildifons Took's parents?",
      "How many siblings did Hildifons Took have?",
      "What was Hildifons Took known for in his personality?",
      "What happened to Hildifons Took after he left the Shire?"
    ]
  },
  {
    "id": "07041008-4d3b-40db-8e1d-2f17396be3d4",
    "questions": [
      "What is the birth year of Longo Baggins?",
      "Who was Longo Baggins' spouse?",
      "In which year did Longo Baggins die?",
      "What significant family did Longo Baggins help establish?",
      "What is the race of Longo Baggins?"
    ]
  },
  {
    "id": "07c512fb-e4f1-470c-9ea8-f37cf470c3d1",
    "questions": [
      "What year was Esmeralda Brandybuck born?",
      "Who are Esmeralda Brandybuck's parents?",
      "What is the relationship between Esmeralda Brandybuck and Peregrin Took?",
      "Who did Esmeralda Brandybuck marry?",
      "What is the significance of Brandy Hall in Esmeralda Brandybuck's life?"
    ]
  },
  {
    "id": "08008ab9-f556-4ac0-957e-3c8ff3fdeefa",
    "questions": [
      "What is the birth year of Gerda Bolger?",
      "Who is Gerda Bolger's spouse?",
      "In what year did Gerda Bolger marry Adalbert Bolger?",
      "How many children did Gerda Bolger have?",
      "What is the race of Gerda Bolger?"
    ]
  },
  {
    "id": "08496326-2469-4b04-b8ef-1809cc6ab783",
    "questions": [
      "What was the birth year of Faramir?",
      "Who were Faramir's siblings?",
      "In what year did Faramir die?",
      "What was Faramir's relationship to Artamir and Fíriel?",
      "What circumstances led to Faramir's death?"
    ]
  },
  {
    "id": "0a02550f-56a9-47aa-badd-e5559d5bd3ce",
    "questions": [
      "What is the birth year of Eärendil?",
      "Who is Eärendil's spouse?",
      "What significant event did Eärendil participate in during the War of Wrath?",
      "What ship did Eärendil build with the help of Círdan the Shipwright?",
      "What choice did Eärendil make regarding his race, and why?"
    ]
  },
  {
    "id": "0a049307-c000-4df0-9fd9-ef1103eb6b13",
    "questions": [
      "What year was Marigold Cotton born?",
      "Who are Marigold Cotton's siblings?",
      "Who did Marigold Cotton marry?",
      "What is the relation between Marigold Cotton and Samwise Gamgee?",
      "Who was Marigold Cotton's father?"
    ]
  },
  {
    "id": "0a4c6ddd-c59f-4ee1-8b4b-9879667a576e",
    "questions": [
      "What year was Tanta Hornblower born?",
      "Who was Tanta Hornblower's husband?",
      "Who were Tanta Hornblower's children?",
      "What is the name of Tanta Hornblower's daughter-in-law?",
      "What is the relationship between Tanta Hornblower and Fosco Baggins?"
    ]
  },
  {
    "id": "0a7c3da8-78d4-45ae-ba28-a2c65306d963",
    "questions": [
      "What is Bofur's race?",
      "Who did Bofur accompany on the quest to Erebor?",
      "What significant battle did Bofur survive after the quest?",
      "In what year was Bofur born?",
      "What did Glóin report about Bofur's status before the Council of Elrond?"
    ]
  },
  {
    "id": "0a87438c-8381-420b-ae9c-5a1123b1db22",
    "questions": [
      "What year did Celepharn come to the throne?",
      "Who was Celepharn's father?",
      "In which realm did Celepharn rule?",
      "How long did Celepharn rule before his death?",
      "What was the name of Celepharn's successor?"
    ]
  },
  {
    "id": "0aecbb30-f7fe-4d9c-a785-62dd91d3f0c0",
    "questions": [
      "What race does Frumgar belong to?",
      "In what year was Frumgar born?",
      "What significant event prompted Frumgar to lead his people north?",
      "What was the name of Frumgar's spouse?",
      "In what year did Frumgar die?"
    ]
  },
  {
    "id": "0b56c005-66f6-46c7-a5c7-1e3c6e35d6bf",
    "questions": [
      "What race is Indor?",
      "In which age was Indor born?",
      "What year did Indor die?",
      "Who was Indor's spouse?",
      "What is the gender of Indor?"
    ]
  },
  {
    "id": "0bc48dff-3e2b-4f0b-aef3-c7f7099a91bc",
    "questions": [
      "What year was Fortinbras Took II born?",
      "Who was Fortinbras Took II's spouse?",
      "How many children did Fortinbras Took II have?",
      "In what year did Fortinbras Took II become Shire-thain?",
      "What is the relationship between Fortinbras Took II and Bilbo Baggins?"
    ]
  },
  {
    "id": "0ce50242-eaaf-4a61-8e9f-043743c72c9c",
    "questions": [
      "What is the race of Erchirion?",
      "In what year was Erchirion born?",
      "What is known about Erchirion's siblings?",
      "When did Erchirion die?",
      "What is the gender of Erchirion?"
    ]
  },
  {
    "id": "0cf96d55-1af8-4fa7-8b54-a2b588d9848a",
    "questions": [
      "What year was Largo Baggins born?",
      "Who were Largo Baggins' parents?",
      "How many siblings did Largo Baggins have?",
      "What is the name of Largo Baggins' spouse?",
      "In what year did Largo Baggins die?"
    ]
  },
  {
    "id": "0d79e784-6481-45ce-8737-d61e060e160f",
    "questions": [
      "What is the name of Eöl's spouse?",
      "In which realm did Eöl live and appoint himself as Lord?",
      "What was the name of the sword that Eöl forged and kept for himself?",
      "What event led to Eöl's death?",
      "How many children did Eöl have with Aredhel?"
    ]
  },
  {
    "id": "0d89af39-ab02-42f0-b5b7-ad7717ea13ff",
    "questions": [
      "What race is Hunthor?",
      "Who was Hunthor's spouse?",
      "In which year did Hunthor die?",
      "What relationship did Hunthor have with Brandir the Lame?",
      "Which family member of Hunthor is mentioned in 'The Wanderings of Húrin'?"
    ]
  },
  {
    "id": "0d9bb90f-f330-4313-8e7c-6e5cffd01a99",
    "questions": [
      "What was the name of Gil-galad's father?",
      "In which realm did Gil-galad establish his kingdom during the Second Age?",
      "What significant event did Gil-galad participate in that led to the formation of the Last Alliance of Elves and Men?",
      "Which two Elven Rings did Gil-galad receive from Celebrimbor?",
      "What was the name of Gil-galad's famed weapon?"
    ]
  },
  {
    "id": "0dd69b92-9766-4d62-87ea-ce5c3113bf78",
    "questions": [
      "What is the birth year of Rose Greenhand?",
      "Who is Rose Greenhand's spouse?",
      "What is the name of Rose Greenhand's son?",
      "Who was Rose Greenhand's father?",
      "What race does Rose Greenhand belong to?"
    ]
  },
  {
    "id": "0e04df8f-ad2e-4baf-adea-81f7ddf006f5",
    "questions": [
      "What year was Donnamira Boffin born?",
      "Who were Donnamira Boffin's parents?",
      "How many siblings did Donnamira Boffin have?",
      "What were the names of Donnamira Boffin's children?",
      "In what year did Donnamira Boffin pass away?"
    ]
  },
  {
    "id": "0e57beb2-8e9a-4a15-bb20-a860c9993cef",
    "questions": [
      "What role did Lindir play at Bilbo's poetry readings?",
      "What is implied about Lindir's profession based on his name?",
      "What confusion did Lindir express regarding the authorship of Bilbo's poem?",
      "What is the significance of Lindir's statement about mortals and Elves?",
      "In which game is Lindir featured, according to the biography?"
    ]
  },
  {
    "id": "0f3142cf-9395-43ca-901b-79620a972d6a",
    "questions": [
      "What year was Lalia Took born?",
      "In what year did Lalia marry?",
      "Who was Lalia's son?",
      "What position did Lalia hold in the Took clan after Fortinbras' death?",
      "What incident led to Lalia's death?"
    ]
  },
  {
    "id": "0f6c1f09-099f-4af1-adb3-97e1de50a867",
    "questions": [
      "Who were Manthor's parents?",
      "What position was Manthor appointed to after losing the election for Chieftain?",
      "How was Manthor related to Brandir the Lame?",
      "What significant event did Manthor participate in at the 301st Folkmoot of Judgment?",
      "What caused Manthor's death?"
    ]
  },
  {
    "id": "0fa53a3b-f381-4fd7-9d64-f19c4d0b34e6",
    "questions": [
      "What is the birth year of Hob Gammidge?",
      "Who is Hob Gammidge's spouse?",
      "What was Hob Gammidge's occupation?",
      "Who was Hob Gammidge's father?",
      "Name one of Hob Gammidge's children."
    ]
  },
  {
    "id": "0fac8b07-f934-482c-823a-b2a8b3835a77",
    "questions": [
      "What significant event did Haldir participate in on January 15, 3019?",
      "How did Haldir greet Legolas and Aragorn when the Fellowship arrived?",
      "What condition did Haldir impose for Gimli to enter Lórien?",
      "What did Haldir do during the night while the Fellowship rested on the flet?",
      "What is known about Haldir's fate after the events of the Fellowship's visit to Lórien?"
    ]
  },
  {
    "id": "0fc6ab15-eaa1-4e0f-9526-0d0defc7aff6",
    "questions": [
      "What year was Hamfast of Gamwich born?",
      "What is the name of Hamfast of Gamwich's spouse?",
      "In which village was Hamfast of Gamwich born?",
      "How many children did Hamfast of Gamwich have?",
      "What is the name of Hamfast of Gamwich's child?"
    ]
  },
  {
    "id": "1020e784-1313-435e-94b5-b80d2cf32598",
    "questions": [
      "What race is Ibûn?",
      "What is known about Ibûn's family during his capture?",
      "In which event was Ibûn missing in action?",
      "What are the possible circumstances of Ibûn's death?",
      "What does Tolkien state about Mîm in relation to Ibûn?"
    ]
  },
  {
    "id": "10d29838-ee4f-4a5e-8a89-10da7ee8a793",
    "questions": [
      "What title was Erkenbrand granted after the War of the Ring?",
      "In which battle did Erkenbrand command the defense of Westfold?",
      "Who assisted Erkenbrand in rallying forces during the Battle of the Hornburg?",
      "What color was the shield that Erkenbrand used in battle?",
      "During what age did Erkenbrand live and fight?"
    ]
  },
  {
    "id": "10ec372a-9704-4d77-877e-fbf82f258076",
    "questions": [
      "What was the birth year of Laura (Grubb) Baggins?",
      "Who was Laura (Grubb) Baggins' spouse?",
      "How many children did Laura (Grubb) Baggins have?",
      "In what year did Laura (Grubb) Baggins die?",
      "Who succeeded Laura (Grubb) Baggins as Head of the Family?"
    ]
  },
  {
    "id": "11468efd-7e02-4bbf-9e9b-c82079805a28",
    "questions": [
      "What race does Ohtar belong to?",
      "In what age was Ohtar born?",
      "What task did Isildur command Ohtar to undertake during the ambush in Gladden Fields?",
      "Who did Ohtar deliver the shards of Narsil to after Isildur's death?",
      "What was the relationship between Ohtar and Isildur?"
    ]
  },
  {
    "id": "1191ff9e-7edd-41ac-bef1-8492de11dbad",
    "questions": [
      "What was the birth year of Baragund?",
      "Who was Baragund's father?",
      "How is Baragund related to Túrin Turambar?",
      "What event led to Baragund living as an outlaw?",
      "Who betrayed Baragund and his companions?"
    ]
  },
  {
    "id": "11c116ab-6bea-4cb5-baaf-b4c2606543f2",
    "questions": [
      "What is the race of Orchaldor?",
      "Who is Orchaldor's spouse?",
      "What significant change in succession laws affected Orchaldor's son Soronto?",
      "Who was Orchaldor's father?",
      "Which royal family is Orchaldor related to by marriage?"
    ]
  },
  {
    "id": "121f7ed5-fb83-4844-ba86-54c9c93efe33",
    "questions": [
      "What is the birth year of Lindissë?",
      "Who were Lindissë's siblings?",
      "What was the name of Lindissë's father?",
      "What is known about Lindissë's life?",
      "What is Lindissë's race?"
    ]
  },
  {
    "id": "129582fe-a265-4625-8466-fc3088e2189a",
    "questions": [
      "What race is Gorlim classified as?",
      "Who was Gorlim's spouse?",
      "In what year did Gorlim die?",
      "What was the fate of Gorlim after he betrayed Barahir?",
      "Who did Gorlim appear as a spectre before after his death?"
    ]
  },
  {
    "id": "12c0979e-9032-4b61-ba16-260f578ee2b3",
    "questions": [
      "What was the name of Húrin's spouse?",
      "In which year was Húrin born?",
      "What significant event occurred in FA 473 involving Húrin and his brother?",
      "How did Húrin's captivity affect his ability to see events concerning his family?",
      "What was the outcome of Húrin's encounter with the King Turgon upon his release from captivity?"
    ]
  },
  {
    "id": "13a565f9-a59f-4d0c-9a4d-a5e527866934",
    "questions": [
      "What was the birth year of Ar-Zimrathôn?",
      "How long did Ar-Zimrathôn rule Númenor?",
      "What is the meaning of Ar-Zimrathôn's name in both Adûnaic and Quenya?",
      "Who succeeded Ar-Zimrathôn after his death?",
      "In what year did Ar-Zimrathôn die?"
    ]
  },
  {
    "id": "13bac69d-5391-4ca2-a1f8-79e7e0fe8764",
    "questions": [
      "What title did Thorin II Oakenshield hold after his father went missing?",
      "In which battle did Thorin earn the epithet 'Oakenshield'?",
      "Who killed the dragon Smaug?",
      "What item did Bilbo Baggins find that Thorin later sought after in the treasure hoard?",
      "What were Thorin's last words before he died?"
    ]
  },
  {
    "id": "13f179da-b5a1-4d92-a417-c3dded32fbc2",
    "questions": [
      "What year was Folcwine born and when did he die?",
      "Who succeeded Folcwine to the throne of Rohan?",
      "What significant military action did Folcwine undertake in TA 2885?",
      "How many children did Folcwine have and can you name any of them?",
      "What was the outcome of the Battle of the Crossings of Poros for Rohan?"
    ]
  },
  {
    "id": "1417f317-4efc-4e7c-8023-150234f2fbc8",
    "questions": [
      "What is the race of Otto Boffin?",
      "Who was Otto Boffin's spouse?",
      "In what year was Otto Boffin born?",
      "How many children did Otto Boffin have?",
      "What was the age of Otto Boffin at the time of his death?"
    ]
  },
  {
    "id": "14298d3a-fcd2-41ba-a5d1-3955d1a4bbac",
    "questions": [
      "What is the birth year of Peony (Baggins) Burrows?",
      "Who are Peony's parents?",
      "How many children did Peony and Milo Burrows have?",
      "What was the name of Peony's spouse?",
      "Which family member did not attend Bilbo Baggins's Farewell Party?"
    ]
  },
  {
    "id": "147bd878-84ab-4a5c-9390-195c94537525",
    "questions": [
      "What is the race of Valandil?",
      "In which realm did Valandil reside?",
      "What year was Valandil born?",
      "What year did Valandil die?",
      "Who was Valandil's spouse?"
    ]
  },
  {
    "id": "15463ac0-3573-403d-b1d6-82480494dafc",
    "questions": [
      "Who was Thranduil's father and what was his title?",
      "In which battle did Thranduil's father perish?",
      "What significant change occurred in the realm of Thranduil during the Third Age?",
      "Which treasure did Thranduil receive after the Battle of Five Armies?",
      "What name did Thranduil give to Mirkwood after the War of the Ring?"
    ]
  },
  {
    "id": "157afc49-1c99-4f93-bb37-145a9ca2aeff",
    "questions": [
      "What is the race of Calmacil?",
      "In which realm did Calmacil reside?",
      "Who succeeded Calmacil after his death?",
      "What were the names of Calmacil's sons?",
      "How long did Calmacil's reign last?"
    ]
  },
  {
    "id": "167e6bdf-1568-4d90-b428-5ef50ea20135",
    "questions": [
      "What is the race of Nina Lightfoot?",
      "In which realm does Nina Lightfoot reside?",
      "What year was Nina Lightfoot born?",
      "Who is Nina Lightfoot's spouse?",
      "What is the gender of Nina Lightfoot?"
    ]
  },
  {
    "id": "1697dd7d-1c84-4153-9f02-b7dc7dd6d647",
    "questions": [
      "What is the race of Arciryas?",
      "Who was Arciryas' father?",
      "What is the name of Arciryas' son?",
      "Who is the grandfather of Eärnil II?",
      "What is known about Arciryas' marriage?"
    ]
  },
  {
    "id": "16e1c69d-48dd-4eb5-896c-49368c21dd07",
    "questions": [
      "What was Arthad's race?",
      "In which age was Arthad born?",
      "What significant event occurred in Arthad's life before the Dagor Bragollach?",
      "Who did Arthad follow in his defiance against Morgoth's forces?",
      "How did Arthad meet his end?"
    ]
  },
  {
    "id": "1731a195-9d56-4853-bdaa-4bd78481738c",
    "questions": [
      "What year was Daisy Gamgee born?",
      "Who were Daisy Gamgee's older brothers?",
      "How many younger siblings did Daisy Gamgee have?",
      "Which of Daisy's siblings is noted to have become one of the greatest hobbits in Middle-earth?",
      "Why is it speculated that Daisy was close with her brother Sam?"
    ]
  },
  {
    "id": "175e7c8a-5443-40af-9307-f831fbe65c39",
    "questions": [
      "What is the birth year of Wilibald Bolger?",
      "Who was Wilibald Bolger's spouse?",
      "How many children did Wilibald Bolger have?",
      "In what year did Wilibald Bolger die?",
      "What are the names of Wilibald Bolger's children and their birth years?"
    ]
  },
  {
    "id": "1823461e-c146-48e9-a114-9628de2797be",
    "questions": [
      "What significant event did Malbeth the Seer influence regarding King Araphant's son in TA 1864?",
      "What were the two main prophecies made by Malbeth the Seer?",
      "What was the outcome of Arvedui's claim to the throne of Gondor after King Ondoher's death in TA 1944?",
      "What does Malbeth prophesy about the Paths of the Dead and Aragorn II?",
      "What does Malbeth's prophecy imply about the future of the kingship in Gondor?"
    ]
  },
  {
    "id": "182a9098-caa4-46c4-a3fa-e6336a56aa7b",
    "questions": [
      "What was the birth year of Tar-Vanimeldë?",
      "Who was Tar-Vanimeldë's spouse?",
      "How long did Tar-Vanimeldë rule Númenor?",
      "What was the relationship between Tar-Vanimeldë and Tar-Alcarin?",
      "What arts did Tar-Vanimeldë have a passion for?"
    ]
  },
  {
    "id": "184278af-0c87-43e9-94d2-aac68c238201",
    "questions": [
      "What race does Amarië belong to?",
      "Who was Amarië's loved one?",
      "Did Amarië and Finrod get married?",
      "Why did Amarië not follow Finrod into exile?",
      "Where did Amarië reunite with Finrod after his death?"
    ]
  },
  {
    "id": "18553f2b-1f24-434c-a826-9ff44f1b1b05",
    "questions": [
      "What year was Fréawine born?",
      "Who was Fréawine's father?",
      "In what year did Aldor die?",
      "How long did Fréawine rule as King of Rohan?",
      "Who succeeded Fréawine as King of Rohan?"
    ]
  },
  {
    "id": "189b3c88-addb-45d7-b2a5-ffacd17bcc1e",
    "questions": [
      "What is the full name of the character?",
      "What is the last name of Salvia?",
      "Is there any information about Salvia's race or gender?",
      "What is the character's unique identifier?",
      "Is there any biography or background information provided for Salvia?"
    ]
  },
  {
    "id": "18b4a586-8e07-4387-b22a-318783116da9",
    "questions": [
      "What was the birth year of Lúthien?",
      "Who was Lúthien's spouse?",
      "What impossible task did Thingol set for Beren as a bride price?",
      "What choice did Lúthien make after Beren's death?",
      "Who was the son of Lúthien and Beren?"
    ]
  },
  {
    "id": "18e1a0a5-364d-43a6-b42e-189aa3855398",
    "questions": [
      "What is the race of Aranwë?",
      "What is the gender of Aranwë?",
      "Who is the spouse of Aranwë?",
      "What is the name of the character?",
      "Is Aranwë male or female?"
    ]
  },
  {
    "id": "193a9df3-ed7f-4d61-b8f4-096f298d0b28",
    "questions": [
      "What race is Soronto?",
      "In what year was Soronto born?",
      "What significant change in Númenor's law affected Soronto's claim to the throne?",
      "What relationship did Soronto have with Tar-Ancalimë?",
      "In which age did Soronto die?"
    ]
  },
  {
    "id": "197ab3cb-28a1-4142-bd24-be986e969fd6",
    "questions": [
      "What is the birth year of Dís?",
      "Who are the children of Dís?",
      "In what year was Dís driven into exile by Smaug?",
      "Who are the siblings of Dís?",
      "What is the race of Dís?"
    ]
  },
  {
    "id": "1985e655-c87a-4175-8573-92734dff8d29",
    "questions": [
      "What year was Isumbras Took III born?",
      "Who succeeded Isumbras Took III as Shire-thain?",
      "What notable battle is associated with Isumbras Took III's son Bandobras?",
      "In what year did Isumbras Took III become Shire-thain?",
      "How many children did Isumbras Took III have?"
    ]
  },
  {
    "id": "1a4a012f-7ec2-40a4-a751-e66b11e3f13c",
    "questions": [
      "What is the birth year of Marmadas Brandybuck?",
      "Who is the father of Marmadas Brandybuck?",
      "How many children did Marmadas Brandybuck have?",
      "What are the names of Marmadas Brandybuck's children?",
      "Who was Marmadas Brandybuck's spouse?"
    ]
  },
  {
    "id": "1c011212-caa9-442a-8999-07e35bcab509",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier of Togo Goodbody?",
      "Is there any biographical information available for Togo Goodbody?",
      "What are the characteristics or traits associated with Togo Goodbody?",
      "What role does Togo Goodbody play in the story or context provided?"
    ]
  },
  {
    "id": "1c6a91ba-64d0-4847-8bc3-64f0cd73e3a8",
    "questions": [
      "What is the race of Findegil?",
      "What is the gender of Findegil?",
      "In which age was Findegil born?",
      "When did Findegil die?",
      "Is there a specific date mentioned for Findegil's death?"
    ]
  },
  {
    "id": "1cd61d59-0053-4f92-9ce4-a06dd62ee57c",
    "questions": [
      "What year was Finduilas of Dol Amroth born?",
      "Who was Finduilas' husband?",
      "In what year did Finduilas give birth to her first son?",
      "What relationship did Finduilas have with her brother Imrahil?",
      "How old was Finduilas at the time of her death?"
    ]
  },
  {
    "id": "1d1bbc3d-804f-4c87-8ed9-7de61994fc2a",
    "questions": [
      "What is the race of Ailinel?",
      "Who is Ailinel's spouse?",
      "In which time period was Ailinel born?",
      "What is the name of Ailinel's son?",
      "Who are Ailinel's siblings?"
    ]
  },
  {
    "id": "1d25b553-5fc8-4cf9-b74d-8ce1e809f838",
    "questions": [
      "What is the full name of Ardamir's father?",
      "In what year was Ardamir born?",
      "How many siblings did Ardamir have?",
      "What is known about Ardamir's life?",
      "What race does Ardamir belong to?"
    ]
  },
  {
    "id": "1d35b39d-721a-4b1d-97ba-5759b463d90e",
    "questions": [
      "What year was Myrtle Burrows born?",
      "Who are Myrtle Burrows' parents?",
      "How many siblings does Myrtle Burrows have?",
      "What notable event did Myrtle Burrows attend with her family?",
      "What is the relationship of Myrtle Burrows to Milo and Peony Burrows?"
    ]
  },
  {
    "id": "1d6a9861-d4e3-4aff-8e83-a9cbaf5c0f5f",
    "questions": [
      "What significant event led to Aldor becoming his father's heir?",
      "In what year did Aldor succeed his father as King of Rohan?",
      "How long did Aldor rule Rohan before his death?",
      "What was one of the major accomplishments during Aldor's reign?",
      "Who succeeded Aldor as King after his death?"
    ]
  },
  {
    "id": "1e0aa88d-0da0-4e03-b326-681550c80ecf",
    "questions": [
      "What was the birth year of Niënor?",
      "Who was Niënor's spouse?",
      "What name did Túrin give to Niënor when he found her?",
      "What tragic event led to Niënor's suicide?",
      "How did Glaurung affect Niënor's memory?"
    ]
  },
  {
    "id": "1e3942fe-6aaa-4caf-9e60-0a0241162067",
    "questions": [
      "What was the birth year of Tar-Telemmaitë?",
      "Who succeeded Tar-Telemmaitë as the ruler of Númenor?",
      "How long did Tar-Telemmaitë rule Númenor?",
      "What was the name of Tar-Telemmaitë's daughter?",
      "What significant action did Tar-Telemmaitë take during his reign regarding mithril?"
    ]
  },
  {
    "id": "1e78bc55-fc24-4583-ae87-0b9c122abcc4",
    "questions": [
      "What year was Ilberic Brandybuck born?",
      "Who were Ilberic Brandybuck's parents?",
      "How many siblings did Ilberic Brandybuck have?",
      "What are the names of Ilberic Brandybuck's siblings?",
      "What significant event might Ilberic Brandybuck have attended?"
    ]
  },
  {
    "id": "1ea017f9-2a8f-4dcd-b65e-641a02e22732",
    "questions": [
      "What year was Borin born?",
      "Who was Borin's younger nephew that accompanied him to the Lonely Mountain?",
      "What significant event occurred at the Lonely Mountain during Borin's lifetime?",
      "Which future king did Borin's nephew Thrór become?",
      "Which notable characters are descendants of Borin?"
    ]
  },
  {
    "id": "1ecf0b7b-39e2-42a0-842f-ff06e07a3b29",
    "questions": [
      "What race is Naugladur?",
      "Who did Naugladur hire to take Doriath?",
      "What was the outcome of Naugladur's confrontation with Beren?",
      "In what year did Naugladur die?",
      "What treasure did Naugladur take after defeating Tinweilant?"
    ]
  },
  {
    "id": "1fb75c2c-cf16-49a4-b69c-26f98072a8e5",
    "questions": [
      "What is the birth year of Thorin III Stonehelm?",
      "Who was Thorin III's father?",
      "In which battle did Thorin III fight during the Great War of the Ring?",
      "What significant event occurred in TA 3019 related to Thorin III?",
      "Which notable ally did Thorin III's realm become close to during his rule?"
    ]
  },
  {
    "id": "20d781d7-03f8-49d5-a42b-f8e710afdb73",
    "questions": [
      "What was Ted Sandyman's reaction to Sam Gamgee's tales about the Tree-man?",
      "In what year did Ted Sandyman die?",
      "What significant event occurred on November 3, 3019, involving Ted Sandyman?",
      "Who bought the Old Mill after Frodo and Sam left the Shire?",
      "What did Ted Sandyman do at the New Mill after Saruman took over its operation?"
    ]
  },
  {
    "id": "20e14af9-609c-4ed6-a116-80467be0210c",
    "questions": [
      "What is the name of Rufus Burrows' spouse?",
      "What race is Rufus Burrows?",
      "How many children did Rufus Burrows have?",
      "In what year was Rufus Burrows' son Milo born?",
      "What is the full name of Rufus Burrows' son?"
    ]
  },
  {
    "id": "210a50a3-dd72-4d06-bbbb-d53ae6b0d8c7",
    "questions": [
      "What year was Odo Proudfoot born?",
      "Who were Odo Proudfoot's parents?",
      "What event did Odo Proudfoot attend on September 22, 1401?",
      "What was Odo Proudfoot's relationship to Bilbo Baggins?",
      "What was the name of Odo Proudfoot's grandson?"
    ]
  },
  {
    "id": "215b54b2-b814-4398-8328-d4cdb772b507",
    "questions": [
      "Who were the parents of Adalgar Bolger?",
      "How many siblings did Adalgar Bolger have?",
      "What were the names of Adalgar Bolger's children?",
      "In what year did Adalgar Bolger die?",
      "What was the age of Adalgar Bolger at the time of his death?"
    ]
  },
  {
    "id": "21a7062f-4e75-4846-ad88-32c48bb04583",
    "questions": [
      "What year was Madoc Brandybuck born?",
      "Who was Madoc Brandybuck's spouse?",
      "How old was Madoc Brandybuck when he died?",
      "What position did Madoc Brandybuck hold in Buckland?",
      "What is the name of Madoc Brandybuck's son?"
    ]
  },
  {
    "id": "21e82c66-caa8-4ef8-9416-526779f40847",
    "questions": [
      "What was Bifur's occupation before joining Thorin Oakenshield's quest?",
      "In which battle did Bifur fight valiantly and kill numerous enemies?",
      "What event led to Bifur and his family being driven out of the Lonely Mountain?",
      "What instrument did Bifur play at the meeting at Bag End?",
      "What did Dáin II give to Bifur after the Battle of Five Armies?"
    ]
  },
  {
    "id": "224cc89c-26f9-4e82-9704-65c6a96b8f6c",
    "questions": [
      "What significant event did Ghân-buri-Ghân participate in on March 13, 3019?",
      "Who did Ghân-buri-Ghân meet with during the War of the Ring?",
      "What promise did King Théoden make to Ghân-buri-Ghân after their meeting?",
      "What decree did Aragorn II issue regarding the Drúadan Forest after the War of the Ring?",
      "What was the purpose of the Gondrant that Ghân-buri-Ghân revealed to the Rohirrim?"
    ]
  },
  {
    "id": "22cb8b7a-6c65-40a9-b265-d15ab5fd59a7",
    "questions": [
      "What year was Bucca of the Marish born?",
      "In what year did Bucca become Shire-thain?",
      "What family did Bucca of the Marish found?",
      "In which region did Bucca settle after founding his family?",
      "What is known about the later portions of Bucca's life and his cause of death?"
    ]
  },
  {
    "id": "230e222c-ecba-4af0-999c-572a334ffc6b",
    "questions": [
      "What is the race of Manwendil?",
      "Who are the siblings of Manwendil?",
      "When was Manwendil born?",
      "What is known about Manwendil's marital status?",
      "What relationship did J.R.R. Tolkien consider for the children of Elros?"
    ]
  },
  {
    "id": "232b255f-d5e8-4fef-826b-d2d6d15bd8ac",
    "questions": [
      "What year was Glóin born?",
      "In what year did Glóin become king of Durin's Folk?",
      "Who succeeded Glóin as king after his death?",
      "What realm did Glóin rule over?",
      "What significant event occurred in TA 2210 involving Glóin and his father?"
    ]
  },
  {
    "id": "23955e80-b4db-400d-aff6-c4d0e36e61ab",
    "questions": [
      "What relationship do Fíli and Kíli have with Thorin?",
      "In which year were Fíli and Kíli born?",
      "What notable feature did Fíli have compared to other Dwarves?",
      "How did Fíli and Kíli escape from the Elvenking Thranduil's cells?",
      "What event led to the deaths of Fíli and Kíli?"
    ]
  },
  {
    "id": "244e55b2-f680-48df-afd6-43dccad2440a",
    "questions": [
      "What significant invention is Rúmil credited with in Valinor?",
      "Which Elvish culture did Rúmil become a part of?",
      "What language did Rúmil study to discover its changes upon the arrival of the Teleri?",
      "Which group of Elves did Rúmil choose to remain with when the Ñoldor returned to Middle-earth?",
      "What is the name of the alphabet that Rúmil invented?"
    ]
  },
  {
    "id": "245568e4-f095-476a-8818-0e1269261ee2",
    "questions": [
      "What is the birth year of Frerin?",
      "Who are the siblings of Frerin?",
      "In which significant battle did Frerin perish?",
      "What is the relationship between Frerin and Thorin Oakenshield?",
      "Where did Frerin live before his death?"
    ]
  },
  {
    "id": "247dc42b-25a4-49e9-a16e-b6da44daf3f3",
    "questions": [
      "What year did Turambar ascend to the throne of Gondor?",
      "Who succeeded Turambar as king of Gondor?",
      "How long did Turambar reign as king?",
      "What significant action did Turambar take in relation to his father's death?",
      "In which realm did Turambar rule?"
    ]
  },
  {
    "id": "2482ab2b-3c09-495f-801f-dfd8ba86afda",
    "questions": [
      "What was Mahtan's profession in Valinor?",
      "Who was Mahtan's notable pupil and son-in-law?",
      "What did Mahtan regret teaching Fëanor?",
      "What decision did Mahtan make regarding the Revolt of the Ñoldor?",
      "What is unusual about Mahtan's physical appearance as an Elf?"
    ]
  },
  {
    "id": "24a395a0-f3ce-4ba2-bc6e-090d3999ad58",
    "questions": [
      "What is the birth year of Rosamunda (Took) Bolger?",
      "Who is Rosamunda's spouse?",
      "How many children did Rosamunda and Odovacar Bolger have?",
      "What notable event did Rosamunda attend in September 3001?",
      "Who was Rosamunda's younger brother?"
    ]
  },
  {
    "id": "24c69c2b-a777-46f7-affe-91166b285e58",
    "questions": [
      "What is the full name of the character?",
      "What is the ID associated with Theobald Bolger?",
      "Is there any information on the race or gender of Theobald Bolger?",
      "What notable characteristics or details are provided about Theobald Bolger?",
      "Are there any relationships or family members mentioned for Theobald Bolger?"
    ]
  },
  {
    "id": "251e9623-2b26-4ec6-81ca-ec01b83c719f",
    "questions": [
      "What position did Ferumbras III Took hold in the Shire?",
      "Who was Ferumbras III Took's father?",
      "In what year was Ferumbras III Took born?",
      "Who succeeded Ferumbras III Took as Shire-thain?",
      "Why did Ferumbras III Took never marry?"
    ]
  },
  {
    "id": "276a7985-156f-44d5-83ba-2f7cd4c426c8",
    "questions": [
      "What race is Ciryatur?",
      "In which age was Ciryatur born?",
      "What significant event did Ciryatur's navies participate in during SA 1700?",
      "What was the outcome of the Battle of the Gwathló?",
      "What is known about Ciryatur's fate after his military achievements?"
    ]
  },
  {
    "id": "2801f976-ec5d-4959-a61f-dc841adf7506",
    "questions": [
      "What was the name of Fíriel's father?",
      "In what year did Fíriel marry Prince Arvedui?",
      "Who were Fíriel's siblings?",
      "What happened to Fíriel's father and brothers during the invasion?",
      "What was the name of Fíriel and Arvedui's son?"
    ]
  },
  {
    "id": "284e345a-e501-4312-a593-99f07cd43f85",
    "questions": [
      "What is the race of Eldalótë?",
      "Who is Eldalótë's spouse?",
      "What is the name of Eldalótë's son?",
      "In which realm did Eldalótë marry Angrod?",
      "What event led to Orodreth escaping to Nargothrond?"
    ]
  },
  {
    "id": "287eac89-cd10-4e1e-80b3-73aadd0182dd",
    "questions": [
      "What race is Urthel?",
      "In which age was Urthel born?",
      "Who did Urthel remain with after the Dagor Bragollach?",
      "What event led to Urthel and his company becoming outlaws?",
      "How did Urthel meet his end?"
    ]
  },
  {
    "id": "28972565-2a03-4a04-95fa-dc5f86dc1780",
    "questions": [
      "What role did Ceorl serve during the War of the Ring?",
      "What news did Ceorl bring from the Fords of Isen?",
      "How did Théoden's words affect Ceorl's morale?",
      "Which battle did Ceorl presumably fight in after joining Théoden's army?",
      "What is known about Ceorl's fate after the battle at Helm's Deep?"
    ]
  },
  {
    "id": "28d2d01b-c5f1-4545-8320-35eee36577d2",
    "questions": [
      "What lineage did Adrahil I belong to?",
      "In which year did Adrahil serve as a general during the Wars of the Wainriders?",
      "What was Adrahil's role during the battle against the Wainriders?",
      "What was the fate of Adrahil after the battle near the Black Gate?",
      "Who commanded the center of the army during the conflict with the Wainriders?"
    ]
  },
  {
    "id": "295fdd5a-f1c6-4b3a-a5cb-0961be3d3f9b",
    "questions": [
      "What year did Arvedui become King of Arthedain?",
      "Who was Arvedui's spouse?",
      "In which realm did Arvedui rule?",
      "What significant event occurred in TA 1974 during Arvedui's reign?",
      "What was the fate of Arvedui's ship in the Icebay of Forochel?"
    ]
  },
  {
    "id": "2a22179f-66a9-4130-936e-72deabe763f4",
    "questions": [
      "What race is Grithnir?",
      "Who chose Grithnir to escort Túrin?",
      "In which realm did Grithnir serve as a guardian for Túrin?",
      "What event caused Grithnir to remain in Doriath until his death?",
      "What was the relationship between Grithnir and Gethron?"
    ]
  },
  {
    "id": "2b334cfb-209e-49c6-a1a1-185f91a8b4c3",
    "questions": [
      "What is the race of Holman Greenhand?",
      "In which year was Holman Greenhand born?",
      "What is the gender of Holman Greenhand?",
      "What is the full name of the character with the ID 2b334cfb-209e-49c6-a1a1-185f91a8b4c3?",
      "Is Holman Greenhand a male or female character?"
    ]
  },
  {
    "id": "2b3708d9-b224-478e-b435-98625942fd3b",
    "questions": [
      "What was Alatar's original role before becoming one of the Istari?",
      "Who accompanied Alatar on his journey to Middle-earth?",
      "What color robes did Alatar and Pallando wear upon their arrival in Middle-earth?",
      "What was one of the main objectives of Alatar and the other Istari during their mission?",
      "What is known about the fate of Alatar and Pallando after they traveled east?"
    ]
  },
  {
    "id": "2bb3b01f-9e88-4a96-ac55-009436033827",
    "questions": [
      "What year was Hildibrand Took born?",
      "Who were Hildibrand Took's parents?",
      "How many siblings did Hildibrand Took have?",
      "What is the name of Hildibrand Took's son?",
      "In what year did Hildibrand Took die?"
    ]
  },
  {
    "id": "2c7065fc-f92f-494d-8840-d7091347cb93",
    "questions": [
      "What significant battle did Elendur participate in during the Last Alliance?",
      "Who was Elendur's father and what was his role in the context of the One Ring?",
      "In which realm did Elendur likely live with his father after the Fall of Númenor?",
      "What tragic event led to Elendur's death along with his family?",
      "How did Elendur's appearance compare to that of his grandfather Elendil?"
    ]
  },
  {
    "id": "2c87cc19-94b6-4c96-86f3-7c7d6aaf4da5",
    "questions": [
      "What is the name of Nimloth's spouse?",
      "In which realm did Nimloth become Queen?",
      "What year did Nimloth die?",
      "How many children did Nimloth have?",
      "What tragic event led to Nimloth's death?"
    ]
  },
  {
    "id": "2cd908a2-aad1-4b5e-a292-b127a7d0116f",
    "questions": [
      "What race does Lenwë belong to?",
      "Who did Lenwë follow during the Great Journey to Valinor?",
      "What significant action did Lenwë take at the Anduin?",
      "What group did Lenwë found?",
      "What is known about Lenwë's ultimate fate?"
    ]
  },
  {
    "id": "2dcee032-8f06-4e0f-bc7c-1cb84db88857",
    "questions": [
      "What title did the Master of Lake-town hold during the arrival of Thorin and Company in TA 2941?",
      "How did the Master of Lake-town respond to Thorin's declaration of being the King under the Mountain?",
      "What actions did the Master take when Smaug attacked Lake-town?",
      "What was the fate of the Master of Lake-town after the events of the Battle of Five Armies?",
      "How did the people of Lake-town react to the Master's leadership during the crisis with Smaug?"
    ]
  },
  {
    "id": "2e032959-52c5-44c4-b3c2-8228d2ef23f2",
    "questions": [
      "What year was Jessamine (Boffin) Bolger born?",
      "Who were Jessamine's parents?",
      "What is the name of Jessamine's spouse?",
      "How many children did Jessamine and Herugar Bolger have?",
      "In which age did Jessamine die?"
    ]
  },
  {
    "id": "2e10ecf9-ad8c-450f-afb5-af98380e4281",
    "questions": [
      "What were the nicknames attached to Brandir's name and their origins?",
      "Who were Brandir's parents and what was notable about his mother?",
      "What was Brandir's stance on the conflict with the Orcs and why?",
      "How did Brandir's feelings for Níniel develop throughout the story?",
      "What event led to Brandir's death in FA 499?"
    ]
  },
  {
    "id": "2e5ba323-7cd0-4fab-8e17-64e9be4230d8",
    "questions": [
      "What year was Anárion born?",
      "What kingdom did Anárion help establish in Middle-earth?",
      "Which city did Anárion make his home in Gondor?",
      "In what year did Anárion die?",
      "What significant event did Anárion's son Meneldil achieve after his death?"
    ]
  },
  {
    "id": "2ea3cc86-2f90-4969-9a1d-efd2da5a47e0",
    "questions": [
      "What notable event did Glorfindel participate in during the Fall of Gondolin?",
      "In which year did Glorfindel die?",
      "What was Glorfindel's role during the Battle of Fornost?",
      "Who did Glorfindel escort when she wished to depart Gondolin?",
      "What prophecy did Glorfindel make about the Witch-king of Angmar?"
    ]
  },
  {
    "id": "2ee7b4a4-b9c4-43a7-8663-67b57ea1cdf6",
    "questions": [
      "What year was Bodo Proudfoot born?",
      "Who did Bodo Proudfoot marry?",
      "What is the name of Bodo Proudfoot's son?",
      "In which age period was Bodo Proudfoot born?",
      "How many children did Bodo Proudfoot have?"
    ]
  },
  {
    "id": "2f454949-0127-4dd7-b0c5-95fac716a496",
    "questions": [
      "What year was Dáin II Ironfoot born?",
      "Who was Dáin II Ironfoot's famous cousin and friend?",
      "What significant battle did Dáin II Ironfoot participate in during the War of the Ring?",
      "What was Dáin II Ironfoot's relationship with the Great Eagles after the Battle of Five Armies?",
      "Who succeeded Dáin II Ironfoot as King under the Mountain after his death?"
    ]
  },
  {
    "id": "2f512c39-08ce-410c-ab1e-5e2dbac00d86",
    "questions": [
      "What is the name of Bain's father?",
      "In which realm did Bain live?",
      "What significant event took place in TA 3001 during Bain's reign?",
      "Who succeeded Bain after his death?",
      "What year was Bain born?"
    ]
  },
  {
    "id": "2f857c0e-21ef-46c5-80f9-d5eb63adb37a",
    "questions": [
      "What is the full name of Rosie's spouse?",
      "In which year did Rosie and Sam get married?",
      "How many children did Rosie and Sam have, and can you name at least three of them?",
      "Where did Rosie and Sam live after their marriage, and where did they go for over a year later in life?",
      "What significant event in Rosie's life occurred on Mid-year's Day in FO 61?"
    ]
  },
  {
    "id": "2fed9215-5121-4dda-b8bc-9a2523c3ad8f",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier for Bilbo Gardner?",
      "Is there any information about Bilbo Gardner's race or gender?",
      "What are the notable characteristics or traits of Bilbo Gardner?",
      "Is there any biography or background information provided for Bilbo Gardner?"
    ]
  },
  {
    "id": "301616e7-a256-45ee-8390-1e6b5c780fbc",
    "questions": [
      "What year was Narmacil II born?",
      "How long did Narmacil II rule Gondor?",
      "What was the outcome of the Battle of the Plains for Narmacil II?",
      "Who succeeded Narmacil II after his death?",
      "What significant event occurred during the second year of Narmacil II's reign?"
    ]
  },
  {
    "id": "30623608-b3de-489e-b047-d2470bafdad7",
    "questions": [
      "What was the birth year of Túrin?",
      "Who was Túrin's spouse?",
      "What name did Túrin take when he became a leader of outlaws?",
      "What event led to Túrin's accidental killing of Beleg?",
      "What was the fate of Túrin's sister, Urwen?"
    ]
  },
  {
    "id": "312a53e9-c2cc-43dc-bcbf-80e2bdf7598f",
    "questions": [
      "What realm did Denethor lead his people to settle in?",
      "What was the name given to Denethor's people?",
      "In what year did Denethor die?",
      "What significant event led to Denethor's death?",
      "What change occurred in the Laiquendi's leadership after Denethor's death?"
    ]
  },
  {
    "id": "314a6b3d-f921-4064-907a-1163a5cf2dcc",
    "questions": [
      "What is the birth year of Gimli?",
      "Who is Gimli's father?",
      "What significant event did Gimli participate in during the War of the Ring?",
      "What title did Gimli hold after establishing a new Dwarf settlement?",
      "With whom did Gimli travel into the West?"
    ]
  },
  {
    "id": "31e17d4e-52a8-495c-9083-b11292570e2c",
    "questions": [
      "What role did Orophin play during the War of the Ring?",
      "Who are Orophin's brothers mentioned in the biography?",
      "In which realm did Orophin serve as a guard?",
      "What language did Orophin and his brother Rúmil have limited knowledge of?",
      "What action did Orophin take when he saw Gollum near the hobbits?"
    ]
  },
  {
    "id": "31fe96ff-b904-42d3-8892-b1ee07c96c97",
    "questions": [
      "What significant oath did Amrod and his brothers swear before leaving for Middle-earth?",
      "What prophecy did Nerdanel make regarding Amrod and his brother?",
      "In which battle did Amrod and his brothers rescue their father?",
      "What was the fate of Amrod during the Burning of the ships at Losgar?",
      "Who did Amrod share the lands of Estolad with?"
    ]
  },
  {
    "id": "32b8554b-7bed-4f53-acf1-69b992effb02",
    "questions": [
      "What race is Hathaldir?",
      "In which battle did Hathaldir fight alongside Barahir?",
      "What event led to Hathaldir's death?",
      "What was the fate of Hathaldir and the XII Bëorings at Tarn Aeluin?",
      "Who betrayed Hathaldir and the others, leading to their demise?"
    ]
  },
  {
    "id": "32d67209-bce1-411f-b391-de19d76a7d9e",
    "questions": [
      "What year was Fundin born?",
      "In which battle was Fundin slain?",
      "Where did Fundin settle after being forced into exile?",
      "What happened to Fundin's body after his death?",
      "What is known about Fundin's family or spouse?"
    ]
  },
  {
    "id": "32e5c9ce-e97c-4b22-b65f-a742ae4e0560",
    "questions": [
      "What significant event did Barahir participate in that earned him the Ring of Barahir?",
      "Who was Barahir's spouse and what title was she known by?",
      "In what year did Barahir die and what circumstances led to his death?",
      "Which members were part of Barahir's band of outlaws known as the XII Bëorings?",
      "What legacy did Barahir leave behind in relation to the Elves and later generations of Men?"
    ]
  },
  {
    "id": "332bbcf3-2c6e-4892-bc6e-fae3608cebf7",
    "questions": [
      "What is the name of Larnach's spouse?",
      "In which region did Larnach live after the Nírnaeth Arnoediad?",
      "What is the relationship between Larnach and Túrin?",
      "What type of raids did Larnach and his family experience?",
      "What is known about Larnach's fate?"
    ]
  },
  {
    "id": "3344214c-7f4f-4178-89b3-986ab6221120",
    "questions": [
      "What did Anborn report to his captain Faramir on March 7, 3019?",
      "What creature did Anborn theorize he saw scurry up a tree?",
      "What law of Gondor influenced Anborn's decision regarding the creature he saw?",
      "What notable event did Anborn witness in the Forbidden Pool?",
      "What is Anborn's race and gender?"
    ]
  },
  {
    "id": "33671407-652b-4c7e-a902-b83b359a5847",
    "questions": [
      "What year was Walda born?",
      "Who was Walda's father?",
      "How long did Walda reign as King of Rohan?",
      "In what year did Walda die?",
      "What event led to Walda's death?"
    ]
  },
  {
    "id": "33aa8f7b-620d-4d27-ae20-fd85742698f5",
    "questions": [
      "What were the names of Tar-Elendil's children?",
      "In which realm did Tar-Elendil reside?",
      "What principle of succession did Silmariën face that prevented her from ruling?",
      "When did Tar-Elendil die, and how old was he at the time of his death?",
      "Who succeeded Tar-Elendil as King of Númenor?"
    ]
  },
  {
    "id": "33cda45e-9ae5-4337-a008-447a34e0424e",
    "questions": [
      "What year was Bruno Bracegirdle born?",
      "Who is Bruno Bracegirdle's sister?",
      "What are the names of Bruno Bracegirdle's children?",
      "Who were Bruno Bracegirdle's parents?",
      "In what year did Bruno Bracegirdle die?"
    ]
  },
  {
    "id": "34519301-13c2-45db-b1a7-6b14b250cead",
    "questions": [
      "What year was Atanatar II born?",
      "Who succeeded Atanatar II as the King of Gondor?",
      "What was the title given to Atanatar II that means 'the Glorious'?",
      "In which year did Atanatar II die?",
      "What was the significant impact of Atanatar II's reign on Gondor?"
    ]
  },
  {
    "id": "34b2fbf2-aa32-41b9-8c08-b36ac9f3f114",
    "questions": [
      "What role did Hob Hayward serve in the Shire before the War of the Ring?",
      "Who was Hob Hayward well acquainted with?",
      "What significant event did Hob Hayward participate in during Lotho Sackville-Baggins's reign?",
      "What did Hob Hayward do when Frodo Baggins and his companions returned to the Shire?",
      "What is known about Hob Hayward's fate after the events described in his biography?"
    ]
  },
  {
    "id": "34b38f4d-e697-448b-8285-48277d9851a3",
    "questions": [
      "What was Hendor's role during the First Age?",
      "Who did Hendor serve as a house-carle?",
      "What significant event did Hendor participate in involving Eärendil?",
      "What danger did Hendor help to navigate during the Fall of Gondolin?",
      "Which other characters were involved alongside Hendor during the Fall of Gondolin?"
    ]
  },
  {
    "id": "35294ebc-5fa7-4156-aa30-13fe62f8fa52",
    "questions": [
      "What is the birth year of Mirabella (Took) Brandybuck?",
      "Who was Mirabella's spouse?",
      "How many siblings did Mirabella have?",
      "In which year did Mirabella (Took) Brandybuck pass away?",
      "What are the names of Mirabella's children?"
    ]
  },
  {
    "id": "35a0be96-ec25-4d1a-99c4-b2a4134f8040",
    "questions": [
      "What is the birth year of Glóredhel?",
      "Who is Glóredhel's spouse?",
      "What event led to Glóredhel's death?",
      "Who are Glóredhel's siblings?",
      "What is the name of Glóredhel's child?"
    ]
  },
  {
    "id": "35b4394b-8a48-4086-b574-a96cbf43a67f",
    "questions": [
      "What is the birth year of Bosco Boffin?",
      "Who were Bosco Boffin's parents?",
      "In what year did Bosco Boffin marry and have his son?",
      "How many siblings did Bosco Boffin have?",
      "What was the name of Bosco Boffin's son?"
    ]
  },
  {
    "id": "35ec116e-3c59-4129-83c8-9e98ec79495d",
    "questions": [
      "What significant event led to Bard II becoming King of Dale?",
      "Who was Bard II's predecessor as king?",
      "What notable trade relationships did Bard II establish during his reign?",
      "What weapon did Bard II inherit from his great-grandfather?",
      "In which era did Bard II die?"
    ]
  },
  {
    "id": "35f62f13-8c5f-486d-900b-aaeb03de6080",
    "questions": [
      "What year was Déor born?",
      "Who was Déor's father?",
      "In what year did Déor become King of Rohan?",
      "What significant event occurred in TA 2710 during Déor's reign?",
      "Who succeeded Déor as King of Rohan after his death?"
    ]
  },
  {
    "id": "36122aa6-5028-4629-979f-238e1eb872fb",
    "questions": [
      "What title did Telumehtar take after recapturing the city of Umbar?",
      "In which year did Telumehtar succeed his father Tarondor as King?",
      "Who were the two sons of Telumehtar?",
      "What major event weakened Gondor's strength during Telumehtar's reign?",
      "What was the fate of the Corsairs of Umbar during Telumehtar's campaign?"
    ]
  },
  {
    "id": "3631a3d5-6e4b-4273-aea9-da24930abcb4",
    "questions": [
      "Who are the parents of Pansy Baggins?",
      "What is the birth order of Pansy Baggins among her siblings?",
      "Who did Pansy Baggins marry?",
      "Did Pansy Baggins have any children?",
      "What are the names of Pansy Baggins' siblings?"
    ]
  },
  {
    "id": "36391e84-5241-4e1c-9c85-315dd4bef668",
    "questions": [
      "What significant choice did Arwen make regarding her immortality?",
      "In which realm did Arwen become queen after her marriage?",
      "What was the name of Arwen's father?",
      "What event did Arwen and Aragorn participate in on the mound of Cerin Amroth?",
      "How many years after Aragorn's death did Arwen pass away?"
    ]
  },
  {
    "id": "3704547a-be1a-4818-b4ea-78780f0de851",
    "questions": [
      "Who was Morwen's father?",
      "What is the relationship between Morwen and Orodreth?",
      "To which house does Morwen belong?",
      "What significant role did Morwen's grandson, Egalmoth, hold?",
      "In which age did Morwen live and eventually die?"
    ]
  },
  {
    "id": "3719e9d4-42ac-4e50-9068-2e1f9d9ccf08",
    "questions": [
      "What is the full name of the character known as Goldilocks?",
      "What is the family name of Goldilocks?",
      "Is there any information about Goldilocks' relationships or family?",
      "What other names or titles is Goldilocks known by?",
      "What is the significance of the character Goldilocks in literature?"
    ]
  },
  {
    "id": "375c1dde-c74b-4787-addb-8136345642b6",
    "questions": [
      "What was Sauron's original name before he became known as Sauron?",
      "In which fortress did Sauron serve as a lieutenant under Melkor during the First Age?",
      "What title did Sauron adopt when he disguised himself to deceive the Elves during the Second Age?",
      "What significant event occurred on March 25, 3019, related to Sauron?",
      "How did Sauron's defeat at Mount Doom ultimately affect his ability to take shape again?"
    ]
  },
  {
    "id": "37975783-ab97-421e-acab-b9e21c5f66c1",
    "questions": [
      "What year was Beren born?",
      "Who was Beren's father?",
      "What position did Beren hold after his father's death?",
      "In which years did the Long Winter occur during Beren's stewardship?",
      "Who succeeded Beren as the Ruling Steward after his death?"
    ]
  },
  {
    "id": "37eed81f-2456-4b32-95d4-296049b1c01a",
    "questions": [
      "What year was Adelard Took born?",
      "Who were Adelard Took's parents?",
      "What were the names of Adelard Took's sons?",
      "What notable event occurred after Bilbo's Farewell Birthday Party involving Adelard?",
      "In what year did Adelard Took die?"
    ]
  },
  {
    "id": "38801f9d-99a7-4c01-80f8-23d932ad34df",
    "questions": [
      "What significant event occurred in FA 455 that affected Aegnor's fate?",
      "Who was Aegnor in love with, and what was her background?",
      "In which location was Aegnor born, and during what period?",
      "What role did Aegnor play during the Siege of Angband?",
      "Why did Aegnor never marry despite his feelings for Andreth?"
    ]
  },
  {
    "id": "3af94e96-e506-492e-b88a-6554d8b0ca2c",
    "questions": [
      "What race is Beldis?",
      "Who is Beldis married to?",
      "What is the name of Beldis's son?",
      "What condition did Beldis's son Brandir have at birth?",
      "Who is Beldis's father?"
    ]
  },
  {
    "id": "3afb0f02-7912-407e-994d-9a9a596a94b4",
    "questions": [
      "What significant event did Gwindor initiate that is associated with his brother Gelmir's death?",
      "How long was Gwindor enslaved in Angband?",
      "What injury did Gwindor sustain during his escape from Angband?",
      "Who was Gwindor betrothed to, and why was their engagement broken?",
      "In which battle was Gwindor mortally wounded, and what was his final request to Túrin?"
    ]
  },
  {
    "id": "3b36b497-09fc-40e0-8a69-f6341bd43912",
    "questions": [
      "What realm did Vidugavia rule over?",
      "Who was Minalcar in relation to Vidugavia?",
      "In what year did Minalcar send his son on a diplomatic mission to Vidugavia's court?",
      "What is the name of Vidugavia's daughter who married Prince Valacar?",
      "Who are the notable descendants of Vidugavia mentioned in the biography?"
    ]
  },
  {
    "id": "3b70dcdb-9fd8-4f50-bc74-9aaa9a815e36",
    "questions": [
      "What is the birth year of Axantur?",
      "Who was Axantur's father?",
      "Name the children of Axantur.",
      "What is the relationship between Axantur and King Tar-Elendil?",
      "Who did Axantur's great-grandson marry?"
    ]
  },
  {
    "id": "3babafd4-87e5-4440-9755-f08fe14a43d8",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier for Orgulas Brandybuck?",
      "Is there any information about the race or gender of Orgulas Brandybuck?",
      "What notable events or characteristics are associated with Orgulas Brandybuck?",
      "Who is Orgulas Brandybuck's spouse, if mentioned?"
    ]
  },
  {
    "id": "3bc908d9-79f5-45ee-a78f-3778c7581f15",
    "questions": [
      "What was Éowyn's birth year?",
      "Who was Éowyn's spouse?",
      "What alias did Éowyn use when she disguised herself to go to battle?",
      "Which significant battle did Éowyn fight in where she confronted the Witch-king?",
      "What did Éowyn and Faramir name their son?"
    ]
  },
  {
    "id": "3bd97492-41bc-4409-837d-56a0737615c0",
    "questions": [
      "What is the birth year of Hamson Gamgee?",
      "Who are the siblings of Hamson Gamgee?",
      "In which location was Hamson Gamgee born?",
      "What is the name of Hamson Gamgee's father?",
      "Where did Hamson Gamgee later move to?"
    ]
  },
  {
    "id": "3c5016bf-2d43-435d-8143-4b3aeca26ace",
    "questions": [
      "What race does Arminas belong to?",
      "Who was Arminas's companion during his wanderings?",
      "What warning did Arminas and Gelmir bring to Nargothrond?",
      "Who did Arminas argue with over the fate of Nargothrond?",
      "What was the ultimate fate of Arminas?"
    ]
  },
  {
    "id": "3c5c2e70-b896-44d1-856a-60eae9fa4eba",
    "questions": [
      "Who were Silmariën's siblings?",
      "What significant items did Silmariën inherit from her father?",
      "What was the name of Silmariën's husband?",
      "Who was the first Lord of Andúnië?",
      "Why was Silmariën passed over for the throne?"
    ]
  },
  {
    "id": "3caae46c-69ae-4e6f-89fa-c73a06e9f118",
    "questions": [
      "What title was given to Angbor by Aragorn?",
      "During which major conflict did Angbor defend Linhir?",
      "How many men did Angbor lead to Minas Tirith?",
      "Who arrived at Minas Tirith around the same time as Angbor?",
      "What was the name of the enemy forces Angbor was defending against?"
    ]
  },
  {
    "id": "3cdecb7f-5fc1-4b73-b112-2ae7b897d02b",
    "questions": [
      "What is the race of Baranor?",
      "Who is Baranor's son?",
      "In what year was Baranor born?",
      "Who are Baranor's immediate family members mentioned in the biography?",
      "What significant action did Baranor's son Bereg take?"
    ]
  },
  {
    "id": "3d2aa09f-966d-428c-8e30-0307289d7629",
    "questions": [
      "What was the name of Rían's father?",
      "Who became the Ruling Steward of Gondor after Dior's death?",
      "What is known about Rían's fate?",
      "In which year was Rían born?",
      "What influence may have inspired Rían's name?"
    ]
  },
  {
    "id": "3dd187b7-bf88-4578-bd35-1474f894837b",
    "questions": [
      "What race is Buffo Boffin?",
      "Who is Buffo Boffin's spouse?",
      "How many children did Buffo Boffin have?",
      "What is the name of the home where Buffo Boffin lived?",
      "In which era did Buffo Boffin live and die?"
    ]
  },
  {
    "id": "3ddaaae7-44c4-4250-a544-696712c2d789",
    "questions": [
      "What was Minohtar's role in the battle against the Wainriders?",
      "Who was Minohtar related to in terms of royal lineage?",
      "On what date did Minohtar die?",
      "What happened to the throne of Gondor after Minohtar's death?",
      "What was the outcome of Minohtar's fighting retreat during the battle?"
    ]
  },
  {
    "id": "3e4b7a16-46b1-442e-b2ee-66d727d5a5d7",
    "questions": [
      "What is the name of Curufin's son?",
      "In which realm did Curufin and his family live?",
      "What significant event led to Curufin and his brothers' exile to Middle-earth?",
      "Who did Curufin and Celegorm capture while hunting, and what was their intention?",
      "In what year did Curufin die, and what event was he involved in at that time?"
    ]
  },
  {
    "id": "3ee3d2ac-0683-431a-9776-aea10083872b",
    "questions": [
      "What year was Bowman Cotton born?",
      "Who are Bowman Cotton's parents?",
      "How many siblings did Bowman Cotton have?",
      "In which battle did Bowman Cotton fight alongside his family?",
      "Who is Bowman's sister married to?"
    ]
  },
  {
    "id": "3ee4c110-e7b0-4ec7-8619-c378e63fb3b1",
    "questions": [
      "What year was Merimac Brandybuck born?",
      "Who were Merimac Brandybuck's parents?",
      "What is the name of Merimac Brandybuck's sibling?",
      "How many children did Merimac Brandybuck have?",
      "In what year did Merimac Brandybuck die?"
    ]
  },
  {
    "id": "3ef97f13-7b45-4628-b369-ed760f051267",
    "questions": [
      "What significant event did Sador participate in during the year 455?",
      "How did Sador lose his right foot?",
      "What relationship did Sador have with Túrin while serving in Húrin's household?",
      "What did Sador advise Túrin regarding the Elven knife on his departure to Doriath?",
      "What ultimately led to Sador's death during the uprising in Brodda's hall?"
    ]
  },
  {
    "id": "3f45e271-2e85-4b24-bb09-eafce411db64",
    "questions": [
      "What was the birth year of Tar-Calmacil?",
      "What is the race of Tar-Calmacil?",
      "What realm did Tar-Calmacil rule?",
      "What significant name did Tar-Calmacil have in Adûnaic?",
      "What does Tar-Calmacil's name signify about the Kings of Númenor?"
    ]
  },
  {
    "id": "3faf20c9-9f6e-4355-bbfa-23c898a649bc",
    "questions": [
      "What year was Dori born?",
      "Who did Dori live with before the Quest of Erebor?",
      "What role did Dori play during the escape from the Goblins?",
      "In which battle did Dori fight and survive?",
      "What event is Dori likely to have participated in after the Battle of Five Armies?"
    ]
  },
  {
    "id": "40b3e69d-3b99-4632-9106-a25abadd31be",
    "questions": [
      "What is the race of Rowan Greenhand?",
      "Who is Rowan Greenhand's spouse?",
      "In what year was Rowan Greenhand born?",
      "How many siblings did Rowan Greenhand have?",
      "What is the name of Rowan Greenhand's son?"
    ]
  },
  {
    "id": "4115c91d-eb4f-4a2b-bb94-b72e2857ed7d",
    "questions": [
      "What realm did Orodreth rule as king?",
      "Who was Orodreth's spouse?",
      "In which battle did Orodreth die?",
      "What significant action did Orodreth take regarding the method of warfare in Nargothrond?",
      "What was Orodreth's relationship to Fingolfin?"
    ]
  },
  {
    "id": "41907773-86e4-4084-bf21-6734ae7c17f4",
    "questions": [
      "What significant construction project did Ecthelion I oversee during his stewardship?",
      "In what year did Ecthelion I succeed his father as Steward?",
      "Who succeeded Ecthelion I as Steward of Gondor after his death?",
      "What was the relationship between Ecthelion I and Orodreth?",
      "How old was Ecthelion I at the time of his death?"
    ]
  },
  {
    "id": "4204e421-036a-4639-a526-09a1f42c44ad",
    "questions": [
      "What is the race of Eilinel?",
      "Who is Eilinel's spouse?",
      "In which age was Eilinel born?",
      "During which years did Eilinel die?",
      "What is the gender of Eilinel?"
    ]
  },
  {
    "id": "42a50a97-ebc1-480d-8dc6-6d645ef77ffc",
    "questions": [
      "What is the birth date of Samwise Gamgee?",
      "Who is Samwise Gamgee's spouse?",
      "How many children did Samwise Gamgee have?",
      "What significant role did Samwise play during the quest to destroy the One Ring?",
      "What did Samwise do after the death of his wife in the Fourth Age?"
    ]
  },
  {
    "id": "42f9bbf6-a72a-4649-b8f8-07eb238cd7a8",
    "questions": [
      "What significant event led Haleth to become the leader of the House of Haladin?",
      "In which region did Haleth's people settle after the Orc siege?",
      "What was the name of the burial site created for Haleth after her death?",
      "How did Haleth respond to Caranthir's offer of land for her people?",
      "Who succeeded Haleth as the leader of the Haladin after her death?"
    ]
  },
  {
    "id": "4323406f-1e2f-48bc-b06c-98f01055d6f8",
    "questions": [
      "What year was Dírhael born?",
      "Who was Dírhael's spouse?",
      "What was Dírhael's relationship with Arador?",
      "How did Dírhael feel about his daughter Gilraen's relationship with Arathorn?",
      "What was Dírhael's demeanor regarding emotions?"
    ]
  },
  {
    "id": "433ba54c-4f60-4bec-9e47-3d5f5b7a6bf4",
    "questions": [
      "What significant event did Borlas's father, Beregond, achieve during the War of the Ring?",
      "In which location did Borlas reside after the War of the Ring?",
      "What was Borlas's reaction when he caught a young man stealing from his garden?",
      "Who did Borlas take under his wing after scolding him for stealing?",
      "What information did the young man Borlas mentored later provide him about the world?"
    ]
  },
  {
    "id": "437d90b9-b00c-41fe-a1cb-0b9427d0a869",
    "questions": [
      "What was the birth year of Aldamir?",
      "Who was Aldamir's father?",
      "In what year did Aldamir become king?",
      "What significant event led to Aldamir becoming king?",
      "Who succeeded Aldamir after his death?"
    ]
  },
  {
    "id": "438f9dd5-6921-4387-a19e-f589e92f3277",
    "questions": [
      "What year was Ponto Baggins II born?",
      "Who were Ponto Baggins II's parents?",
      "What significant event did Ponto Baggins II attend in 3001?",
      "What is the name of Ponto Baggins II's daughter?",
      "Which family did Ponto Baggins II presumably become the head of in the Fourth Age?"
    ]
  },
  {
    "id": "44476818-3275-40d5-8d48-4bd34b299786",
    "questions": [
      "What is the race of Saelon?",
      "What is the gender of Saelon?",
      "In which Age was Saelon born?",
      "What is the name of the character described in the payload?",
      "Is there any information about Saelon's death or relationships?"
    ]
  },
  {
    "id": "449c0f50-1a8b-4a1b-9f23-b3959e59a757",
    "questions": [
      "What race is Damrod?",
      "Who was Damrod's companion during the events in March of TA 3019?",
      "What was Damrod's role in relation to Faramir?",
      "What did Damrod tell Frodo and Samwise about the Enemy's dealings?",
      "What significant event did Damrod participate in shortly before his death in TA 3019?"
    ]
  },
  {
    "id": "45781bd7-2b6d-4816-adf9-7d52a16e1abc",
    "questions": [
      "What is the race of Nurwë?",
      "When was Nurwë born?",
      "What is the significance of Nurwë's birth being described as 'Firstborn'?",
      "Are there any details about Nurwë's family or relationships?",
      "What notable characteristics are associated with Nurwë as an Elf?"
    ]
  },
  {
    "id": "466466f0-0b3e-4aab-927a-c2d2c49e5b1a",
    "questions": [
      "What is the birth year of Primrose Bracegirdle?",
      "Who are the siblings of Primrose Bracegirdle?",
      "What is the name of Primrose Bracegirdle's spouse?",
      "How many children did Primrose Bracegirdle have?",
      "Which family was Primrose Bracegirdle born into?"
    ]
  },
  {
    "id": "46f9ce36-51ba-4375-8315-5eaf39e2c6da",
    "questions": [
      "What significant role did Hador play in the service of Fingolfin?",
      "Who were Hador's children and whom did they marry?",
      "What was the name of the land granted to Hador by Fingolfin?",
      "In what year did Hador die, and what event led to his death?",
      "Who were some of Hador's notable descendants mentioned in the biography?"
    ]
  },
  {
    "id": "47997934-633f-4580-b7e7-c4fa05a72f53",
    "questions": [
      "What year was Celandine Brandybuck born?",
      "Who were Celandine Brandybuck's parents?",
      "How is Celandine Brandybuck related to Frodo Baggins?",
      "What significant event did Celandine Brandybuck attend?",
      "What are the names of Celandine Brandybuck's brothers?"
    ]
  },
  {
    "id": "479d4859-b82d-48f7-aba9-4dda38546d0b",
    "questions": [
      "What was Beregond's role in the Citadel before the War of the Ring?",
      "Who did Beregond serve alongside during the Siege of Gondor?",
      "What significant action did Beregond take to protect Faramir during the Siege of Gondor?",
      "What was the outcome of Beregond's actions after the War of the Ring when he was brought before King Elessar?",
      "In which battle did Beregond nearly lose his life due to a Troll?"
    ]
  },
  {
    "id": "480e9bea-8a65-4b7d-a227-1519769ed257",
    "questions": [
      "What race does Gethron belong to?",
      "Who did Gethron and Grithnir escort to the Elven King Thingol?",
      "What event led to Gethron's decision to return to Dor-lómin?",
      "How did Morwen react to Gethron's report about Túrin's reception by Thingol?",
      "During which age was Gethron born?"
    ]
  },
  {
    "id": "4818e122-ee5a-4491-8aee-518c182c0a49",
    "questions": [
      "What token of war did Hirgon present to Théoden, King of Rohan?",
      "In which year did Hirgon die?",
      "Who bidden Hirgon to deliver the message to the King of Rohan?",
      "What did Hirgon wear when he rode to deliver the Red Arrow?",
      "How was Hirgon found by the Riders of Rohan?"
    ]
  },
  {
    "id": "487302d4-3175-42fa-b811-92bfe8e9c9bb",
    "questions": [
      "What is the race of Blanco Bracegirdle?",
      "Who is Blanco Bracegirdle's spouse?",
      "In what year was Blanco Bracegirdle born?",
      "How many children did Blanco Bracegirdle have?",
      "Which family did Blanco Bracegirdle relate himself with after marriage?"
    ]
  },
  {
    "id": "487a23ee-a921-44d6-ab69-2191990b41fd",
    "questions": [
      "What year was Poppy (Chubb-Baggins) Bolger born?",
      "Who were Poppy (Chubb-Baggins) Bolger's parents?",
      "Who did Poppy (Chubb-Baggins) Bolger marry?",
      "In what year did Poppy (Chubb-Baggins) Bolger attend Bilbo's Farewell Party?",
      "What is the full name of Poppy (Chubb-Baggins) Bolger's husband?"
    ]
  },
  {
    "id": "48d0f1ab-3b3c-46c5-accb-94d9b63cefa8",
    "questions": [
      "What is the full birth date of Elanor Gardner?",
      "Who was Elanor Gardner's spouse?",
      "In what year did Elanor marry Fastred of Greenholm?",
      "What title was given to Fastred of Greenholm by Thain Peregrin Took?",
      "What was the name of Elanor Gardner's first son?"
    ]
  },
  {
    "id": "48de2a4c-1404-430d-8cc5-acda7e1e57dd",
    "questions": [
      "What year was Asphodel Burrows born?",
      "Who was Asphodel Burrows' spouse?",
      "How many children did Asphodel Burrows have?",
      "In what year did Asphodel attend Bilbo's Farewell Birthday Party?",
      "What was the year of Asphodel Burrows' death?"
    ]
  },
  {
    "id": "493a464b-5f61-4374-85af-d8d9a160f819",
    "questions": [
      "What was the relationship between Marhwini and his father Marhari?",
      "In which battle did Marhwini's father, Marhari, die?",
      "What significant event did Marhwini lead after the death of his father?",
      "What was the outcome of the Second Battle of Dagorlad involving Marhwini?",
      "Who was Marhwini's son?"
    ]
  },
  {
    "id": "49a71ed9-a97f-4533-aabf-f4946b6b27ba",
    "questions": [
      "What was Hirluin's role in the Battle of the Pelennor Fields?",
      "When did Hirluin die?",
      "What area was Hirluin lord of?",
      "How many men did Hirluin lead for the defense of Gondor?",
      "Where was Hirluin buried after his death?"
    ]
  },
  {
    "id": "4b09041b-f78b-4876-994c-739ac6e309f6",
    "questions": [
      "What is the birth year of Beren?",
      "Who is Beren's spouse?",
      "What significant task did Thingol require Beren to complete in order to marry Lúthien?",
      "What name was Beren given after Carcharoth bit off his hand?",
      "Who was the son of Beren and Lúthien, and what was his significance?"
    ]
  },
  {
    "id": "4b2ff9fb-d8c0-4d00-8e74-68dfb25b7bb0",
    "questions": [
      "What year was Tar-Ciryatan born?",
      "Who was Tar-Ciryatan's father?",
      "In what year did Tar-Ciryatan succeed his father as king?",
      "What significant activity did Tar-Ciryatan promote during his reign?",
      "Who succeeded Tar-Ciryatan after his abdication?"
    ]
  },
  {
    "id": "4b7d5ddb-79ba-4bf6-85b0-378dd890d7e3",
    "questions": [
      "What is the full name of the character described in the payload?",
      "What is the unique identifier associated with Ferdibrand Took?",
      "Is there any information about Ferdibrand Took's race or gender in the payload?",
      "Does the payload provide any details regarding Ferdibrand Took's relationships or family?",
      "What can be inferred about the character Ferdibrand Took based on the available information?"
    ]
  },
  {
    "id": "4b9a398b-c9db-4908-b006-c44ef3e4fa90",
    "questions": [
      "What is the birth year of Sigismond Took?",
      "Who were the children of Sigismond Took?",
      "What race does Sigismond Took belong to?",
      "In what year did Sigismond Took die?",
      "Who was the father of Sigismond Took?"
    ]
  },
  {
    "id": "4c12fb8f-6934-45a7-a241-b8869ff0bcc1",
    "questions": [
      "What is the race of Yávien?",
      "Who are Yávien's siblings?",
      "What year was Yávien born?",
      "Who was Yávien's father?",
      "What is known about Yávien's marital status?"
    ]
  },
  {
    "id": "4d392c30-6c8d-4c79-871b-3d947a571b22",
    "questions": [
      "What race is Borthand?",
      "In what year did Borthand die?",
      "Which significant battle did Borthand fight in?",
      "Who did Borthand remain loyal to during the conflict?",
      "What happened to Borthand during the battle against the traitors?"
    ]
  },
  {
    "id": "4d5364cf-b485-4dd1-ac67-3ef9fac28bdb",
    "questions": [
      "What year was Rose Gamgee born?",
      "How many siblings does Rose Gamgee have?",
      "Who are the two oldest siblings of Rose Gamgee?",
      "Who suggested the name Rose for her?",
      "Which character prophesied about Rose Gamgee's birth?"
    ]
  },
  {
    "id": "4d5b6b8c-97e5-444e-b88e-b980b361fb18",
    "questions": [
      "What year was Eradan born?",
      "Who was Eradan's father?",
      "In which year did Eradan become the Ruling Steward?",
      "How long did Eradan serve as Ruling Steward?",
      "Who succeeded Eradan after his death?"
    ]
  },
  {
    "id": "4e1a7c63-a265-41af-af83-f6f7605c0266",
    "questions": [
      "What significant battle did Eärnur win against the Witch-king of Angmar, and in what year did it take place?",
      "Who was Eärnur's father?",
      "What was the outcome of Eärnur's second challenge against the Witch-king?",
      "In which year did Eärnur become King of Gondor?",
      "What was the consequence of Eärnur's disappearance for the rule of Gondor?"
    ]
  },
  {
    "id": "4e203a63-37f1-4860-812c-ffda490981f4",
    "questions": [
      "What year was Tarcil born?",
      "Who was Tarcil's father?",
      "In what year did Tarcil ascend to the throne of Arnor?",
      "How long did Tarcil reign as king?",
      "Who succeeded Tarcil after his death?"
    ]
  },
  {
    "id": "4e450ccc-515d-46c3-85b4-d2181a01109f",
    "questions": [
      "What was the race of Dáin I?",
      "In which realm did Dáin I reign as king?",
      "What year did Dáin I die?",
      "Who succeeded Dáin I as king?",
      "What event led to the end of Dáin I's reign?"
    ]
  },
  {
    "id": "4e78e385-ef57-4fcb-b9e8-e96181f01f9d",
    "questions": [
      "What year was Eldacar born?",
      "Who was Eldacar's father?",
      "In which year did Eldacar ascend to the throne of Arnor?",
      "How long did Eldacar reign as king?",
      "Who succeeded Eldacar after his death?"
    ]
  },
  {
    "id": "4ec2da2a-37da-4999-818a-5265ff182d87",
    "questions": [
      "What year was Boromir born?",
      "Who was Boromir's father?",
      "What did Boromir try to convince Frodo to do regarding the One Ring?",
      "How did Boromir die?",
      "What was Boromir's relationship with his brother Faramir like?"
    ]
  },
  {
    "id": "4f77bdfc-0364-4b4e-8f11-b34412754b15",
    "questions": [
      "What significant event happened in Frodo's life in TA 2980?",
      "Who adopted Frodo Baggins after his parents' death?",
      "What was the name of the inn where Frodo and his companions stayed in Bree?",
      "What gift did Galadriel give to Frodo before the Fellowship departed from Lothlórien?",
      "On what date did Frodo depart Middle-earth for the Undying Lands?"
    ]
  },
  {
    "id": "4f88f8c2-e0a2-4796-8e6a-3c1f6aef2189",
    "questions": [
      "What is the birth year of Fosco Baggins?",
      "Who was Fosco Baggins' spouse?",
      "How many children did Fosco Baggins have?",
      "Which famous character is the grandson of Fosco Baggins?",
      "In what year did Fosco Baggins die?"
    ]
  },
  {
    "id": "4fdb0b30-8501-4a0e-8fa4-c43d12ed331d",
    "questions": [
      "What year was Reginard Took born?",
      "Who were Reginard Took's parents?",
      "Did Reginard Took have any siblings, and if so, who?",
      "In what significant event did Reginard Took participate in September of TA 3001?",
      "What is known about Reginard Took's life after attending Bilbo's Farewell Birthday Party?"
    ]
  },
  {
    "id": "50b31102-e6a1-4577-a2ab-07c7fb8b2c7b",
    "questions": [
      "What year was Elphir born?",
      "Who were Elphir's siblings?",
      "What is the name of Elphir's son?",
      "What notable event was Elphir a grown man during?",
      "Who was Elphir's father?"
    ]
  },
  {
    "id": "50fe88b2-5f2d-4f01-9689-373b70e98e74",
    "questions": [
      "What is the birth year of Elfhild?",
      "In which realm did Elfhild reside?",
      "Who was Elfhild's spouse?",
      "What year did Elfhild die?",
      "What significant event occurred in Elfhild's life related to childbirth?"
    ]
  },
  {
    "id": "5111f07c-1d93-476a-8940-f855c535b0f1",
    "questions": [
      "What year was Léod born?",
      "What was the cause of Léod's death?",
      "What significant event occurred involving Léod and the horse Felaróf?",
      "In which location did Léod live during his lordship?",
      "Who is Léod believed to be a descendant of?"
    ]
  },
  {
    "id": "512e3115-ef21-4ae9-87ee-5aea8e6d831c",
    "questions": [
      "What year was Ecthelion II born?",
      "Who was Ecthelion II's father?",
      "In which year did Ecthelion II succeed his father as Steward?",
      "What significant action did Thorongil persuade Ecthelion II to take against the Corsairs of Umbar?",
      "Who succeeded Ecthelion II after his death in TA 2984?"
    ]
  },
  {
    "id": "5145629f-f7cb-43c2-8393-6f4ba8024fad",
    "questions": [
      "What year was Hilda Brandybuck born?",
      "Who were Hilda Brandybuck's parents?",
      "What is the name of Hilda Brandybuck's spouse?",
      "How many children did Hilda Brandybuck have?",
      "What was Hilda Brandybuck's maiden name?"
    ]
  },
  {
    "id": "51efe008-30f6-475d-adb2-6b9ead5e8a5f",
    "questions": [
      "What year was Háma born?",
      "What significant event did Háma participate in before his death?",
      "Who did Háma greet upon their arrival to speak with King Théoden?",
      "What was Háma's role regarding the weapons of Gandalf, Aragorn, and Legolas?",
      "Where was Háma buried after his death?"
    ]
  },
  {
    "id": "52623267-baf8-4f04-b6be-c830cce42879",
    "questions": [
      "What race does Gildor belong to?",
      "In which age was Gildor born?",
      "Who did Gildor remain with after the Dagor Bragollach?",
      "What event led to Gildor and his companions being betrayed?",
      "In what year did Gildor die?"
    ]
  },
  {
    "id": "526e56b7-a4cc-4f93-88fc-d03ed71d73d1",
    "questions": [
      "What race is Beren (Belemir's son)?",
      "Who were Beren's parents?",
      "How many children did Beren have?",
      "What is the name of Beren's daughter?",
      "Which house did Beren's mother belong to?"
    ]
  },
  {
    "id": "531437ff-b365-4436-8a8c-5bb66293e5ec",
    "questions": [
      "What year was Folcred born?",
      "Who was Folcred's twin brother?",
      "In which battle were Folcred and his brother slain?",
      "What action did Túrin II take after the death of Folcred and his brother?",
      "Where were Folcred and his brother buried?"
    ]
  },
  {
    "id": "53310511-133f-4abb-bae7-1621942d6f31",
    "questions": [
      "What is the race of Druda Burrows Boffin?",
      "Who is Druda Burrows Boffin's spouse?",
      "In what era was Druda Burrows Boffin born?",
      "Did Druda Burrows Boffin have any children, and if so, how many?",
      "What is the gender of Druda Burrows Boffin?"
    ]
  },
  {
    "id": "533f5dcd-4f69-484a-9eb5-41e03908022a",
    "questions": [
      "What was Tobold Hornblower most notable for discovering and cultivating?",
      "In which village did Tobold Hornblower reside?",
      "What is the name of the Pipe-weed variety that was named after Tobold Hornblower?",
      "Where is it believed that Tobold Hornblower learned about Pipe-weed?",
      "In what age did Tobold Hornblower likely die?"
    ]
  },
  {
    "id": "5357b435-23f6-400a-adb1-5b0148aa2da9",
    "questions": [
      "What was the birth year of Vardilmë?",
      "Who was Vardilmë's father?",
      "What is the significance of Vardilmë's potential Half-elven heritage?",
      "Which of Vardilmë's siblings became the third King of Númenor?",
      "Is there any information about Vardilmë's marital status or children?"
    ]
  },
  {
    "id": "53a42394-3edb-4dfa-847c-5ce7099b9cc8",
    "questions": [
      "What land did Lorgan claim lordship over after Morgoth's victory in the Nírnaeth Arnoediad?",
      "How long was Tuor held as a servant by Lorgan?",
      "What did Lorgan desire to do with Niënor in the year 494?",
      "In which year was Húrin released from Thangorodrim?",
      "What was Lorgan's reaction when Húrin announced his departure from Hithlum?"
    ]
  },
  {
    "id": "53f5082f-4696-4726-9886-91b966c9d33a",
    "questions": [
      "What race is Aratan?",
      "In which realm did Aratan reside?",
      "What significant battle did Aratan and his brothers participate in?",
      "What was the purpose of sending Aratan and Ciryon to Minas Ithil?",
      "What year was Aratan born?"
    ]
  },
  {
    "id": "543928e5-fe01-48df-9177-b157a5570b1b",
    "questions": [
      "Who were the parents of Dodinas Brandybuck?",
      "What is the relationship between Dodinas Brandybuck and Merry?",
      "What is the name of Dodinas Brandybuck's mother?",
      "How many siblings did Dodinas Brandybuck have?",
      "Which character is the mother of Frodo Baggins related to Dodinas Brandybuck?"
    ]
  },
  {
    "id": "543b63cf-4f46-4929-85d9-8b611fbe789c",
    "questions": [
      "What was the name of Finduilas's father?",
      "In what year did Gwindor return from captivity?",
      "What happened to Finduilas during the attack on Nargothrond?",
      "Who was Finduilas betrothed to?",
      "Where was Finduilas buried after her death?"
    ]
  },
  {
    "id": "54c66cd0-a1b6-4e49-931f-052cd530a24f",
    "questions": [
      "What is the race of Iminyë?",
      "What is the gender of Iminyë?",
      "Who is the spouse of Iminyë?",
      "When was Iminyë born?",
      "What is known about the birth of Iminyë?"
    ]
  },
  {
    "id": "54e37826-3b10-49bd-90d5-03f8bcb09272",
    "questions": [
      "What race is Nob?",
      "Who did Nob work for at the inn?",
      "What did Nob do when Merry disappeared?",
      "During which time period was Nob working at the inn?",
      "Was Nob still employed at the inn when Frodo and his company returned a year later?"
    ]
  },
  {
    "id": "5500acf9-33d3-4527-9506-c95663da21d4",
    "questions": [
      "What race is Dairuin?",
      "In which battle did Dairuin fight under Captain Barahir?",
      "What happened to Dairuin after the Dagor Bragollach?",
      "Who survived along with Dairuin's band of outlaws after their deaths in FA 460?",
      "What was the year of Dairuin's death?"
    ]
  },
  {
    "id": "557949f6-033b-4c9e-8c02-0966fd60e7ec",
    "questions": [
      "Who is Merry Gamgee named after?",
      "What relation does Merry Gamgee have to Frodo?",
      "What role did Merry Brandybuck have in the Fellowship of the Ring?",
      "Who is Merry Gamgee's father?",
      "What is the significance of Merry Gamgee in Sam's life?"
    ]
  },
  {
    "id": "56480b92-06ac-4a0b-b76e-5c9437ba2776",
    "questions": [
      "What is the birth year of Ivorwen?",
      "Who was Ivorwen's spouse?",
      "What race does Ivorwen belong to?",
      "In which year did Ivorwen die?",
      "What is the hair color of Ivorwen as depicted in film?"
    ]
  },
  {
    "id": "566e77c3-e845-4920-9fc6-3629f0248a4a",
    "questions": [
      "What race does Ulfang belong to?",
      "Who was Ulfang's spouse?",
      "In which age was Ulfang born?",
      "What was Ulfang's role during the battle involving the Sons of Fëanor?",
      "What happened to Ulfang's progeny during the battle?"
    ]
  },
  {
    "id": "56ce1211-37b4-421c-a2ea-c2c250ec24d8",
    "questions": [
      "What year was Prisca Baggins born?",
      "Who were Prisca Baggins' parents?",
      "How many children did Prisca Bolger have?",
      "What are the names of Prisca's children?",
      "In what year was Prisca's son Wilimar born?"
    ]
  },
  {
    "id": "572c7f8d-f3e7-4c6f-874f-b2e6b5ddfaac",
    "questions": [
      "What city did Durin create within the Misty Mountains?",
      "Why was Durin referred to as the 'Deathless'?",
      "In which year of the Third Age were Durin's Axe and Durin's Helm rediscovered?",
      "What significant event happened to the Dwarf-colony in TA 2994?",
      "Where did Durin awaken according to the biography?"
    ]
  },
  {
    "id": "572fa996-bb54-4e6a-9f1c-16fde0184447",
    "questions": [
      "What was the name of Hallatan's father?",
      "In which Númenórean province did Hallatan own pastoral land?",
      "Who was Hallatan's sister?",
      "What title did Hallatan hold in his farming settlement?",
      "Who did Hallatan's son, Hallacar, marry?"
    ]
  },
  {
    "id": "5798c720-ad37-45c7-a39d-ba2df2913c6b",
    "questions": [
      "What significant event did Bard participate in during TA 2941 that involved Smaug?",
      "Who was Bard's spouse according to the character data?",
      "In which year did Bard become King of Dale?",
      "What was Bard's relationship with Thorin II during the events surrounding the treasure of Smaug?",
      "What actions did Bard take to help the refugees after the destruction of Lake-town?"
    ]
  },
  {
    "id": "57ac36f6-e9ac-4a1e-9221-333f61d8cbc2",
    "questions": [
      "What race is Borlad?",
      "In which battle did Borlad fight?",
      "What year did Borlad die?",
      "Who was Borlad's spouse?",
      "Which faction did Borlad remain loyal to during the conflict?"
    ]
  },
  {
    "id": "57f83c48-61b8-40ff-b1d0-eaf2a3f869b1",
    "questions": [
      "What notable items did Telchar create during the First Age?",
      "Who was Telchar's teacher in smithing?",
      "Which character eventually wore the Dragon-helm of Dor-lómin?",
      "How is Telchar regarded among other smiths in Middle-earth?",
      "What is the significance of the year 265 in relation to Telchar's work?"
    ]
  },
  {
    "id": "5830f3b3-c2a1-4146-a354-bd95056580f8",
    "questions": [
      "What race is Blanco?",
      "In what year was Blanco born?",
      "Who was Blanco's brother?",
      "What significant land did Blanco help to found by TA 1601?",
      "Which King granted permission to Blanco and his brother to venture westward?"
    ]
  },
  {
    "id": "588f4c2b-f26d-40d8-b2f6-8145c697b63d",
    "questions": [
      "What year was Rosa (Baggins) Took born?",
      "Who was Rosa (Baggins) Took's spouse?",
      "How is Rosa (Baggins) Took related to Merry and Pippin?",
      "Who were Rosa (Baggins) Took's parents?",
      "What is the name of Rosa (Baggins) Took's child?"
    ]
  },
  {
    "id": "58b5be13-1e3a-428a-804a-dc3b63e1ff64",
    "questions": [
      "What year was Meneldil born?",
      "Who was Meneldil's father?",
      "In which realm did Meneldil rule as king?",
      "Who succeeded Meneldil as king of Gondor?",
      "What significant event marked the beginning of Meneldil's reign as king?"
    ]
  },
  {
    "id": "58d89573-0aea-4837-8c3e-f3efbcd12b0a",
    "questions": [
      "What was Eldacar's birth name?",
      "In which year did Eldacar ascend to the throne of Gondor?",
      "Who was the usurper that forced Eldacar into exile?",
      "What significant battle did Eldacar win against Castamir?",
      "Who succeeded Eldacar as king after his death?"
    ]
  },
  {
    "id": "58e587a1-154f-4f49-8b15-d1863533fac2",
    "questions": [
      "What is the full name of the character?",
      "What is the nickname of Chica Baggins?",
      "Is there any information about the race or gender of Chica Baggins?",
      "What is the character's unique identifier?",
      "Are there any details about Chica Baggins' biography or background?"
    ]
  },
  {
    "id": "58f5a799-050a-42e1-b811-6282e9560e0f",
    "questions": [
      "What race does Borlach belong to?",
      "Who was Borlach's father?",
      "In which battle did Borlach lose his life?",
      "What was Borlach's relationship with the Sons of Fëanor?",
      "What was the fate of Borlach's brothers?"
    ]
  },
  {
    "id": "59033154-7f8d-4686-8d1b-f75a280205c0",
    "questions": [
      "What was Gimilkhâd's birth year?",
      "Who was Gimilkhâd's spouse?",
      "What was Gimilkhâd's relationship with his brother Inziladûn?",
      "How did Gimilkhâd's son affect the succession in Númenór?",
      "At what age did Gimilkhâd die?"
    ]
  },
  {
    "id": "596e9415-aafe-4b5f-9132-32fdc4dcd0b8",
    "questions": [
      "What year was Pervinca Took born?",
      "Who are Pervinca Took's parents?",
      "Which sibling is Pervinca Took closest in age to?",
      "What significant event did Pervinca Took attend?",
      "What is the full name of Pervinca Took's father?"
    ]
  },
  {
    "id": "59a80c3a-5676-4786-b53f-ac2f6eb6a257",
    "questions": [
      "What is the race of Mrs. Proudfoot?",
      "Who is Mrs. Proudfoot's spouse?",
      "When was Mrs. Proudfoot's son Olo born?",
      "In which age was Mrs. Proudfoot born?",
      "What is known about Mrs. Proudfoot's life after her marriage?"
    ]
  },
  {
    "id": "5a207f3f-e63c-4021-9805-83c8800594e1",
    "questions": [
      "What significant event did Beregond participate in during the Long Winter of TA 2758 - TA 2759?",
      "Who was Beregond's father and what position did he hold?",
      "In which year did Beregond succeed his father as the Ruling Steward?",
      "What was the outcome of Beregond's actions during the War of the Dwarves and Orcs?",
      "Who succeeded Beregond as the Ruling Steward after his death in TA 2811?"
    ]
  },
  {
    "id": "5a3ae3ef-9327-47ac-a4d8-fb30cd7845ba",
    "questions": [
      "What significant event prompted Nimrodel to leave Lothlórien?",
      "Who was Nimrodel's spouse?",
      "In what year did Amroth drown?",
      "Where did Nimrodel settle after fleeing to the river Gilrain?",
      "What was Nimrodel's ultimate fate after discovering Amroth's death?"
    ]
  },
  {
    "id": "5a5a8789-297e-4246-8a56-dc7b736ba34f",
    "questions": [
      "What year was Náin born?",
      "Who was Náin's spouse?",
      "What significant battle did Náin participate in during the War of the Dwarves and Orcs?",
      "How did Náin die during the Battle of Azanulbizar?",
      "What were Náin and the other Dwarves who fell in battle known as after their cremation?"
    ]
  },
  {
    "id": "5b412ae3-f0a9-466d-8764-032653dc77e7",
    "questions": [
      "What is the birth year of Dudo Baggins?",
      "Who were Dudo Baggins' parents?",
      "What is the name of Dudo Baggins' daughter?",
      "How many years after Bilbo's Farewell Birthday Party did Dudo Baggins die?",
      "What race does Dudo Baggins belong to?"
    ]
  },
  {
    "id": "5b856d39-5ce7-4578-8fa5-79408fe6842b",
    "questions": [
      "What year was Camellia Baggins born?",
      "What was Camellia Baggins' original last name?",
      "Who did Camellia Baggins marry?",
      "What family did Camellia Baggins create through her marriage?",
      "From which location might Camellia Baggins have originated?"
    ]
  },
  {
    "id": "5bbd805f-7840-41d6-86c8-33d09d1dea4b",
    "questions": [
      "What is the race of the character Horn?",
      "When did Horn possibly get born?",
      "On what date did Horn die?",
      "What is the gender of Horn?",
      "What color is Horn's hair as per the video game?"
    ]
  },
  {
    "id": "5bcd2b8b-1be8-411c-82d6-dd494e4b772f",
    "questions": [
      "What race does Enelyë belong to?",
      "Who is Enelyë's spouse?",
      "What is known about Enelyë's birth?",
      "What gender is Enelyë?",
      "In what era did Enelyë awaken?"
    ]
  },
  {
    "id": "5bf9f413-9739-4d3e-ae9e-cf6e956df05d",
    "questions": [
      "What year did Atanatar I succeed his father to the throne of Gondor?",
      "Who was Atanatar I's successor after his death?",
      "What was the nature of Atanatar I's reign in Gondor?",
      "In which year did Atanatar I die?",
      "What is the name of Atanatar I's spouse?"
    ]
  },
  {
    "id": "5d722df3-0ffe-4172-9ff2-1fdca123b274",
    "questions": [
      "What year was Halfast Gamgee born?",
      "Who was Halfast Gamgee's father?",
      "What family did Halfast Gamgee work for as a hunter?",
      "What did Halfast claim to have seen while hunting in the Northfarthing?",
      "Who disputed Halfast's claim about seeing a walking tree-like thing?"
    ]
  },
  {
    "id": "5e2a6738-eed3-4b5b-8989-5c9bd512b2e5",
    "questions": [
      "What year was Turgon born?",
      "Who was Turgon's father?",
      "In what year did Turgon succeed to the Stewardship of Gondor?",
      "How long did Turgon rule before his death?",
      "What significant event occurred two years before Turgon's death?"
    ]
  },
  {
    "id": "5e3d5bff-5060-4bad-9806-213d7537c58f",
    "questions": [
      "What title was Eönwë known by in relation to weapons in Arda?",
      "Who did Eönwë greet when he arrived at the shores of Aman?",
      "What role did Eönwë play in the War of Wrath?",
      "What did Eönwë do with the two remaining Silmarils after Morgoth's defeat?",
      "What did Eönwë teach the remaining Edain before the raising of Númenor?"
    ]
  },
  {
    "id": "5e540d63-a7f4-42f3-b1f0-4c5e3eef86ae",
    "questions": [
      "What year was Estella Brandybuck born?",
      "Who is Estella Brandybuck's spouse?",
      "What is the relationship between Estella and Fredegar Bolger?",
      "In which age did Estella Brandybuck likely die?",
      "Who are Estella Brandybuck's parents?"
    ]
  },
  {
    "id": "5e92c66a-d196-4be7-8686-04b25b9c746f",
    "questions": [
      "What is the full name of Belladonna's spouse?",
      "In what year was Belladonna born?",
      "How many siblings did Belladonna have?",
      "What significant contribution did Belladonna and Bungo Baggins make to the Shire?",
      "Who is the only child of Belladonna Took?"
    ]
  },
  {
    "id": "5f1558af-27e5-4ac0-a693-3eb68b7a570f",
    "questions": [
      "What is the race of Duilin?",
      "In which era was Duilin born?",
      "What is the gender of Duilin?",
      "In what year did Duilin die?",
      "What is the full name of the character described in the payload?"
    ]
  },
  {
    "id": "5f1919cd-c00b-48bb-b2e3-c4b4e38b65c9",
    "questions": [
      "What year did Calimehtar succeed his father as King of Gondor?",
      "Who warned Calimehtar about the Wainriders' planned invasion?",
      "What significant military victory did Calimehtar achieve against the Wainriders?",
      "In what year did Calimehtar die and how long did he rule?",
      "What notable structure did Calimehtar build following his victory over the Wainriders?"
    ]
  },
  {
    "id": "5f31f035-a26b-4c94-a52a-46c605f049fd",
    "questions": [
      "What race is Tulkastor?",
      "Who is Tulkastor's spouse?",
      "What is the name of Tulkastor's child?",
      "Which Vala did Tulkastor follow?",
      "With which group did Tulkastor dwell in the early days of the Elves?"
    ]
  },
  {
    "id": "5f3df312-1d19-47f1-801e-a6a8befd88a0",
    "questions": [
      "What is the race of Hatholdir?",
      "Who was Hatholdir's close personal friend?",
      "What is the name of Hatholdir's son?",
      "Through whom did Orchaldor enter the royal line?",
      "What is the name of Hatholdir's spouse?"
    ]
  },
  {
    "id": "5fd3d1e8-25e9-4406-aa81-40edf0cd4689",
    "questions": [
      "What is the birth year of Morwen?",
      "Who is Morwen's spouse?",
      "What significant event caused Morwen and her folk to move to Dor-lómin?",
      "How did Morwen's beauty affect the Easterlings' perception of her?",
      "Where were Morwen and her children ultimately buried?"
    ]
  },
  {
    "id": "6028ec00-5441-41d8-a001-91a03d6502c6",
    "questions": [
      "What is the full name of the character?",
      "What is the character's last name?",
      "Is there any information about the character's relationships?",
      "What is the character's race or gender?",
      "What notable events are associated with Bilbo Gamgee?"
    ]
  },
  {
    "id": "6037be9d-0161-4cc2-9df7-67fdeb568758",
    "questions": [
      "What race does Imlach belong to?",
      "Who was Imlach's father?",
      "In which age was Imlach born?",
      "What is the name of Imlach's spouse?",
      "Who is Imlach's son?"
    ]
  },
  {
    "id": "60e8483f-125c-4877-bd9b-c77c9fdae486",
    "questions": [
      "What race is Amdír?",
      "In which realm did Amdír rule?",
      "What significant event led to Amdír's death?",
      "Who succeeded Amdír as King of Lórien?",
      "During which age was Amdír born?"
    ]
  },
  {
    "id": "61fee1f8-69a5-4d58-b8fb-0ee1ecb538fd",
    "questions": [
      "What significant construction did Tar-Minastir have built during his rule?",
      "In what year did Sauron invade Eriador during Tar-Minastir's reign?",
      "Who commanded the naval force sent by Tar-Minastir to save Lindon?",
      "What year did Tar-Minastir abdicate the throne?",
      "Who succeeded Tar-Minastir after his death?"
    ]
  },
  {
    "id": "62935639-ec8c-414f-9936-a32ed41c218b",
    "questions": [
      "What significant event did Isildur participate in during the War of the Last Alliance in SA 3441?",
      "Who was Isildur's father and what was his title?",
      "What was the fate of Isildur's son Elendur during the attack by Orcs?",
      "In which realm did Isildur establish his home after arriving in Middle-earth?",
      "What item did Isildur take from Sauron's hand during their confrontation?"
    ]
  },
  {
    "id": "629bf4f7-12e0-4e5c-a956-0c0bb65886a9",
    "questions": [
      "What race does Tarciryan belong to?",
      "What is the gender of Tarciryan?",
      "When was Tarciryan born?",
      "When did Tarciryan die?",
      "Who was Tarciryan's spouse?"
    ]
  },
  {
    "id": "639d9389-e424-421a-af89-236d9977c7db",
    "questions": [
      "What race does Enel belong to?",
      "Who awakened Enel?",
      "What is the name of Enel's spouse?",
      "Which groups did Enel's fold become?",
      "What role is Enel considered to have among the Elves?"
    ]
  },
  {
    "id": "6463bb2d-7eb4-40e8-b869-c50eeb8e0e9a",
    "questions": [
      "What year was Haleth born?",
      "Who was Haleth's father?",
      "In what year did Haleth die?",
      "What event triggered the conflict leading to Haleth's death?",
      "Who succeeded King Helm after his death?"
    ]
  },
  {
    "id": "64651012-53ca-4296-ab5f-3e7875d7999e",
    "questions": [
      "What year did Arveleg I come to the throne?",
      "Who was Arveleg I's father?",
      "In which realm did Arveleg I rule?",
      "What significant event happened in TA 1409 during Arveleg I's reign?",
      "How long did Arveleg I rule before his death?"
    ]
  },
  {
    "id": "64a288ac-7ec7-47da-a6b9-561b0d9cf766",
    "questions": [
      "What year did Arahad I become the Chieftain of the Dúnedain?",
      "Who raised Arahad I in Rivendell?",
      "What significant event occurred in TA 2460 during Arahad I's rule?",
      "What happened to Celebrían, Elrond's wife, in TA 2509?",
      "Who succeeded Arahad I as Chieftain after his death?"
    ]
  },
  {
    "id": "64e932a6-8a2b-4aef-bef8-80a236f0cc14",
    "questions": [
      "What significant event did Fram accomplish in TA 2000?",
      "What was the reaction of the Dwarves to Fram's gift after he claimed Scatha's treasure?",
      "In which geographical area did Fram and his people reside during the mid-Third Age?",
      "What is known about Fram's descendants and his marital status?",
      "What was the fate of the Éothéod capital of Framsburg after Fram's time?"
    ]
  },
  {
    "id": "6500d414-518b-4914-ac8e-b24480d4448c",
    "questions": [
      "What year did Arahael become the second chieftain?",
      "In which year did Arahael die?",
      "Who succeeded Arahael as chieftain?",
      "What significant period did Arahael lead the Dúnedain through?",
      "What is the name of Arahael's spouse?"
    ]
  },
  {
    "id": "6567f3e7-8080-4c84-9761-1ade1238d856",
    "questions": [
      "What significant event did Dorlas participate in during the First Age?",
      "Who did Dorlas mock when he joined Túrin Turambar's call for warriors?",
      "What action did Dorlas take when faced with the perilous crossing of the Taeglin river?",
      "Who killed Dorlas and what was the reason behind this action?",
      "What was Dorlas's relationship to Brandir in the context of the events described?"
    ]
  },
  {
    "id": "661a6c92-ce33-4ad2-9274-a9a4eaa16f27",
    "questions": [
      "What is the birth year of Balbo Baggins?",
      "Who was Balbo Baggins' spouse?",
      "How many children did Balbo Baggins have?",
      "In which region is Balbo Baggins considered the first recorded Baggins?",
      "What is the death year of Balbo Baggins?"
    ]
  },
  {
    "id": "665cef0e-58e1-4cd2-9cd3-4a4bd6244f0a",
    "questions": [
      "What was the name of Nerdanel's spouse?",
      "How many sons did Nerdanel bear with Fëanor?",
      "What was Nerdanel's occupation?",
      "Why did Nerdanel refuse to follow Fëanor to Middle-earth?",
      "Who was the last remnant of Nerdanel's family to die?"
    ]
  },
  {
    "id": "66d4d3f3-55ac-4de0-b911-fdbe97ed1097",
    "questions": [
      "What year was Húrin II born?",
      "Who succeeded Húrin II as Steward?",
      "In which year did Húrin II begin his rule as Steward?",
      "How long did Húrin II rule before his death?",
      "What is the name of Húrin II's spouse?"
    ]
  },
  {
    "id": "670ef4dc-0f06-4c5b-94c2-19209795fd57",
    "questions": [
      "What is the birth year of Basso Boffin?",
      "Who are the parents of Basso Boffin?",
      "How many siblings did Basso Boffin have?",
      "What is the race of Basso Boffin?",
      "What is the gender of Basso Boffin?"
    ]
  },
  {
    "id": "671f277d-a636-4080-b48d-70493a34ba2e",
    "questions": [
      "What was Ioreth's role during the War of the Ring?",
      "In which location was Ioreth born?",
      "What significant information did Ioreth provide to Gandalf?",
      "How many sisters did Ioreth have?",
      "What is noted about Ioreth's character in terms of wisdom and speech?"
    ]
  },
  {
    "id": "67311b49-5471-43cf-ab88-367d8950fefa",
    "questions": [
      "What is the birth year of Celebrindor?",
      "Who was Celebrindor's father?",
      "In which realm did Celebrindor rule?",
      "What year did Celebrindor come to the throne?",
      "Who succeeded Celebrindor after his death?"
    ]
  },
  {
    "id": "675707af-6edc-415c-98f0-79869bba5787",
    "questions": [
      "What is the birth year of Cemendur?",
      "Who are Cemendur's siblings?",
      "What is the name of Cemundur's spouse?",
      "How many children did Cemundur have?",
      "Which notable figure did Cemundur's grandson marry?"
    ]
  },
  {
    "id": "67659b03-fe4c-4ea3-a1f1-3239b539aec9",
    "questions": [
      "What race is Gárulf?",
      "In which conflict did Gárulf serve as a rider?",
      "When did Gárulf die?",
      "What happened to Gárulf's steed Hasufel after his death?",
      "Who was Gárulf's commander during the War of the Ring?"
    ]
  },
  {
    "id": "6860d7a5-1d25-4aad-ad74-c5e064717539",
    "questions": [
      "What is the name of Míriel's spouse?",
      "In which year did Míriel pass away?",
      "What was the name of Míriel's son?",
      "Where did Míriel and Finwë live?",
      "What was Míriel's role after she was granted permission to return to life?"
    ]
  },
  {
    "id": "69d76d0b-1430-42c9-9998-9cb9e1a9c85a",
    "questions": [
      "What is the birth year of Tar-Alcarin?",
      "Who usurped the throne from Tar-Alcarin?",
      "How long did Tar-Alcarin rule Númenor?",
      "What was the relationship between Tar-Alcarin and Tar-Calmacil?",
      "What major threat was growing in Middle-earth during Tar-Alcarin's reign?"
    ]
  },
  {
    "id": "6a374c03-1a7e-4234-88c4-2b728089333f",
    "questions": [
      "What year was Ciryandil born?",
      "Who succeeded Ciryandil after his death?",
      "In which realm did Ciryandil rule?",
      "What significant military action did Ciryandil undertake during his reign?",
      "How long did Ciryandil reign before his death?"
    ]
  },
  {
    "id": "6a95150f-309a-44af-a825-24dbea7f9bcc",
    "questions": [
      "What was Théoden's relationship with his sister Théodwyn and her children?",
      "In which year did Théoden become king after his father's death?",
      "What was the name of Théoden's sword that he reclaimed during the War of the Ring?",
      "How did Théoden die during the Battle of the Pelennor Fields?",
      "What significant action did Théoden take after receiving the Red Arrow from Gondor?"
    ]
  },
  {
    "id": "6b96705b-4cd8-4f54-943a-4ac55a2b3b29",
    "questions": [
      "What is the meaning of Ingwë's name in Quenya?",
      "Who was Ingwë's father and what was his lineage?",
      "What role did Ingwë play during the Great Journey of the Elves?",
      "In which realm did Ingwë rule as king?",
      "Who led the Vanyarin warriors in the War of Wrath?"
    ]
  },
  {
    "id": "6c05cf02-94a4-4b38-acd8-9d10f1f693d9",
    "questions": [
      "What is the birth year of Mungo Baggins?",
      "Who were Mungo Baggins' parents?",
      "How many siblings did Mungo Baggins have?",
      "What is the name of Mungo Baggins' spouse?",
      "How many children did Mungo Baggins and Laura Grubb have?"
    ]
  },
  {
    "id": "6ca44bd4-459d-454d-8844-7d5d6f6636af",
    "questions": [
      "What significant event occurred on Sméagol's birthday in TA 2463 involving Déagol?",
      "How did Déagol come to possess the One Ring?",
      "What was Déagol's relationship to Sméagol?",
      "What is notable about the duration of Déagol's possession of the One Ring compared to other bearers?",
      "What was the outcome of Déagol's encounter with Sméagol regarding the One Ring?"
    ]
  },
  {
    "id": "6cd2b2b6-69bd-4406-9164-673d2b99fb17",
    "questions": [
      "What was the original name of Hyarmendacil II before he took the throne?",
      "In which year did Hyarmendacil II begin his reign?",
      "Who was Hyarmendacil II's father?",
      "What significant military action did Hyarmendacil II take in TA 1551?",
      "How long did Hyarmendacil II rule Gondor before his death?"
    ]
  },
  {
    "id": "6cdcfc1e-9247-4271-ae73-0e58fc0d8837",
    "questions": [
      "What year was Valacar born?",
      "Who was Valacar's spouse?",
      "In which realm did Valacar rule?",
      "What was the name of Valacar's son?",
      "What significant conflict arose after Valacar's death?"
    ]
  },
  {
    "id": "6d730b35-4dc9-44fb-b100-91747208b9ad",
    "questions": [
      "What year did Malvegil ascend to the throne of Arthedain?",
      "Who was Malvegil's father?",
      "What significant enemy realm was established during Malvegil's reign?",
      "How long did Malvegil rule before his death?",
      "Who succeeded Malvegil after his death?"
    ]
  },
  {
    "id": "6dc86ccf-5ad3-4631-ae69-d4a293af5726",
    "questions": [
      "What position did Castamir hold under King Valacar?",
      "In what year did Castamir successfully seize the throne of Gondor?",
      "What significant event did Castamir's troops cause in Osgiliath?",
      "Which king did Castamir defeat at the Battle of the Crossings of Erui?",
      "What became of Castamir's descendants after his defeat?"
    ]
  },
  {
    "id": "6de670fb-480e-43fe-8db5-9c6cb6e5d461",
    "questions": [
      "What was Nár's relationship with Thrór during their journey to reclaim Moria?",
      "How did Nár react upon discovering Thrór's death?",
      "What warning did Azog give to Nár regarding the Dwarves?",
      "What event did Nár's return to Thráin in Dunland trigger?",
      "In which geographical locations did Nár and Thrór travel during their quest?"
    ]
  },
  {
    "id": "6e15dfef-d436-4062-a227-86a7977050f1",
    "questions": [
      "What race is Ulwarth?",
      "In what year did Ulwarth die?",
      "Who did Ulwarth serve under in Beleriand?",
      "What significant event did Ulwarth participate in during the Nírnaeth Arnoediad?",
      "Who killed Ulwarth and his family?"
    ]
  },
  {
    "id": "6e167ace-be79-4dc9-8bfa-4f842864a088",
    "questions": [
      "What is the race of Voronwë?",
      "Who was Voronwë's father?",
      "What significant event did Voronwë lead Tuor to?",
      "Which house did Voronwë identify himself with?",
      "What was Voronwë's role during the Fall of Gondolin?"
    ]
  },
  {
    "id": "6e677de4-16f5-4dd5-b27a-895ebb7ce374",
    "questions": [
      "What was Ulbar's occupation before he became a mariner?",
      "Who was Ulbar's son?",
      "What did Aldarion give to Ulbar's wife as a reward for his service?",
      "In which region did Ulbar originally tend sheep?",
      "During which age did Ulbar live and die?"
    ]
  },
  {
    "id": "6ea86967-1694-41dc-ab2b-3969850fd0f2",
    "questions": [
      "What year was Frór born?",
      "Who was Frór's father?",
      "What event led to Frór's death?",
      "Which brother succeeded Frór in kingship?",
      "What were the two locations to which Durin's Folk migrated after Frór's death?"
    ]
  },
  {
    "id": "6eb020bd-784a-4060-b202-4ecab30621fc",
    "questions": [
      "What is the full name of Filibert Bolger's spouse?",
      "In what year did Filibert Bolger get married?",
      "How is Filibert Bolger related to Frodo Baggins?",
      "At what age did Filibert Bolger die?",
      "What significant event did Filibert Bolger attend as a guest?"
    ]
  },
  {
    "id": "6ed75501-1eff-4fd3-be20-9aeb4a422e84",
    "questions": [
      "What is the name of Legolas's father?",
      "In which battle did Legolas and Gimli engage in an Orc-slaying contest?",
      "What significant event did Legolas attend after the destruction of the One Ring?",
      "What did Legolas do after Aragorn's death?",
      "Which realm did Legolas help restore after the war?"
    ]
  },
  {
    "id": "6f1555cf-39c9-4ee7-968a-ef623ae70ab9",
    "questions": [
      "What is the birth year of Rollo Boffin?",
      "Who is Rollo Boffin's spouse?",
      "Name one of Rollo Boffin's siblings.",
      "Who is the mother of Lobelia Sackville-Baggins?",
      "What is Rollo Boffin's race?"
    ]
  },
  {
    "id": "6f70c935-9f67-445e-b42d-1996ce67bc31",
    "questions": [
      "What year was Arathorn II born?",
      "Who was Arathorn II's spouse?",
      "In what year did Arathorn II become the Chieftain of the Dúnedain?",
      "How did Arathorn II die?",
      "Who succeeded Arathorn II as Chieftain of the Dúnedain?"
    ]
  },
  {
    "id": "6f7ec615-6899-48e2-af60-307e4c2a4a22",
    "questions": [
      "What year was Herucalmo born?",
      "Who was Herucalmo's spouse?",
      "In what year did Herucalmo usurp the throne of Númenor?",
      "What name did Herucalmo rule under after usurping the throne?",
      "Who succeeded to the throne after Herucalmo's death?"
    ]
  },
  {
    "id": "6fa0af9d-d54b-4584-bd82-f263d10cd10e",
    "questions": [
      "What is the birth year of May Gamgee?",
      "Who are May Gamgee's parents?",
      "How many siblings did May Gamgee have?",
      "What is the race of May Gamgee?",
      "Who is May Gamgee's youngest brother?"
    ]
  },
  {
    "id": "6fcfbe4b-b97f-4364-b273-993df9250294",
    "questions": [
      "What year was Aredhel born and what significant event coincided with her birth?",
      "Who was Aredhel's spouse and what was the name of their son?",
      "What led Aredhel to leave Nan Elmoth, and how did her brother Turgon initially react to her request?",
      "What tragic event occurred during Eöl's confrontation with Turgon in Gondolin?",
      "In which forest was Aredhel trapped by Eöl's enchantments?"
    ]
  },
  {
    "id": "700203e8-6883-48a5-818e-61f0bf2eb715",
    "questions": [
      "What is the name of the character?",
      "What is the ID of the character?"
    ]
  },
  {
    "id": "70054e89-5e84-424f-b357-b0eb66b8f4fd",
    "questions": [
      "What is Bombur's relationship to Bofur and Bifur?",
      "In which year was Bombur born?",
      "What was Bombur's role during the Quest of Erebor?",
      "How did Bombur's experience in the Enchanted stream affect him?",
      "What happened to Bombur after the defeat of Smaug?"
    ]
  },
  {
    "id": "70692670-ef16-4aa3-9108-efb6c7138a29",
    "questions": [
      "What is the birth year of Meleth?",
      "Who is Meleth's spouse?",
      "How many children did Meleth have?",
      "What are the names of Meleth's children?",
      "Who were Meleth's parents?"
    ]
  },
  {
    "id": "709a0741-bec3-4c3d-a829-8f1216a34ba8",
    "questions": [
      "What race does Morwë belong to?",
      "What significant event is mentioned in Morwë's biography regarding the awakening of the Elves?",
      "Who were the ambassadors that returned to persuade the other Elves to come to Aman?",
      "What was Morwë's response to the summons to leave Cuiviénen?",
      "Which group did Morwë lead after refusing the summons?"
    ]
  },
  {
    "id": "712722ad-b685-434f-9806-505a0b114813",
    "questions": [
      "What year was Isengrim Took III born?",
      "Who were the parents of Isengrim Took III?",
      "How many siblings did Isengrim Took III have?",
      "What was the cause of Isengrim Took III's lack of descendants?",
      "In what year did Isengrim Took III die?"
    ]
  },
  {
    "id": "71b85c7e-5829-44c7-84c9-b21c795b47df",
    "questions": [
      "What were the names of Ponto Baggins I's parents?",
      "Who were Ponto Baggins I's siblings?",
      "In what time period was Ponto Baggins I likely born?",
      "What is the name of Ponto Baggins I's spouse?",
      "How many children did Ponto Baggins I have?"
    ]
  },
  {
    "id": "71cb6319-27f5-45c5-8731-f12402fe59be",
    "questions": [
      "What race is Tilion?",
      "Who was Tilion originally a Maia of?",
      "What significant event did Tilion participate in regarding the Two Trees of Valinor?",
      "How did Tilion's behavior affect the appearance of the Moon in the sky?",
      "What may Tilion have inspired in the folklore of Gondor and The Shire?"
    ]
  },
  {
    "id": "71e89543-3e86-4e9c-b229-0cceb1050243",
    "questions": [
      "What event led to Náin I's death?",
      "Who succeeded Náin I on the throne of Durin's Folk?",
      "In which realm did Náin I rule?",
      "What was the fate of Khazad-dûm after Náin I's death?",
      "What significant title did Náin I hold during his lifetime?"
    ]
  },
  {
    "id": "726240d4-c670-492c-be15-8bcc3c241526",
    "questions": [
      "What race is Bladorthin?",
      "In which realms did Bladorthin rule?",
      "What type of relationship did Bladorthin's kingdom have with the Dwarven Kingdom?",
      "What was the specific order that Bladorthin placed with the Dwarves of Erebor?",
      "During which significant event was Bladorthin's order mentioned by Thorin and Balin?"
    ]
  },
  {
    "id": "728e4abf-f857-4228-871a-ee02ac198df9",
    "questions": [
      "What is the birth year of Caliondo?",
      "Who were Caliondo's parents?",
      "What is the name of Caliondo's child?",
      "What is the death year of Caliondo?",
      "What is the race of Caliondo?"
    ]
  },
  {
    "id": "745f6512-73ed-48a5-a0e5-65393ace7eb4",
    "questions": [
      "What realm did Olwë become Lord of after leading the Teleri to Valinor?",
      "Who was Olwë's daughter and whom did she marry?",
      "What was the reason for the conflict between Olwë and Fëanor at Alqualondë?",
      "In which location were Olwë and his brothers born?",
      "What was the outcome of the battle between the Teleri and Fëanor's forces?"
    ]
  },
  {
    "id": "747cc732-9d53-46c7-85d4-0e40c1cdfcf1",
    "questions": [
      "What year was Boromir born?",
      "Who was Boromir's father?",
      "What land was granted to Boromir as a fief?",
      "How many children did Boromir have and what are their names?",
      "Who were the Elven-lords under whom Boromir's land was granted?"
    ]
  },
  {
    "id": "7490b8c6-6419-4816-8279-1bc5a43a37d3",
    "questions": [
      "What is the full name of the character?",
      "What is the character's last name?",
      "Is there any information about Ruby Gamgee's relationships?",
      "What is Ruby Gamgee's race or gender?",
      "What realm does Ruby Gamgee belong to?"
    ]
  },
  {
    "id": "7530061c-b9f6-431c-b3e2-e54ec640b2c1",
    "questions": [
      "What significant physical characteristic did Maedhros inherit from his mother?",
      "What event led to Maedhros being captured by Morgoth's forces?",
      "How did Maedhros become the ruler of the lands around the Hill of Himring?",
      "What was the outcome of the Union of Maedhros during the Nírnaeth Arnoediad?",
      "What tragic decision did Maedhros make at the end of his life regarding the Silmaril he possessed?"
    ]
  },
  {
    "id": "753823df-556f-47cf-827c-6967164c512a",
    "questions": [
      "What year did Gorhendad Brandybuck lead the colonization of Buckland?",
      "What significant structure did Gorhendad Brandybuck build and excavate?",
      "Who succeeded Gorhendad Brandybuck as Master of Buckland?",
      "What was Gorhendad Brandybuck's original last name before he changed it?",
      "In what year was Gorhendad Brandybuck born?"
    ]
  },
  {
    "id": "7541a891-7185-48bd-8c75-f8bf5915b40b",
    "questions": [
      "What race does Ulfast belong to?",
      "Who was Ulfast's father?",
      "In what significant event did Ulfast participate?",
      "What was the consequence of Ulfast's actions during the Nírnaeth Arnoediad?",
      "What year did Ulfast die?"
    ]
  },
  {
    "id": "758114ba-89a7-4c50-bb39-68036e463a3e",
    "questions": [
      "What significant role did Finwë play in the Great Journey of the Elves to Valinor?",
      "Who were Finwë's wives and how many children did he have with each?",
      "What event led to Finwë's death in Formenos?",
      "How did Finwë's relationship with his son Fëanor affect his status as king?",
      "What was the consequence of Melkor's attack on Formenos for the Ñoldor?"
    ]
  },
  {
    "id": "75f02285-848b-4321-a851-25dbc8cc27e0",
    "questions": [
      "What year did Mallor become king of Arthedain?",
      "Who was Mallor succeeded by after his death?",
      "How long did Mallor rule as king?",
      "What significant event related to the Order of Wizards occurred during Mallor’s reign?",
      "What was revealed about the shadow over Mirkwood near the end of Mallor's reign?"
    ]
  },
  {
    "id": "7660bf44-4be6-4bdc-b292-9a875563cb48",
    "questions": [
      "What significant creation did Fëanor make that garnered him great praise and was ultimately the cause of much strife among the Elves?",
      "Who were Fëanor's half-siblings and what was his relationship with them?",
      "What was the consequence of Fëanor's actions during the Kinslaying of the Teleri?",
      "What was Fëanor's fate after his final battle against Morgoth, and how did it affect his legacy?",
      "What oath did Fëanor and his sons swear, and what were its implications for the Ñoldor?"
    ]
  },
  {
    "id": "7671e779-1521-4563-add2-95696828cc07",
    "questions": [
      "What is the race of Ivy (Goodenough) Boffin?",
      "Who is Ivy (Goodenough) Boffin's spouse?",
      "In which age was Ivy (Goodenough) Boffin born?",
      "How many children did Ivy (Goodenough) Boffin have?",
      "What is the full name of Ivy (Goodenough) Boffin's family before marriage?"
    ]
  },
  {
    "id": "769ec2e1-b8f7-4ed8-af2d-19106d0daeed",
    "questions": [
      "What year was Vorondil born?",
      "Who was Vorondil's father?",
      "In what year did Vorondil become the Steward to King Eärnil II?",
      "What title was Vorondil known by due to his hunting skills?",
      "Who succeeded Vorondil as Steward after his death?"
    ]
  },
  {
    "id": "76b9be70-c8da-4f5e-850c-0995dae67e59",
    "questions": [
      "What was the birth year of Tar-Ancalimë?",
      "Who was Tar-Ancalimë's spouse?",
      "In what realm did Tar-Ancalimë reside?",
      "What was the primary reason for Tar-Ancalimë's marriage to Hallacar?",
      "Who succeeded Tar-Ancalimë after her death?"
    ]
  },
  {
    "id": "76cdb577-19c8-463e-94f7-78b79119cacf",
    "questions": [
      "What is the birth year of Farmer Maggot?",
      "What type of crops did Farmer Maggot grow on his land?",
      "How many children did Farmer Maggot have?",
      "Who were the three dogs gifted to Farmer Maggot by his brother?",
      "What did Farmer Maggot do when he encountered Frodo Baggins and his friends on his farm?"
    ]
  },
  {
    "id": "7747d517-76f6-4921-8431-4baf6ed8407e",
    "questions": [
      "Who is Indis's spouse?",
      "What are the names of Indis's children?",
      "Which realm does Indis belong to?",
      "What was the relationship between Indis and Fëanor?",
      "Where did Indis and her daughter Findis go after the death of Finwë?"
    ]
  },
  {
    "id": "77bf5206-17c5-4cba-841d-ca24e8b13e8f",
    "questions": [
      "What race is Tosto Boffin?",
      "In what year was Tosto Boffin born?",
      "What is the gender of Tosto Boffin?",
      "In which age did Tosto Boffin die?",
      "What is the full name of the character with the id '77bf5206-17c5-4cba-841d-ca24e8b13e8f'?"
    ]
  },
  {
    "id": "783ca46d-160b-4e43-8eb2-00607eae318d",
    "questions": [
      "What year was Amrothos born?",
      "Who are the siblings of Amrothos?",
      "What is known about Amrothos's involvement in the War of the Ring?",
      "Which character did Amrothos's sister Lothíriel marry?",
      "What title did Lothíriel hold after her marriage?"
    ]
  },
  {
    "id": "787ba40c-9d6b-4796-a115-180af5bcbd92",
    "questions": [
      "What is the name of Írildë's father?",
      "How many siblings did Írildë have?",
      "In what year was Írildë born?",
      "What is the race of Írildë?",
      "What is known about Írildë's life?"
    ]
  },
  {
    "id": "79799e04-5259-4ebc-94c7-e3c42967a74a",
    "questions": [
      "What significant events occurred during Tar-Telperiën's reign?",
      "Who succeeded Tar-Telperiën after her death?",
      "What was Tar-Telperiën's stance on marriage and children?",
      "In what year did Tar-Telperiën die?",
      "How long did Tar-Telperiën rule Númenor?"
    ]
  },
  {
    "id": "79cae1ba-dd54-4f34-82f4-aec9b0efaeeb",
    "questions": [
      "What is the full name of Frodo Gardner's mother?",
      "In what year was Frodo Gardner born?",
      "Who is Frodo Gardner's older sister?",
      "What family name did Frodo Gardner inherit from his father?",
      "Who are the descendants of Frodo Gardner mentioned in the biography?"
    ]
  },
  {
    "id": "79f0d09b-0228-4ee6-9e5a-f382fa8d313b",
    "questions": [
      "What year was Denethor II born?",
      "Who was Denethor II's spouse?",
      "How many sons did Denethor II have and what were their names?",
      "In what year did Denethor II succeed his father as Ruling Steward?",
      "What event led to Denethor II's despair and eventual suicide?"
    ]
  },
  {
    "id": "7a0a841d-9ff5-44c2-806b-31f774a0f781",
    "questions": [
      "What is the birth year of Oromendil?",
      "Who were Oromendil's siblings?",
      "What is the gender of Oromendil?",
      "How many children did Nolondil have?",
      "What is the race of Oromendil?"
    ]
  },
  {
    "id": "7a2f2301-121f-4aa9-8526-db94ccf3e022",
    "questions": [
      "What year was Amaranth Brandybuck born?",
      "Who were Amaranth Brandybuck's parents?",
      "How many siblings did Amaranth Brandybuck have?",
      "Which of Amaranth's siblings was the mother of Frodo Baggins?",
      "In what year did Amaranth Brandybuck pass away?"
    ]
  },
  {
    "id": "7a672644-4b0b-4922-b5f1-ab0796cee6dc",
    "questions": [
      "What race is Estelmo?",
      "In which age did Estelmo die?",
      "What significant event did Estelmo survive during the Disaster of the Gladden Fields?",
      "Who was Estelmo found beneath after the battle?",
      "What task may Estelmo have undertaken related to the shards of Narsil?"
    ]
  },
  {
    "id": "7a844497-6dac-4de2-889f-56cb9a036c74",
    "questions": [
      "What year was Adamanta (Chubb) Took born?",
      "Who was Adamanta (Chubb) Took's spouse?",
      "Can you name one of Adamanta (Chubb) Took's children?",
      "In what year did Adamanta (Chubb) Took pass away?",
      "What race does Adamanta (Chubb) Took belong to?"
    ]
  },
  {
    "id": "7b515481-6ad7-40cf-a044-fe3d2e350887",
    "questions": [
      "What race does Derufin belong to?",
      "When was Derufin born?",
      "What significant event did Derufin participate in during the War of the Ring?",
      "Who accompanied Derufin to Minas Tirith?",
      "How did Derufin meet his end during the Battle of the Pelennor Fields?"
    ]
  },
  {
    "id": "7be06299-9e58-4bca-85e5-4e3dd2bbbd6b",
    "questions": [
      "What year was Seredic Brandybuck born?",
      "Who is Seredic Brandybuck's spouse?",
      "How many children did Seredic Brandybuck have?",
      "What are the names of Seredic Brandybuck's children?",
      "Which significant event did Seredic Brandybuck attend?"
    ]
  },
  {
    "id": "7c2b367d-7801-444f-84ba-6bd06b75cfd9",
    "questions": [
      "What significant change did Ostoher make regarding his summer residence in TA 420?",
      "Who succeeded Ostoher as the ruler of Gondor after his death?",
      "In what year did Ostoher die, and how old was he at that time?",
      "What was the name of Ostoher's son who dealt with the Easterling threat?",
      "What major event occurred in Gondor after the Great Plague of 1636 related to Ostoher's contributions?"
    ]
  },
  {
    "id": "7c4e43e2-a01d-4607-8560-2ebcf9a5abc8",
    "questions": [
      "What year was Adalgrim Took born?",
      "Who was Adalgrim Took's spouse?",
      "How many children did Adalgrim Took have?",
      "Which of Adalgrim's daughters was the mother of Meriadoc Brandybuck?",
      "In what year did Adalgrim Took die?"
    ]
  },
  {
    "id": "7dc0feb8-3ab2-4608-9613-0213333ce460",
    "questions": [
      "What year was Náin II born?",
      "Who succeeded Náin II as king?",
      "What challenges did Náin II face during his reign?",
      "How old was Náin II at the time of his death?",
      "What is the name of Náin II's father?"
    ]
  },
  {
    "id": "7dfd9458-4472-4daa-801c-6f93523cdd0c",
    "questions": [
      "What year did Siriondil become King of Gondor?",
      "Who succeeded Siriondil as King of Gondor?",
      "How long did Siriondil rule Gondor?",
      "In which year did Siriondil die?",
      "What were the names of Siriondil's sons?"
    ]
  },
  {
    "id": "7ed4898d-2fe2-4359-8335-2dd81882294a",
    "questions": [
      "What year was Meriadoc Brandybuck born?",
      "Who was Meriadoc Brandybuck's spouse?",
      "What significant role did Merry play during the Battle of the Pelennor Fields?",
      "How did Merry acquire his sword during the War of the Ring?",
      "In what year did Merry become the Master of Buckland?"
    ]
  },
  {
    "id": "7f28da24-8e38-4d3c-9280-865a5ef993a1",
    "questions": [
      "What was the original name of Bëor before he was commonly called by that name?",
      "In which year did Bëor and his folk first encounter the Ñoldor of Beleriand?",
      "Who did Bëor commit the rule of his people to before departing for Nargothrond?",
      "How long did Bëor serve under King Finrod Felagund?",
      "Which notable figures is Bëor considered the forefather of?"
    ]
  },
  {
    "id": "7f46faef-ff81-47f7-8f41-8802d0f70a1f",
    "questions": [
      "What year was Merimas Brandybuck born?",
      "Who were Merimas Brandybuck's siblings?",
      "What significant event was Merimas Brandybuck present at?",
      "What is the race of Merimas Brandybuck?",
      "In which age did Merimas Brandybuck die?"
    ]
  },
  {
    "id": "7f5b3cda-a7ff-4ccb-b055-fd5f78c0f2a6",
    "questions": [
      "What role did Targon have in the Guard of the Citadel of Minas Tirith?",
      "In which age was Targon born?",
      "Who did Targon provide supplies to from the winter's store?",
      "What items did Targon give to Beregond and Peregrin Took?",
      "What was Targon's occupation related to the storehouse and buttery?"
    ]
  },
  {
    "id": "7f9a1ec5-1d54-487d-9241-1c78910ebcb1",
    "questions": [
      "What is the name of Elrond's spouse?",
      "In which realm did Elrond establish Rivendell?",
      "What significant choice did Elrond and his brother Elros make at the end of the First Age?",
      "During which war did Elrond serve as Gil-galad's herald?",
      "What year did Elrond depart Middle-earth for Aman?"
    ]
  },
  {
    "id": "7f9a91f1-3bfa-4166-a56e-285f5eecdf8a",
    "questions": [
      "What was Elemmakil's role in Gondolin?",
      "Who did Elemmakil first encounter when they arrived at the Outer Gate?",
      "What significant event is associated with the year FA 510 in relation to Elemmakil?",
      "Which character did Elemmakil lead to Ecthelion?",
      "Did Elemmakil know Voronwë before the events described in his biography?"
    ]
  },
  {
    "id": "7fd4f6d6-9c9a-4ee9-b08c-422f1d945b20",
    "questions": [
      "What year was Minto Burrows born?",
      "Who are Minto Burrows' parents?",
      "How many siblings does Minto Burrows have?",
      "What notable event did Minto Burrows' family attend that he did not?",
      "To which notable ancestor can Minto Burrows trace his lineage?"
    ]
  },
  {
    "id": "801930d0-8b2f-4517-8ba7-c32ebd31b72f",
    "questions": [
      "What was the birth year of Elfwine?",
      "Who were the parents of Elfwine?",
      "In which realm did Elfwine rule as king?",
      "What significant oath did Elfwine maintain during his reign?",
      "What year did Elfwine become king of Rohan?"
    ]
  },
  {
    "id": "8068072a-4957-40c4-a8fe-30e944e47301",
    "questions": [
      "What year was Rudibert Bolger born?",
      "Who were Rudibert Bolger's parents?",
      "What is the name of Rudibert Bolger's spouse?",
      "How many children did Rudibert Bolger have?",
      "What is the name of Rudibert Bolger's daughter?"
    ]
  },
  {
    "id": "807d6c1a-d163-4103-ac18-80f515cdad81",
    "questions": [
      "What year was Fréaláf Hildeson born?",
      "Who was Fréaláf's mother?",
      "What significant event did Fréaláf lead after the Long Winter?",
      "How long did Fréaláf rule Rohan?",
      "Who succeeded Fréaláf as king after his death?"
    ]
  },
  {
    "id": "80a6cdb5-d9a7-4fdf-8192-6ee1f4d09f3f",
    "questions": [
      "What was Forweg's role within the Gaurwaith?",
      "In which year of the First Age did Forweg's scouts catch Neithan?",
      "How did Forweg die?",
      "What was Forweg's initial intention regarding Neithan when he was surrounded?",
      "What relationship did Forweg have with Andróg?"
    ]
  },
  {
    "id": "82072e55-82bb-4a44-a19c-286f3db7afc1",
    "questions": [
      "What year was Túrin II born?",
      "Who was Túrin II's father and when did he die?",
      "What significant battle did Túrin II fight in TA 2885 and who were his allies?",
      "What actions did Túrin II take in response to the attack on Ithilien in TA 2901?",
      "How long did Túrin II rule as Ruling Steward before his death?"
    ]
  },
  {
    "id": "824d3860-352d-4157-9dcb-cb34044a0ec7",
    "questions": [
      "What was Mîm's relationship with his sons Ibun and Khîm?",
      "In what year did Mîm attempt to murder Finrod?",
      "What prompted Mîm to lead the outlaws to his dwelling?",
      "What curse did Mîm lay upon the treasure of Nargothrond before his death?",
      "How did Mîm's hatred for the Elves manifest in his interactions with Beleg?"
    ]
  },
  {
    "id": "82539813-6429-4aaf-880c-2ac42bebc503",
    "questions": [
      "What is the race of Tindómiel?",
      "What gender is Tindómiel?",
      "In which age was Tindómiel born?",
      "When did Tindómiel die?",
      "What is the full name of the character described in the payload?"
    ]
  },
  {
    "id": "827a0185-bac0-4c59-9cf7-d37ec13d7967",
    "questions": [
      "What was the birth year of Isilmo?",
      "Who was Isilmo's father?",
      "Who succeeded Tar-Telperiën after her reign?",
      "What is the relationship between Isilmo and Tar-Telperiën?",
      "Did Isilmo have any children?"
    ]
  },
  {
    "id": "829d9f11-82cc-4620-b24d-d7c78750ce41",
    "questions": [
      "Who was Nolondil's eldest brother and what was his title?",
      "What is the name of Nolondil's daughter?",
      "How many children did Nolondil have?",
      "What is known about Nolondil's father's heritage?",
      "In which era did Nolondil die?"
    ]
  },
  {
    "id": "82b52c51-28a8-4aaa-804d-9ae73f2ab1a0",
    "questions": [
      "What year did Óin succeed his father as king?",
      "Who succeeded Óin as king of Durin's Folk?",
      "In which realm did Óin rule?",
      "What significant event occurred during the final years of Óin's reign?",
      "What was the duration of Óin's reign as king?"
    ]
  },
  {
    "id": "83180c09-3d32-40f7-98a6-5636d18e61e8",
    "questions": [
      "What is the name of Emeldir's husband?",
      "In which year was Emeldir born?",
      "Who are Emeldir's children?",
      "What title did Emeldir earn for her actions during the Dagor Bragollach?",
      "Who is Emeldir's only grandchild?"
    ]
  },
  {
    "id": "83c043e8-8c0c-4fe7-a686-0908a85fd894",
    "questions": [
      "What was the birth year of Drogo Baggins?",
      "Who was Drogo Baggins' spouse?",
      "How many children did Drogo Baggins have?",
      "What were the circumstances surrounding the deaths of Drogo and Primula Baggins?",
      "Who described Drogo Baggins as a 'decent, respectable hobbit'?"
    ]
  },
  {
    "id": "841681ba-4140-4fd1-a70a-297ec2aeccd6",
    "questions": [
      "What significant event occurred during Tarondor's reign involving the capital of Gondor?",
      "Who was Tarondor's predecessor and how did he come to the throne?",
      "In what year was Tarondor born and when did he die?",
      "What policy did Tarondor pursue to address the aftermath of the Great Plague?",
      "Who succeeded Tarondor as King of Gondor after his death?"
    ]
  },
  {
    "id": "84d81bb6-a5f4-4cac-87d9-eea19c5f8df9",
    "questions": [
      "What was the name of Maeglin's father?",
      "How did Maeglin's mother, Aredhel, die?",
      "What significant creation did Maeglin contribute to Gondolin's defenses?",
      "Why was Maeglin's desire to marry Idril considered inappropriate?",
      "What ultimately led to Maeglin's death during the fall of Gondolin?"
    ]
  },
  {
    "id": "84e99013-14d0-4bf4-bdc2-2c0eb287aebb",
    "questions": [
      "What year was Arassuil born?",
      "Who was Arassuil's father?",
      "What significant event occurred during Arassuil's rule in TA 2759?",
      "Who succeeded Arassuil as Chieftain of the Dúnedain?",
      "What was the outcome of the Orc raids during Arassuil's leadership?"
    ]
  },
  {
    "id": "853d8d3e-9859-4610-b962-eef56f1ddf87",
    "questions": [
      "What was the birth year of Tar-Amandil?",
      "Who was Tar-Amandil's father?",
      "How many children did Tar-Amandil have?",
      "In what year did Tar-Amandil surrender the Sceptre of Númenor?",
      "What is the relationship between Tar-Amandil and Tar-Elendil?"
    ]
  },
  {
    "id": "854f3c99-ee28-45a3-8cfd-ccd62d459057",
    "questions": [
      "What race does Gelmir belong to?",
      "Who did Gelmir flee with to the safe havens of Círdan?",
      "What was the name of the battle during which Dorthonion was overrun?",
      "Which lord did Gelmir and Arminas warn about the impending threat to Nargothrond?",
      "What is known about Gelmir's fate?"
    ]
  },
  {
    "id": "856be1a0-02da-4ac2-b13e-10dc8e4ee9d0",
    "questions": [
      "What year was Gruffo Boffin born?",
      "Who were Gruffo Boffin's parents?",
      "What is the name of Gruffo Boffin's child?",
      "In what year did Gruffo Boffin die?",
      "What is the relationship between Gruffo Boffin and Griffo Boffin?"
    ]
  },
  {
    "id": "8640c8a5-5dbc-42dd-a8e6-7ae9506fb33e",
    "questions": [
      "What race is Grimbeorn described as in the character data?",
      "What role did Grimbeorn have in the Vales of Anduin during the War of the Ring?",
      "What significant event likely marks the period of Grimbeorn's birth?",
      "What did Glóin comment about Grimbeorn's attitude towards Dwarves?",
      "What geographical locations did Grimbeorn keep free from Orcs and Wolves?"
    ]
  },
  {
    "id": "86ac8bc1-eb26-4535-a1a0-88530f9f87a6",
    "questions": [
      "What is the name of Gildis's spouse?",
      "In which age was Gildis born?",
      "Who are the children of Gildis mentioned in the biography?",
      "What was the title of Gildis's husband?",
      "What house is associated with Gildis's family?"
    ]
  },
  {
    "id": "86ae8771-b7e2-432a-bf51-bc2787db80bb",
    "questions": [
      "What is the full name of the character?",
      "What is the character's unique identifier?",
      "Is there any information about the character's family or relationships?",
      "What race is Inigo Baggins?",
      "What gender is Inigo Baggins?"
    ]
  },
  {
    "id": "873a0da1-dfb0-4f4d-868f-302034da6925",
    "questions": [
      "What was the birth year of Aranuir?",
      "Who were the parents of Aranuir?",
      "In which year did Aranuir die?",
      "How is Aranuir related to Aragorn II Elessar?",
      "What historical period coincided with Aranuir's life or reign?"
    ]
  },
  {
    "id": "87c92728-13c9-45c9-9530-e066267189d5",
    "questions": [
      "What is the birth year of Gorbulas Brandybuck?",
      "Who was Gorbulas Brandybuck's father?",
      "How many children did Gorbulas Brandybuck have?",
      "What is the relationship between Gorbulas Brandybuck and Marmadoc Brandybuck?",
      "In what year did Gorbulas Brandybuck die relative to Bilbo's Farewell Birthday Party?"
    ]
  },
  {
    "id": "87d31b8b-0c58-45ec-a679-dbaed6d1747b",
    "questions": [
      "What is the birth year of Tar-Míriel?",
      "Who was Tar-Míriel's spouse?",
      "In which realm did Tar-Míriel rule?",
      "What title did Tar-Míriel hold during Ar-Pharazôn's absence?",
      "What event led to the destruction of Númenor and the death of Tar-Míriel?"
    ]
  },
  {
    "id": "87d74188-09e1-4768-be0b-9d4a5bb985af",
    "questions": [
      "What is the birth year of Girion?",
      "Who was Girion's spouse?",
      "In which year was Girion killed?",
      "What significant event occurred in TA 2770 involving Girion?",
      "What valuable item did Girion own that was later found among Smaug's treasures?"
    ]
  },
  {
    "id": "885231d8-c7a5-435a-8d95-cd1ba3e2fbd6",
    "questions": [
      "What is the birth year of Porto Baggins?",
      "Who are the parents of Porto Baggins?",
      "How many siblings does Porto Baggins have and what are their names?",
      "Which significant event did Porto Baggins attend in 3001?",
      "What is the race of Porto Baggins?"
    ]
  },
  {
    "id": "899fb220-1f2e-4b1b-90c9-fc5972038309",
    "questions": [
      "What year was Polo Baggins born?",
      "Who are Polo Baggins' parents?",
      "What is the name of Polo Baggins' sister?",
      "How many children did Polo Baggins have?",
      "What are the names of Polo Baggins' children?"
    ]
  },
  {
    "id": "89e14302-e9bc-49bb-87ab-f3f4084b0c94",
    "questions": [
      "What significant role did Pengolodh hold in Gondolin?",
      "In which kingdom did Pengolodh live during the Second Age?",
      "What are some of the notable works attributed to Pengolodh?",
      "Who were the companions that Pengolodh escaped with during the sack of Gondolin?",
      "Where did Pengolodh reside after leaving Middle-earth?"
    ]
  },
  {
    "id": "8a375eed-5265-4ec8-8b13-5d067a6ddec3",
    "questions": [
      "What is the name of Celebrían's spouse?",
      "In which year did Celebrían give birth to her daughter Arwen?",
      "What significant event happened to Celebrían in TA 2509?",
      "Where did Celebrían and her mother Galadriel live before moving to Rivendell?",
      "What impact did Celebrían's experience with Orcs have on her decision to leave Middle-earth?"
    ]
  },
  {
    "id": "8a7f1efc-279f-440f-abc7-1be8b71546a4",
    "questions": [
      "What is the full name of Lily Cotton before she married?",
      "Who is Lily Cotton's spouse?",
      "In which location did Lily Cotton reside after her marriage?",
      "How many children did Lily Cotton have?",
      "During which age was Lily Cotton born?"
    ]
  },
  {
    "id": "8aa54668-2db0-49c8-9f19-03b5c60949e1",
    "questions": [
      "What was Andróg's race and gender?",
      "In what year was Andróg born and when did he die?",
      "Who was Andróg's spouse?",
      "What significant event led Andróg to join the band of outlaws Gaurwaith?",
      "What was the curse placed on Andróg by Mîm?"
    ]
  },
  {
    "id": "8ae67063-4a80-434c-8de8-f90f08736cfe",
    "questions": [
      "What was Ingold's role during the War of the Ring?",
      "What did Ingold do when Gandalf and Pippin approached the gate?",
      "How did Ingold react to the news of the army from Mordor crossing the river Anduin?",
      "What was the significance of the northern road falling into enemy hands according to Ingold's report?",
      "In which age did Ingold live and when did he die?"
    ]
  },
  {
    "id": "8c037f32-1200-4f73-8068-3fe8c9d27e58",
    "questions": [
      "What is the birth year of Aglahad?",
      "In which year did Aglahad die?",
      "What is the race of Aglahad?",
      "What is the gender of Aglahad?",
      "Who is Aglahad's spouse?"
    ]
  },
  {
    "id": "8c103c35-8cf4-4cc0-8a40-08026c107572",
    "questions": [
      "What was the Quenya name of Ar-Adûnakhôr and what does it mean?",
      "How long did Ar-Adûnakhôr rule Númenor?",
      "Who succeeded Ar-Adûnakhôr as king?",
      "What actions did Ar-Adûnakhôr take against the Faithful during his reign?",
      "In what year was Ar-Adûnakhôr born and when did he die?"
    ]
  },
  {
    "id": "8c29d48b-9161-414c-8d4b-1d5fbd00fcba",
    "questions": [
      "What position did Elboron succeed after his father's death?",
      "In what year did Elboron become the Steward of Gondor?",
      "Who was Elboron's father?",
      "What is the possible relationship between Elboron and Barahir?",
      "What realm is Elboron associated with?"
    ]
  },
  {
    "id": "8c546647-8db5-433b-ad3a-fbd17739db6d",
    "questions": [
      "What year was Hador born?",
      "Who was Hador's father?",
      "How long did Hador serve as the Steward of Gondor?",
      "What significant change did Hador make to the calendar system during his rule?",
      "Who succeeded Hador as the Steward of Gondor after his death?"
    ]
  },
  {
    "id": "8cb54b23-9381-493b-90eb-967c1dfbbaa3",
    "questions": [
      "What was the name of Araval's father?",
      "In which realm did Araval rule?",
      "What significant victory did Araval achieve during his lifetime?",
      "What was the outcome of Araval's attempt to recolonize Cardolan?",
      "Who succeeded Araval as ruler of Arthedain?"
    ]
  },
  {
    "id": "8d10b49a-515c-4fa8-8bed-3723808c2ef3",
    "questions": [
      "What race does Gildor Inglorion belong to?",
      "On what date did Gildor and the Hobbits first meet?",
      "What advice did Gildor give to Frodo regarding the Nazgûl?",
      "Who did Gildor promise to send word to in order to help Frodo?",
      "What significant event occurred on September 22, 3021, involving Gildor?"
    ]
  },
  {
    "id": "8d129646-e1ad-48f1-8368-f37d294c8804",
    "questions": [
      "What oath was Maglor bound by and what was its purpose?",
      "What significant event did Maglor participate in at Alqualondë?",
      "Who were Maglor's parents and what happened to them during their time in Beleriand?",
      "What was the outcome of the attack on the Havens of Sirion led by Maglor and his brother?",
      "What ultimately happened to the Silmarils that Maglor and Maedhros attempted to recover after the War of Wrath?"
    ]
  },
  {
    "id": "8d1f4125-6cfb-4021-a2c6-8a6408c8025b",
    "questions": [
      "What year was Moro Burrows born?",
      "Who were the parents of Moro Burrows?",
      "Name one of Moro Burrows' siblings.",
      "How is Moro Burrows related to Frodo Baggins?",
      "What family is Moro Burrows a part of?"
    ]
  },
  {
    "id": "8df24064-f411-46f9-a0cc-68c7a67b66cd",
    "questions": [
      "What was the name of Valandil's father?",
      "Who was Valandil's mother?",
      "Why were Valandil and the Lords of Andúnië not in line for royal succession?",
      "What significant role did Valandil's descendants play by the end of the Second Age?",
      "Who was the youngest son of Isildur that shared the name Valandil?"
    ]
  },
  {
    "id": "8e26ab63-6f00-4860-9e30-96918b06c8e0",
    "questions": [
      "What was Gandalf's original name before he became known as Gandalf?",
      "Who gave Gandalf the Ring Narya and what was its significance?",
      "In which battle did Gandalf die and what was the date of his death?",
      "What was Gandalf's role in the formation of the Fellowship of the Ring?",
      "How did Gandalf's appearance change after his resurrection?"
    ]
  },
  {
    "id": "8e5fdd5e-6092-4b65-9f82-418789822f16",
    "questions": [
      "What is the name of Adanel's spouse?",
      "How many children did Adanel have?",
      "Who was Adanel's last child and what is significant about him?",
      "What tale did Adanel tell to Andreth?",
      "How is Andreth related to Adanel's husband, Belemir?"
    ]
  },
  {
    "id": "8ef24ec9-f271-493f-9b30-2b6590f1519e",
    "questions": [
      "What is the race of Belen?",
      "In what year was Belen born?",
      "Who is Belen's spouse?",
      "Who is Belen's most famous descendant?",
      "Which character is related to Belen through marriage?"
    ]
  },
  {
    "id": "8f3abc20-e2ae-4739-96e0-b6f838ab2882",
    "questions": [
      "What significant event did Beorn participate in after granting shelter to Thorin and Company?",
      "In what year did Beorn provide assistance to Thorin and Company during their quest?",
      "What unique ability did Beorn possess that allowed him to communicate with animals?",
      "Who succeeded Beorn as chieftain after his death?",
      "What was the name of Beorn's son who became known as Grimbeorn the Old?"
    ]
  },
  {
    "id": "8fcccad6-f5b1-4b14-aa57-2aa7c5fb758e",
    "questions": [
      "What was Harry Goatleaf's occupation at the West-gate of Bree?",
      "Who did Harry Goatleaf live with?",
      "What significant event involving a Nazgûl did Harry Goatleaf witness on September 23, 3018?",
      "In what year did the town of Bree face an attack by the Ruffians?",
      "What was the outcome for Harry Goatleaf after the battle against the Ruffians?"
    ]
  },
  {
    "id": "90ac707c-f2e6-44b6-8c49-863820198233",
    "questions": [
      "What year was Brand born?",
      "Who was Brand's spouse?",
      "In which battle was Brand killed?",
      "What event prompted Brand to retreat to Dale?",
      "Who succeeded Brand as King of Dale?"
    ]
  },
  {
    "id": "90c70c13-7917-453c-82ee-1ac0f95b802e",
    "questions": [
      "What year did Araphant ascend to the throne of Arthedain?",
      "Who was Araphant's father?",
      "What significant prophecy did the seer Malbeth make during Araphant's reign?",
      "Which alliance did Araphant forge during his rule, and what was the outcome of that alliance?",
      "In what year did Araphant die, and who succeeded him?"
    ]
  },
  {
    "id": "913c9c67-2361-4e45-be53-4ff545a637bf",
    "questions": [
      "What is the race of Fastolph Bolger?",
      "Who are the parents of Fastolph Bolger?",
      "In what year was Fastolph Bolger born?",
      "Who is Fastolph Bolger's spouse?",
      "Which realm does Fastolph Bolger belong to?"
    ]
  },
  {
    "id": "915f85ef-97bc-4265-9cf8-77e42195b2cd",
    "questions": [
      "What race does Marhari belong to?",
      "In what year did Marhari die?",
      "Who was Marhari's spouse?",
      "What significant battle did Marhari participate in alongside King Narmacil II?",
      "What group did Marhari's son Marhwini lead to refuge after the battle?"
    ]
  },
  {
    "id": "91b136d1-f5b8-4a76-947f-51b6633db309",
    "questions": [
      "What race does Guilin belong to?",
      "Who are Guilin's children?",
      "What significant event was initiated by Gelmir's death?",
      "What happened to Gwindor as a result of the Nírnaeth Arnoediad?",
      "What is known about Guilin's spouse?"
    ]
  },
  {
    "id": "9236ceb9-2b1e-4d5f-8e9d-4d072d8417a8",
    "questions": [
      "What is the race of Gálmód?",
      "In what year was Gálmód born?",
      "When did Gálmód die?",
      "Who was Gálmód's spouse?",
      "What is known about Gálmód's relationship with Gandalf?"
    ]
  },
  {
    "id": "92926a05-de1e-4013-9d07-4e26eaca83d4",
    "questions": [
      "What was the race of Bregolas?",
      "Who were the siblings of Bregolas?",
      "In which battle was Bregolas killed?",
      "What were the names of Bregolas's children?",
      "Who succeeded Bregor as the Lord of Ladros?"
    ]
  },
  {
    "id": "929b4050-e0e4-4437-bb88-f09fc1fb7f58",
    "questions": [
      "What year was Hallas born?",
      "Who succeeded Hallas as Ruling Steward?",
      "What names did Hallas devise for the land and its people?",
      "In what year did Hallas die?",
      "What was the relationship between Hallas and Cirion?"
    ]
  },
  {
    "id": "929c38dc-d683-4f79-ab6c-9a4dca0b42b2",
    "questions": [
      "What year did Arahad II become the Chieftain of the Dúnedain?",
      "Who raised Arahad II in Rivendell?",
      "What significant event regarding Hobbits occurred during Arahad II's rule?",
      "Who succeeded Arahad II as Chieftain after his death?",
      "In what year did Arahad II die?"
    ]
  },
  {
    "id": "9364cf37-7ffd-4c6f-80c5-5fb7f721c1c1",
    "questions": [
      "Who was Gorbadoc Brandybuck married to?",
      "How many children did Gorbadoc Brandybuck have?",
      "What is the relation between Gorbadoc Brandybuck and Frodo Baggins?",
      "In what year was Gorbadoc Brandybuck born?",
      "What position did Gorbadoc Brandybuck hold in Buckland?"
    ]
  },
  {
    "id": "93845bf6-d0bf-4bc4-b4f8-6ba62c338dc4",
    "questions": [
      "What year did Herion become the third Ruling Steward?",
      "Who succeeded Herion after his death?",
      "In what year did Herion die?",
      "Who was Herion's father?",
      "What is the relationship between Herion and Mardil Voronwë?"
    ]
  },
  {
    "id": "93c6e624-90f9-49eb-b9f0-a51b93a01522",
    "questions": [
      "What year did Tar-Anárion succeed his mother as ruler?",
      "Who succeeded Tar-Anárion after his death?",
      "What was the name of Tar-Anárion's spouse?",
      "In what realm did Tar-Anárion rule?",
      "What was the reason for Tar-Anárion's daughters declining the throne?"
    ]
  },
  {
    "id": "93d11bc3-7e99-46cd-a269-89a6e8142b07",
    "questions": [
      "What year was Faramir born?",
      "Who was Faramir's spouse?",
      "What significant event occurred in Faramir's life in June of 3018?",
      "How did Faramir respond when he encountered Frodo and Sam?",
      "What title did Faramir hold after the coronation of Aragorn?"
    ]
  },
  {
    "id": "959aafab-299c-4e57-817a-4708da0449ad",
    "questions": [
      "What race is Old Noakes?",
      "In what year was Old Noakes born?",
      "Who was Old Noakes' spouse?",
      "What event was occurring in TA 3001 when Old Noakes was gossiping?",
      "What were the differing opinions about Drogo Baggins' involvement in the boat incident?"
    ]
  },
  {
    "id": "95dd306e-4fc3-4ceb-aac4-d57c21d383c3",
    "questions": [
      "What significant event did Mablung and his companion Damrod participate in during the year TA 3019?",
      "What clothing did Mablung wear as a Ranger?",
      "In which battles did Mablung fight?",
      "What warning did Mablung give to the Men of the West before they marched to the Black Gate?",
      "What is known about Mablung's fate after the Battle of the Morannon?"
    ]
  },
  {
    "id": "9677a23a-8081-42aa-a336-50fbba73ace4",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier for Ferdinand Took?",
      "Is there any information available about Ferdinand Took's race or gender?",
      "What notable events or characteristics are associated with Ferdinand Took?",
      "Does the character have any family members or relationships mentioned?"
    ]
  },
  {
    "id": "96a43106-fc34-4997-8312-31e80444f7bb",
    "questions": [
      "What race is Golasgil?",
      "In which year did Golasgil march to the defense of Minas Tirith?",
      "What type of individuals accompanied Golasgil during the march to Minas Tirith?",
      "What significant battle did Golasgil presumably participate in?",
      "Why is it presumed that Golasgil survived the Battle of the Pelennor Fields?"
    ]
  },
  {
    "id": "96ff3d31-d6bb-46fe-b239-7658ad9799bb",
    "questions": [
      "What is the full name of Briffo Boffin's father?",
      "How many siblings did Briffo Boffin have?",
      "In what year did Briffo Boffin move to Bree?",
      "What was the original residence of Briffo Boffin's family?",
      "Did Briffo Boffin ever marry?"
    ]
  },
  {
    "id": "97316334-2147-4703-9157-c83176832089",
    "questions": [
      "Who awakened Tata?",
      "What race does Tata belong to?",
      "Who is Tata's spouse?",
      "What is known about Tata's fate?",
      "What group of Elves did Tata lead?"
    ]
  },
  {
    "id": "9776a656-3440-47f4-95c2-004a3e19928d",
    "questions": [
      "What is the race of Hundar?",
      "Who were Hundar's siblings?",
      "What are the names of Hundar's children?",
      "In which significant event did Hundar perish?",
      "What is known about Hundar's spouse?"
    ]
  },
  {
    "id": "979c88e8-96b4-4aae-a6a4-70e690135487",
    "questions": [
      "What year was Imrahil born?",
      "Who were Imrahil's children?",
      "What role did Imrahil play during the Siege of Gondor?",
      "Which notable event did Imrahil attend after the War of the Ring?",
      "Who succeeded Imrahil as the Prince of Dol Amroth?"
    ]
  },
  {
    "id": "97af9743-727e-4f1d-a0aa-7ae56897862f",
    "questions": [
      "What race is Fastred?",
      "In which battle was Fastred slain?",
      "When did Fastred die?",
      "What army did Fastred ride with to Gondor?",
      "What is the name of the song that laments Fastred's death?"
    ]
  },
  {
    "id": "97cfccf4-6ea0-4626-a4b7-923bd29b8a19",
    "questions": [
      "What was Rúmil's role in Lórien?",
      "Who were Rúmil's brothers?",
      "Which group did Rúmil guide to Caras Galadhon?",
      "How well did Rúmil speak Westron?",
      "What significant event was Rúmil present at involving the Fellowship of the Ring?"
    ]
  },
  {
    "id": "984e16a2-d1d0-444c-9dc0-d7b532e360b9",
    "questions": [
      "Who are Findis's parents?",
      "What is Findis's race?",
      "Did Findis join the Rebellion of the Ñoldor?",
      "Who is Findis's younger brother?",
      "Where did Findis reside during her life?"
    ]
  },
  {
    "id": "98dac473-8200-4277-909e-b1a52e0649ea",
    "questions": [
      "What is the race of Argon?",
      "Who are the siblings of Argon?",
      "In which age did Argon set foot on Middle-earth?",
      "What significant event led to Argon's death?",
      "How was Argon described in terms of height compared to his brothers?"
    ]
  },
  {
    "id": "999a91f1-5486-45c1-bcbc-cdb2830b3ea6",
    "questions": [
      "What year was Isembold Took born?",
      "Who were Isembold Took's parents?",
      "How many siblings did Isembold Took have?",
      "What is known about Isembold Took's spouse?",
      "In what year did Isembold Took pass away?"
    ]
  },
  {
    "id": "99b59ebc-5649-461b-9074-57dc05578df2",
    "questions": [
      "What year was Belegorn born?",
      "Who was Belegorn's father?",
      "In what year did Belegorn become the fourth Ruling Steward of Gondor?",
      "How long did Belegorn rule Gondor?",
      "Who succeeded Belegorn after his death?"
    ]
  },
  {
    "id": "9a39944f-a3ec-4a85-8431-3d4cf97d01f2",
    "questions": [
      "What is the birth year of Hugo Boffin?",
      "Who is Hugo Boffin's spouse?",
      "How many children did Hugo Boffin have?",
      "What are the names of Hugo Boffin's children?",
      "In what year did Hugo Boffin pass away?"
    ]
  },
  {
    "id": "9bb51528-0183-4a3f-8ddf-24d2dfcd2a2f",
    "questions": [
      "What was the name of the realm where Celegorm and his brother were great lords?",
      "In which battle did Celegorm and his brother lose their land Himlad?",
      "Who did Celegorm wish to marry while living in Nargothrond?",
      "What was the fate of Celegorm during the Second Kinslaying?",
      "What oath did Celegorm take after the theft of the Silmarils?"
    ]
  },
  {
    "id": "9c6277a3-703f-42c7-ad31-9b5fe5a69faf",
    "questions": [
      "What was Círdan's original name before he took on the name 'Círdan'?",
      "In which age did Círdan witness the Fall of the Falas?",
      "What significant action did Círdan take during the War of the Last Alliance?",
      "Who did Círdan give Narya, the Ring of Fire, to?",
      "What was Círdan's relationship with Eärendil during the events described in the biography?"
    ]
  },
  {
    "id": "9ce125d8-2fb8-4f2c-bd6f-242f7b897e57",
    "questions": [
      "What year was Everard Took born?",
      "Who was Everard Took's father?",
      "What was the name of Everard Took's girlfriend?",
      "What dance did Everard and Melilot perform at Bilbo's Farewell Birthday Party?",
      "What happened to Everard Took's fate according to the biography?"
    ]
  },
  {
    "id": "9d05a6a0-dfc4-4adf-992f-00f8acd67618",
    "questions": [
      "What is the full name of Hamfast Gardner's father?",
      "How many siblings does Hamfast Gardner have?",
      "Who is Hamfast Gardner named after?",
      "What is the significance of Hamfast Gardner in relation to Frodo?",
      "What is the relationship between Hamfast Gardner and Samwise Gamgee?"
    ]
  },
  {
    "id": "9d52ad23-89b5-4c72-84b6-eeb72bc6e789",
    "questions": [
      "What is the birth year of Griffo Boffin?",
      "Who is Griffo Boffin's spouse?",
      "Which significant event did Griffo Boffin attend?",
      "Who are the parents of Griffo Boffin?",
      "What race does Griffo Boffin belong to?"
    ]
  },
  {
    "id": "9d8c63aa-05af-4d0b-8c68-e76a040eb793",
    "questions": [
      "What year was Daisy Gamgee I born?",
      "Who were Daisy Gamgee I's older brothers?",
      "How many younger siblings did Daisy Gamgee I have?",
      "What is the name of Daisy Gamgee I's younger brother who became famous in Middle-earth?",
      "What is the significance of Daisy Gamgee I's name in relation to her brother Sam?"
    ]
  },
  {
    "id": "9d921ae6-0c1e-4192-a3a7-e19a879965f6",
    "questions": [
      "What race is Elenwë?",
      "Who is Elenwë's spouse?",
      "In what year did Elenwë die?",
      "What significant event did Elenwë participate in during her journey to Middle-earth?",
      "Which notable descendants are related to Elenwë?"
    ]
  },
  {
    "id": "9e38e8ba-242d-4e71-b71c-c6a405b3c620",
    "questions": [
      "What year was Handir born?",
      "Who was Handir's spouse?",
      "In which realm did Handir serve as chieftain?",
      "What event led to Handir's death?",
      "How many children did Handir have?"
    ]
  },
  {
    "id": "9e8a835a-db49-4350-8a39-40170d784002",
    "questions": [
      "What year was Lothíriel born?",
      "Who is Lothíriel's spouse?",
      "How many brothers did Lothíriel have?",
      "What is the name of Lothíriel's son?",
      "In what year did Lothíriel marry Éomer?"
    ]
  },
  {
    "id": "9ea713de-2109-42c5-997d-d1aa673953fd",
    "questions": [
      "What is the full name of the character?",
      "What is the race of Mosco Burrows?",
      "What is the gender of Mosco Burrows?",
      "What notable events are associated with Mosco Burrows?",
      "Is there any information available about Mosco Burrows' biography?"
    ]
  },
  {
    "id": "9ea895d6-b070-49a9-9710-b1ec64a86ed2",
    "questions": [
      "What is the name of the character?",
      "What is the ID of Doderic Brandybuck?",
      "Is there any information about Doderic Brandybuck's race or gender?",
      "What notable events or characteristics are associated with Doderic Brandybuck?",
      "Does Doderic Brandybuck have any known relationships or family connections?"
    ]
  },
  {
    "id": "9f4a0e5d-c293-405e-aee8-d5472a5110ec",
    "questions": [
      "What year did Ondoher succeed his father Calimehtar as ruler of Gondor?",
      "Who was Ondoher's daughter married to?",
      "Which two groups invaded Gondor during Ondoher's reign?",
      "What happened to Ondoher and his eldest son Artamir during the battle against the Wainriders?",
      "Who ultimately became king after Ondoher's death, and what was the basis for their claim to the throne?"
    ]
  },
  {
    "id": "a023227e-d755-48cc-b40f-7ef9ea9c5969",
    "questions": [
      "What year was Tolman Cotton born?",
      "Who was Tolman Cotton's spouse?",
      "In which battle did Tolman Cotton fight?",
      "What was Tolman Cotton's role in the Shire during the return of the Fellowship of the Ring?",
      "How many children did Tolman Cotton have?"
    ]
  },
  {
    "id": "a049c6b7-e27d-41de-8106-5a8aa551df40",
    "questions": [
      "What is the full name of Pearl Took's father?",
      "Which family member was Pearl Took's brother?",
      "In what year did Pearl Took serve as an attendant to Lalia Took?",
      "What significant event is Pearl Took believed to have caused regarding Lalia Took?",
      "How many siblings did Pearl Took have?"
    ]
  },
  {
    "id": "a0556bf5-4375-4261-aa5f-e708f70a0ca6",
    "questions": [
      "What was the name of the expedition leader that Náli was part of?",
      "In which year did Náli die?",
      "Which Dwarven realm was Náli trying to reclaim?",
      "Who were the companions that joined Náli on the expedition?",
      "What significant event did Náli participate in during the battle at Moria?"
    ]
  },
  {
    "id": "a05cc598-cef8-4292-bfc8-3b731f01d95f",
    "questions": [
      "What was Pallando's race?",
      "Who was Pallando's friend that took him to Middle-earth?",
      "What were the names of the two Blue Wizards?",
      "What was Pallando's mission in Middle-earth?",
      "What alternate name did Tolkien provide for Pallando?"
    ]
  },
  {
    "id": "a068d3eb-753d-4f33-a223-65f6317ef4a6",
    "questions": [
      "What year was Angelica Baggins born?",
      "Who were Angelica Baggins' parents?",
      "What notable event did Angelica attend when she was young?",
      "What gift did Angelica receive after Bilbo's Farewell Birthday Party?",
      "Did Angelica Baggins ever marry?"
    ]
  },
  {
    "id": "a0cbecaf-81b6-49c3-aa00-67af49ea5703",
    "questions": [
      "What year was Húrin I born?",
      "Who was Húrin I's father?",
      "How long did Húrin I serve as the Ruling Steward of Gondor?",
      "In which year did Húrin I die?",
      "Who succeeded Húrin I as the Ruling Steward of Gondor?"
    ]
  },
  {
    "id": "a12b833f-559d-4f42-b471-ebd50f4c78ad",
    "questions": [
      "What is Elemmírë best known for composing?",
      "What event does the Aldudénië lament?",
      "Where is it likely that Elemmírë lived?",
      "What significant events did Elemmírë probably witness?",
      "What race does Elemmírë belong to?"
    ]
  },
  {
    "id": "a138ae52-25d3-44c6-99ff-c5b49185275a",
    "questions": [
      "What was the original name given to Amras and his twin brother by Nerdanel?",
      "In which realm did Amras settle after the death of his father?",
      "What significant event led to Amras and his brothers taking a terrible oath of enmity?",
      "During which battle did Amras and his brothers rescue their father, Fëanor?",
      "What was Amras known for after settling in East Beleriand?"
    ]
  },
  {
    "id": "a142e5f7-3292-4806-8eeb-f2dd62c73521",
    "questions": [
      "What year was Anardil born?",
      "Who was Anardil's father?",
      "In which realm did Anardil rule?",
      "How long did Anardil reign as king?",
      "Who succeeded Anardil after his death?"
    ]
  },
  {
    "id": "a15da3e9-4b3b-4a06-8567-7359752aee0c",
    "questions": [
      "What year was Belecthor I born?",
      "Who succeeded Belecthor I as Steward?",
      "How long did Belecthor I rule Gondor?",
      "What was the major threat to Gondor during Belecthor I's rule?",
      "What are the names of Belecthor I's children?"
    ]
  },
  {
    "id": "a19e4921-5d5e-432f-9f94-8831b7a7a81c",
    "questions": [
      "What significant military victory did Rómendacil II achieve in TA 1248?",
      "In which year did Rómendacil II ascend to the throne of Gondor?",
      "What name did Rómendacil II take upon becoming king, and what does it mean?",
      "Who was Rómendacil II's son, and what was his role in the alliance with the Northmen?",
      "How long did Rómendacil II reign before his death in TA 1366?"
    ]
  },
  {
    "id": "a1b57f21-43af-4bf4-8fe5-deafdceacc32",
    "questions": [
      "What is the birth year of Halfred Greenhand?",
      "Who are Halfred Greenhand's siblings?",
      "What was Halfred Greenhand's occupation?",
      "Who was Halfred Greenhand's father?",
      "What is the name of Halfred Greenhand's child?"
    ]
  },
  {
    "id": "a1e076de-a1e0-4ec0-8f28-126bafd129c9",
    "questions": [
      "What is the race of Gilfanon?",
      "Where did Gilfanon live?",
      "Who did Gilfanon know that was mentioned in his biography?",
      "What significant event did Gilfanon partake in with Eriol?",
      "What tales was Gilfanon known for recounting?"
    ]
  },
  {
    "id": "a23c53d3-ba18-4073-ac0b-5ecdfd3f8dd6",
    "questions": [
      "What race does Angamaitë belong to?",
      "In which age was Angamaitë born?",
      "Who was the king that Angamaitë killed during the sack of Pelargir?",
      "What significant action did Angamaitë take in TA 1634?",
      "What was Angamaitë's relationship to Castamir?"
    ]
  },
  {
    "id": "a37a479a-4f7d-46ff-b6a8-cf3c985e96ec",
    "questions": [
      "What year was Mentha Brandybuck born?",
      "Who were Mentha Brandybuck's siblings?",
      "In what year did Mentha attend Bilbo's Farewell Birthday Party?",
      "What is the name of Mentha Brandybuck's father?",
      "What race does Mentha Brandybuck belong to?"
    ]
  },
  {
    "id": "a3b46808-47a0-4fcf-b6a1-2bf858a9045b",
    "questions": [
      "What race is Marcho?",
      "In which year was Marcho born?",
      "Who was Marcho's brother?",
      "What significant action did Marcho take with his followers?",
      "Where did Marcho and his followers settle?"
    ]
  },
  {
    "id": "a553d007-616d-4c00-aac7-53860b38db00",
    "questions": [
      "What title was created for Elatan and Silmariën's first child, Valandil?",
      "Who was Elatan's spouse?",
      "In which age did Elatan and Silmariën live?",
      "What significant role did Elatan's descendants play in the history of Middle-earth?",
      "Which famous descendant of Elatan was a hero in the War of the Ring?"
    ]
  },
  {
    "id": "a65c0150-5bfb-4a7f-8cf8-cd41233aa626",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier associated with Robin Gardner?"
    ]
  },
  {
    "id": "a6757da3-035c-4364-a441-7b9ea871a7b6",
    "questions": [
      "What was the name of the King of Númenor that Vëantur served under?",
      "In what year did Vëantur achieve his voyage back to Middle-earth?",
      "What were the names of Vëantur's ships?",
      "Who was Vëantur's daughter and whom did she marry?",
      "What significant journey did Vëantur take with his grandson Anardil?"
    ]
  },
  {
    "id": "a69145ed-7fe1-47a0-b08c-a7796d909ea4",
    "questions": [
      "What year did Arantar ascend the throne of Arnor?",
      "Who was Arantar's father?",
      "How long did Arantar reign as king?",
      "In which year did Arantar die?",
      "Who succeeded Arantar after his death?"
    ]
  },
  {
    "id": "a6cf8f98-739c-4f1b-8709-eeeeb8972b3b",
    "questions": [
      "What is the race of Hundad?",
      "What is the gender of Hundad?",
      "When was Hundad born?",
      "When did Hundad die?",
      "Who was Hundad's spouse?"
    ]
  },
  {
    "id": "a6ffae73-c22f-4dcf-8792-fb936cbbc4d8",
    "questions": [
      "What was the birth year of Vardamir Nólimon?",
      "Who succeeded Vardamir as King of Númenor?",
      "How long did Vardamir Nólimon nominally rule Númenor?",
      "What was Vardamir's primary interest as noted in his biography?",
      "Name one of Vardamir's siblings."
    ]
  },
  {
    "id": "a7a76709-be0d-4fa6-863a-0178140aad7f",
    "questions": [
      "What year was Berylla Baggins born?",
      "Who were Berylla Baggins' parents?",
      "What is the name of Berylla Baggins' spouse?",
      "How many children did Berylla Baggins have?",
      "In what year did Berylla Baggins pass away?"
    ]
  },
  {
    "id": "a7b6dca1-01fe-474f-afab-d52e31dcc66e",
    "questions": [
      "What is the race of Harding?",
      "In which age was Harding born?",
      "What is the gender of Harding?",
      "When did Harding die?",
      "What is the full name of the character described in the payload?"
    ]
  },
  {
    "id": "a7c819ed-c27e-4a0e-9200-94f4f11b1d34",
    "questions": [
      "What year was Eldarion born?",
      "Who was Eldarion's father?",
      "What significant event occurred in FO 120 related to Eldarion?",
      "Which royal title was Eldarion given by his father?",
      "Who served as the royal scribe during Eldarion's reign?"
    ]
  },
  {
    "id": "a83697e9-d3b2-495b-97a0-b549f2fee7cd",
    "questions": [
      "What role did Galdor of the Havens play in the Council of Elrond?",
      "What was Galdor's relationship with Círdan the Shipwright?",
      "What did Galdor question Gandalf about during the Council of Elrond?",
      "In which year was Galdor sent to Rivendell on an errand?",
      "What concerns did Galdor express regarding the safety of the One Ring?"
    ]
  },
  {
    "id": "a8946389-d5e9-4649-9ef7-83a197788911",
    "questions": [
      "What year was Sancho Proudfoot born?",
      "Who were Sancho Proudfoot's family members present at Bilbo's Farewell Birthday Party?",
      "What event did Sancho witness the day after Bilbo's birthday party?",
      "What was Sancho attempting to do at Bag End after Bilbo's departure?",
      "What happened to Sancho Proudfoot when he was caught by Frodo?"
    ]
  },
  {
    "id": "a89654c6-d555-4e13-bb59-ca1539b1b209",
    "questions": [
      "What year was Túrin I born?",
      "Who was Túrin I's father?",
      "In which year did Túrin I become the sixth Ruling Steward of Gondor?",
      "How many children did Túrin I have?",
      "What was the age of Túrin I at the time of his death?"
    ]
  },
  {
    "id": "a8d73dea-9ad6-4e4f-b02b-8ec70f41dcb9",
    "questions": [
      "What was the birth year of Elendur of Arnor?",
      "Who succeeded Elendur as High King of Arnor?",
      "How long did Elendur serve as High King of Arnor?",
      "What realm did Elendur of Arnor belong to?",
      "What is known about the events during Elendur's reign as High King?"
    ]
  },
  {
    "id": "a9960655-3868-42d7-8c98-2347643a0ebb",
    "questions": [
      "What was the birth year of Hardang?",
      "Who was Hardang's father?",
      "In which year did Hardang become the Halbar of the Men of Brethil?",
      "What was the name of the Captain of the Guards chosen by Hardang?",
      "How did Hardang die?"
    ]
  },
  {
    "id": "a9d1f59e-8cb5-4aa1-938b-0ff685634ec9",
    "questions": [
      "What year was Faramir Took I born?",
      "Who is Faramir Took I's spouse?",
      "In what year did Faramir Took I inherit the title of Shire-thain?",
      "Who preceded Faramir Took I as Shire-thain?",
      "What title did Faramir Took I inherit after Peregrin and Meriadoc left for Edoras and Gondor?"
    ]
  },
  {
    "id": "a9dc3000-3eb5-4289-917d-9d59bfb4b05e",
    "questions": [
      "What year did Arathorn I become the Chieftain of the Dúnedain?",
      "Who was Arathorn I's father?",
      "What significant battle marked the end of the War of the Dwarves and Orcs?",
      "In what year did Arathorn I die?",
      "How long did Arathorn I serve as Chieftain?"
    ]
  },
  {
    "id": "aa6354c2-9aa3-4180-b70d-c0a514d18506",
    "questions": [
      "What was Tar-Aldarion's title and what does his name signify?",
      "In which realm did Tar-Aldarion rule?",
      "Who was Tar-Aldarion's spouse?",
      "What significant change did Tar-Aldarion make regarding the rules of succession?",
      "What was the name of Tar-Aldarion's daughter and what position did she hold?"
    ]
  },
  {
    "id": "aaa5a1de-177e-4d51-a413-2b3521f7805a",
    "questions": [
      "What was the name of Ingwion's father?",
      "In which year did Ingwion lead the Vanyar in the War of Wrath?",
      "Where did Ingwion build a great tower after returning to Aman?",
      "Who became the Lady of Tol Eressëa as a result of Ingwion's family lineage?",
      "What is the race and gender of Ingwion?"
    ]
  },
  {
    "id": "aada1595-49ae-41dc-a566-77a2ea3e33ff",
    "questions": [
      "What year was Fastred born?",
      "In which battle was Fastred killed?",
      "Who accompanied Fastred in leading the army to aid Gondor?",
      "What was the outcome of the battle in which Fastred died?",
      "Where were Fastred and his brother buried?"
    ]
  },
  {
    "id": "aaf20a20-497e-4b11-9462-c9e046a15680",
    "questions": [
      "What race is Edrahil?",
      "In what year did Edrahil die?",
      "Who did Edrahil accompany on the quest for the Silmaril?",
      "What was Edrahil's gender?",
      "Where is it likely that Edrahil died?"
    ]
  },
  {
    "id": "aaf68eb8-6f37-40db-89af-2c1ed97d420b",
    "questions": [
      "What year was Arador born?",
      "Who succeeded Arador as chieftain after his death?",
      "In which region did the majority of the Dúnedain live during Arador's reign?",
      "What event led to Arador's death?",
      "What was the relationship between Arador and Aragorn II?"
    ]
  },
  {
    "id": "ab085c65-6622-4ac4-9f2d-8bd46fd32e5d",
    "questions": [
      "What race is Willie Banks?",
      "In which realm did Willie Banks live?",
      "When did Willie Banks die?",
      "What event led to Willie Banks being called to arms?",
      "Who was Willie Banks killed alongside during the battle?"
    ]
  },
  {
    "id": "ab6fe213-cf1e-42f4-ae4c-84f7fcce4520",
    "questions": [
      "What was the name of Caranthir's realm in East Beleriand?",
      "Who did Caranthir rescue when they were besieged by Orcs?",
      "In which year did Caranthir die?",
      "What significant event forced Caranthir to flee Thargelion?",
      "Which brothers of Caranthir perished alongside him during the Second Kinslaying?"
    ]
  },
  {
    "id": "abde7fa9-eafb-48ef-9fd9-a90716c0c720",
    "questions": [
      "What race does Oropher belong to?",
      "What realm did Oropher rule over?",
      "In which year did Oropher die?",
      "Who was Oropher's spouse?",
      "What significant battle did Oropher participate in during the War of the Last Alliance?"
    ]
  },
  {
    "id": "ac121229-a8a4-4ecf-bf8e-2e3bf94ced0f",
    "questions": [
      "What is the race of the character Magor?",
      "What gender is Magor?",
      "In what year was Magor born?",
      "What is the full name of the character?",
      "Is there any information about Magor's death or relationships?"
    ]
  },
  {
    "id": "ac304d2d-82a3-48aa-95a2-ed275efcd729",
    "questions": [
      "What role does Galion serve in relation to King Thranduil?",
      "What task was Galion responsible for regarding the king's cellars?",
      "In which year did Galion fall asleep with the chief of the guards?",
      "What event allowed the hobbit to steal the keys and release Thorin and Company?",
      "What did Galion instruct the other Elves to do with the seemingly empty barrels?"
    ]
  },
  {
    "id": "ac85b08a-b600-4352-b92d-4b45711c1745",
    "questions": [
      "What is the birth year of Diamond Took?",
      "Who is Diamond Took's spouse?",
      "In which region was Diamond Took born?",
      "How many children did Diamond Took have?",
      "What significant event occurred about eight years after the War of the Ring in relation to Diamond Took?"
    ]
  },
  {
    "id": "ac9b2d1c-1966-4548-8a98-5bd76b63c461",
    "questions": [
      "What year was Gilraen born?",
      "Who was Gilraen's spouse?",
      "In which year did Gilraen give birth to Aragorn?",
      "What was the name given to Aragorn by Elrond?",
      "In what year did Gilraen die?"
    ]
  },
  {
    "id": "acc82744-7b40-40da-9429-ff50a283ec2b",
    "questions": [
      "What is the race of Atanalcar?",
      "Who is Atanalcar's brother?",
      "In which age was Atanalcar born?",
      "What is known about Atanalcar's marital status?",
      "What speculation exists regarding Atanalcar's children?"
    ]
  },
  {
    "id": "ad710dd5-865d-4f14-8cf1-8326befa033e",
    "questions": [
      "What significant battles did Celeborn fight in during the First Age?",
      "Who is Celeborn's spouse and what is their relationship?",
      "In which realms did Celeborn and Galadriel rule together?",
      "What event led to Celeborn's distrust of the dwarves?",
      "What happened to Celeborn and Galadriel after the War of the Ring?"
    ]
  },
  {
    "id": "ad8c56b6-0a6b-4942-bd27-87d77f4ad7ec",
    "questions": [
      "What year was Isembard Took born?",
      "How many siblings did Isembard Took have?",
      "What is the name of Isembard Took's son?",
      "In what year did Isembard Took die?",
      "Who were Isembard Took's parents?"
    ]
  },
  {
    "id": "add85615-e7d0-4229-a979-d30a46429188",
    "questions": [
      "What is the full name of the character?",
      "What is the character's race?",
      "What notable family does Berilac Brandybuck belong to?",
      "Is there any information about Berilac Brandybuck's biography?",
      "What is the gender of Berilac Brandybuck?"
    ]
  },
  {
    "id": "ae289e7e-5b1f-4c72-be62-ac00e23ce5df",
    "questions": [
      "What was Fingolfin's relationship with his half-brother Fëanor?",
      "In which realm did Fingolfin rule as High King of the Ñoldor?",
      "What significant event did Fingolfin's host experience during their journey to Middle-earth?",
      "How did Fingolfin die, and what was the outcome of his duel with Morgoth?",
      "Who succeeded Fingolfin as High King of the Ñoldor after his death?"
    ]
  },
  {
    "id": "ae60b4a4-84bf-4142-b5c8-33bfaa3f799b",
    "questions": [
      "What race does Anairë belong to?",
      "Who is Anairë's spouse?",
      "How many children did Anairë have?",
      "Did Anairë accompany her husband to Middle-earth?",
      "Who was Anairë friends with?"
    ]
  },
  {
    "id": "aea9c73e-b9a0-47d5-9359-ce45ff15013c",
    "questions": [
      "What title did Galdor hold after succeeding his father?",
      "Who was Galdor's spouse?",
      "In which battle was Galdor slain?",
      "What were the names of Galdor's sons?",
      "What notable physical characteristic is Galdor known for?"
    ]
  },
  {
    "id": "afd257c0-6252-4a50-a376-eed95c33ea9d",
    "questions": [
      "What significant event led to the awakening of Durin's Bane in TA 1980?",
      "Who was the first Dwarf killed by Durin's Bane?",
      "In which year did Gandalf finally defeat Durin's Bane?",
      "What is the race of Durin's Bane and how does it relate to other characters like Gandalf?",
      "What happened to Durin's Bane after its physical form was destroyed by Gandalf?"
    ]
  },
  {
    "id": "b00a0843-99b4-4bbc-8c3c-78859b000afe",
    "questions": [
      "What year was Brego born?",
      "Who was Brego's father?",
      "What significant construction did Brego complete during his reign?",
      "Which son of Brego swore an oath at the dedication feast of the Golden Hall?",
      "How did Brego's grief over his son's loss affect his life?"
    ]
  },
  {
    "id": "b02b9dc4-b011-4b56-a42f-ef050347544a",
    "questions": [
      "What principle of succession prevented women from ruling in Númenor during Tar-Meneldur's time?",
      "Who was Tar-Meneldur's spouse?",
      "How many children did Tar-Meneldur have, and can you name them?",
      "What significant organization did Tar-Meneldur's son Aldarion establish during his rule?",
      "What event prompted Tar-Meneldur to abdicate in favor of his son Aldarion?"
    ]
  },
  {
    "id": "b043f78e-d448-4cb3-8eb7-caf73e22821c",
    "questions": [
      "What year was Brytta Léofa born?",
      "Who was Brytta Léofa's father?",
      "What significant challenges did Brytta face during his reign as king?",
      "What does the epithet 'Léofa' mean in the Rohanese tongue?",
      "How long did Brytta Léofa rule before his death?"
    ]
  },
  {
    "id": "b08fa4e5-1856-4329-b1a4-27880db19f21",
    "questions": [
      "What year did Argeleb II come to the throne?",
      "Who was Argeleb II's father?",
      "In which realm did Argeleb II rule?",
      "What significant event affected the population of Cardolan during Argeleb II's reign?",
      "Who succeeded Argeleb II after his death?"
    ]
  },
  {
    "id": "b09a7e4c-8e15-4f28-aad1-1524fdd19e21",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier for Rudolph Bolger?",
      "Is there any information about the race or gender of Rudolph Bolger?",
      "What are the notable characteristics or background details of Rudolph Bolger?",
      "Does Rudolph Bolger have any known relationships or family members mentioned?"
    ]
  },
  {
    "id": "b0a055c3-c4fd-4262-ae98-c710a3bf8d18",
    "questions": [
      "What royal clan does Meril belong to?",
      "Who was Meril's grandfather and what significant action did he take?",
      "What warning did Meril give to Eriol about drinking limpë?",
      "What was the outcome of Eriol's actions regarding the Faring Forth?",
      "What is the significance of the Cottage of Lost Play in Meril's story?"
    ]
  },
  {
    "id": "b0e4e5ac-6674-4d3d-a9ac-7c531116b356",
    "questions": [
      "What title was Tarannon Falastur known by due to his naval achievements?",
      "In what year did Tarannon succeed his father as king?",
      "Who was Tarannon's spouse, and what was notable about her behavior during his reign?",
      "What significant construction project did Tarannon undertake in the city of Pelargir?",
      "Who succeeded Tarannon after his death in TA 913?"
    ]
  },
  {
    "id": "b0e671dd-eb74-4de6-99ae-3fe154814bba",
    "questions": [
      "What is the full name of Rudigar Bolger's spouse?",
      "In which realm did Rudigar Bolger live?",
      "What year was Rudigar Bolger born?",
      "How old was Rudigar Bolger when he died?",
      "Who was Rudigar Bolger's father?"
    ]
  },
  {
    "id": "b1c708d6-7d47-4bcb-a555-45568ec705b6",
    "questions": [
      "What year was Tar-Súrion born?",
      "Who succeeded Tar-Súrion as King?",
      "What significant idea was born during Tar-Súrion's reign?",
      "Who is Tar-Súrion's oldest child?",
      "What is the relationship between Tar-Súrion and Tar-Minastir?"
    ]
  },
  {
    "id": "b29de7e5-42ef-4f49-bf29-692dea0a3d37",
    "questions": [
      "What is the full name of the character?",
      "What is the last name of Lavender?",
      "Is Lavender a first name or a last name?",
      "What is the character's middle name?",
      "What is the significance of the name Boffin in the context of the character?"
    ]
  },
  {
    "id": "b3518bdc-10e5-4fd2-81f7-2a0c69b98f48",
    "questions": [
      "What race does the King of the Dead belong to?",
      "Who was the King of Gondor during the time of the King of the Dead's oath?",
      "What significant event did the King of the Dead fail to participate in during the War of the Last Alliance?",
      "Which character did the King of the Dead and his people ally with during the War of the Ring?",
      "What happened to the King of the Dead after Aragorn declared the oath of the Dead Men as fulfilled?"
    ]
  },
  {
    "id": "b3f7074f-0a89-461e-b6ae-299e42874e96",
    "questions": [
      "What race is Frár?",
      "In which year did Frár enter the abandoned dwarf-kingdom of Khazad-dûm?",
      "Who was killed by an Orc archer on November 10, 2994?",
      "What were the names of Frár's companions who entered Khazad-dûm with him?",
      "What happened to Frár during the events in Khazad-dûm?"
    ]
  },
  {
    "id": "b3f89b71-d80c-42af-a431-69ed95be716d",
    "questions": [
      "What was the birth year of Tar-Palantir?",
      "Who was Tar-Palantir's spouse?",
      "What significant action did Tar-Palantir take regarding the White Tree, Nimloth?",
      "What was the name of Tar-Palantir's daughter?",
      "How did Tar-Palantir's reign differ from that of his predecessors?"
    ]
  },
  {
    "id": "b4424451-9452-4e75-94d1-e5bbd663fe7c",
    "questions": [
      "What year was Ori born?",
      "Who were Ori's cousins that he lived with in Thorin's hall?",
      "In which battle did Ori fight in TA 2942?",
      "What role did Ori take on after settling in Erebor under Dáin II Ironfoot?",
      "What was the fate of Ori and his companions in Moria in TA 2994?"
    ]
  },
  {
    "id": "b460fa0e-fe87-41a9-ad31-c25e6b245c23",
    "questions": [
      "What was the race of Algund?",
      "Who was the Lord of Dor-lómin during Algund's time?",
      "In what year did Algund die?",
      "What role did Algund play in the outlaw band after Túrin joined?",
      "What event likely led to Algund's death?"
    ]
  },
  {
    "id": "b490969e-3358-4b1c-85d6-146ab98144f6",
    "questions": [
      "What year was Minardil born?",
      "Who was Minardil's father?",
      "In what year did Minardil succeed to the throne?",
      "What event led to Minardil's death?",
      "How many sons did Minardil have?"
    ]
  },
  {
    "id": "b4c43666-d10c-4e1a-83ce-58238b28f876",
    "questions": [
      "What year was Tarondor of Arnor born?",
      "Who was Tarondor of Arnor's father?",
      "In what year did Tarondor ascend to the throne of Arnor?",
      "How long did Tarondor rule as king?",
      "Who succeeded Tarondor of Arnor after his death?"
    ]
  },
  {
    "id": "b537121c-44c5-4d1b-944a-a6db528c2ef1",
    "questions": [
      "Where was Annael born?",
      "What was Annael's role during the Nírnaeth Arnoediad?",
      "Who did Annael foster during his early years?",
      "What significant battles did Annael participate in after the Noldor's return to Middle-earth?",
      "What happened to Annael and his people after they were ambushed by Orcs and Easterlings?"
    ]
  },
  {
    "id": "b55cdb7a-11ad-4361-b212-11cd371d23dc",
    "questions": [
      "What was the birth year of Malach?",
      "Who was Malach's spouse?",
      "What title did Malach hold after the death of his father?",
      "Which Elven-prince did Malach serve during his time among the Ñoldor?",
      "What was the name of Malach's daughter who was known as Adanel the Wise?"
    ]
  },
  {
    "id": "b57e7aad-8b64-4799-a1eb-8d2efaa4ff6f",
    "questions": [
      "What is the relationship between Lindórië and Eärendur?",
      "Who is the daughter of Lindórië?",
      "What significant role did Lindórië play in the upbringing of her grandson?",
      "In which age was Lindórië born and when did she die?",
      "What beliefs did Lindórië pass on to her daughter?"
    ]
  },
  {
    "id": "b589f45e-21b8-4917-b8d5-5635c7efeb67",
    "questions": [
      "What is the name of Lindo's spouse?",
      "In what type of dwelling did Lindo live?",
      "Who was one of the notable visitors that Lindo and Vairë entertained?",
      "What was Lindo known for?",
      "What tale did Lindo tell to Eriol?"
    ]
  },
  {
    "id": "b5c1b0b4-476a-4aa7-9e6f-8a9f545b899f",
    "questions": [
      "What year was Bungo Baggins born?",
      "Who were Bungo Baggins' parents?",
      "What is the name of Bungo Baggins' spouse?",
      "In which year did Bungo Baggins die?",
      "What significant structure did Bungo Baggins build for his family?"
    ]
  },
  {
    "id": "b5eea259-85eb-4426-a03b-3a2b8ff7600d",
    "questions": [
      "What year was Dior born?",
      "Who was Dior's father?",
      "In what year did Dior become the Ruling Steward of Gondor?",
      "How long did Dior rule Gondor?",
      "Who succeeded Dior as the Ruling Steward after his death?"
    ]
  },
  {
    "id": "b5f80e7f-c457-4edb-a6b7-de3e82153f7c",
    "questions": [
      "What race is Núneth?",
      "Who is Núneth's spouse?",
      "In which age was Núneth born?",
      "What advice did Núneth give to her daughter?",
      "What is the name of Núneth's daughter?"
    ]
  },
  {
    "id": "b6627192-f7ce-41c5-bcb5-cc7add56ff4f",
    "questions": [
      "What year was Cirion born?",
      "Who was Cirion's father?",
      "What significant event did Cirion prepare for in TA 2509?",
      "What was the outcome of the Battle of the Field of Celebrant?",
      "What did Cirion give to the Éothéod as a gesture of friendship?"
    ]
  },
  {
    "id": "b72b7c7d-4c3f-4012-9551-dc0a8fa1ff0a",
    "questions": [
      "What is the race of Erellont?",
      "Who were Erellont's companions when he sailed with Eärendil?",
      "What was Erellont's role during Eärendil's journey to Aman?",
      "What happened to Erellont after Eärendil completed his embassy?",
      "Where is it suggested that Erellont lived before joining Eärendil?"
    ]
  },
  {
    "id": "b72d2981-d045-4bdc-a584-ad2ac27397e7",
    "questions": [
      "What year did Aravorn become the Chieftain of the Dúnedain?",
      "Who raised Aravorn in Rivendell?",
      "In what year did Aravorn die?",
      "How long did Aravorn serve as chieftain?",
      "Who succeeded Aravorn as Chieftain of the Dúnedain?"
    ]
  },
  {
    "id": "b741d3e2-3a2a-41b7-9792-afc88c45a804",
    "questions": [
      "What year was Tanta Baggins born?",
      "Who was Tanta Baggins' husband?",
      "Who are Tanta Baggins' children?",
      "What is the relationship between Tanta Baggins and Ruby Bolger?",
      "In which year did Tanta Baggins live according to the Shire Reckoning?"
    ]
  },
  {
    "id": "b77b5c13-9d94-40c2-bc61-018b7e40bc65",
    "questions": [
      "What was Ragnir's role within Húrin's company?",
      "Who led the company that Ragnir was a part of?",
      "What was the fate of Húrin's company after they were ejected from Brethil?",
      "What suggestion did Ragnir make when Húrin fled alone?",
      "In which realm did Ragnir and his companions encounter the march-wardens?"
    ]
  },
  {
    "id": "b7dee8f3-d81b-4d06-ac19-08218e57ad90",
    "questions": [
      "What is the birth year of Barahir?",
      "Who succeeded Barahir as the Ruling Steward of Gondor?",
      "In which era did Barahir rule Gondor?",
      "How long did Barahir serve as the Ruling Steward before his death?",
      "What was the age of Barahir at the time of his death?"
    ]
  },
  {
    "id": "b804ca0f-be25-4a90-a9ee-fd8f2e9f9da2",
    "questions": [
      "What year was Folco Boffin born?",
      "Who were Folco Boffin's parents?",
      "Which notable Hobbits did Folco Boffin have friendships with?",
      "What significant event did Folco Boffin assist Frodo Baggins with?",
      "In which age did Folco Boffin die?"
    ]
  },
  {
    "id": "b856319d-94c6-4720-a5ca-ed1ea964df68",
    "questions": [
      "What significant battle did Glóin participate in at the age of 16?",
      "In what year was Glóin's son Gimli born?",
      "Who did Glóin accompany on the quest to reclaim the Lonely Mountain?",
      "What event did Glóin and his son Gimli attend on October 25, 3018?",
      "How old was Glóin at the time of his death?"
    ]
  },
  {
    "id": "b8a2189d-4207-4e6f-bfcb-491944724bc8",
    "questions": [
      "What significant event did Bilbo Baggins experience at the age of 50 in the year TA 2941?",
      "Who were Bilbo's parents and what were their names?",
      "What was the name of the treasure that Bilbo secretly kept from Thorin during their time in the Lonely Mountain?",
      "In what year did Bilbo Baggins celebrate his 111th birthday before leaving the Shire?",
      "What items did Bilbo give to Frodo before he left for the Undying Lands?"
    ]
  },
  {
    "id": "b8a727bb-3ae9-4398-9b9f-18501e06913c",
    "questions": [
      "What year was Telemnar born?",
      "Who succeeded Telemnar as King of Gondor?",
      "What significant event occurred in TA 1634 that affected Telemnar's reign?",
      "What was the impact of the Great Plague on Gondor during Telemnar's rule?",
      "What happened to the White Tree during the time of Telemnar's reign?"
    ]
  },
  {
    "id": "b8b30a7b-d278-44fc-a5c4-e7c63de407b6",
    "questions": [
      "What was the name of Erendis's daughter?",
      "In which year were Erendis and Tar-Aldarion married?",
      "What concerns did Erendis have about Tar-Aldarion's profession?",
      "What significant event occurred in Erendis's life in SA 882?",
      "How did Erendis die?"
    ]
  },
  {
    "id": "b8fff131-3e56-4cfb-ba7c-65d877b3419b",
    "questions": [
      "What is the full name of the character?",
      "Who were Primula's parents?",
      "In what year did Primula Baggins die?",
      "What relationship did Primula have with Frodo?",
      "How did Primula and her husband meet their fate?"
    ]
  },
  {
    "id": "b9364706-3aba-4741-995d-f332cecf1e03",
    "questions": [
      "What year was Tuor born?",
      "Who was Tuor's spouse?",
      "What significant event did Tuor witness in Gondolin related to Morgoth?",
      "What was the name of Tuor and Idril's child?",
      "How did Tuor come to be accepted among the Eldar in Valinor?"
    ]
  },
  {
    "id": "b960a941-faf7-4662-b409-52b650d5c66b",
    "questions": [
      "What is the birth year of Hending Greenhand?",
      "Who are the siblings of Hending Greenhand?",
      "What is the race of Hending Greenhand?",
      "Who are Hending Greenhand's parents?",
      "What position does Hending Greenhand hold among his siblings?"
    ]
  },
  {
    "id": "b981c1fd-ee0b-42e5-9516-82d8b4fb2829",
    "questions": [
      "What is the race of Iorlas?",
      "In what year was Iorlas born?",
      "What is the gender of Iorlas?",
      "During which age did Iorlas die?",
      "What is the full name of the character described in the payload?"
    ]
  },
  {
    "id": "ba8b5e5b-b552-4ff0-8cb6-48e803472b1f",
    "questions": [
      "What is the name of Carl Cotton's oldest brother?",
      "Who did Carl Cotton's sister Rose marry?",
      "In which battle did Carl Cotton's family participate?",
      "Was Carl Cotton involved in the Battle of Bywater?",
      "How many siblings does Carl Cotton have?"
    ]
  },
  {
    "id": "ba94ae9c-2bf0-403d-80bc-7fecd5b4a4af",
    "questions": [
      "What year was Tolman Cotton Jr. born?",
      "Who is Tolman Cotton Jr.'s spouse?",
      "In which battle did Tolman Cotton Jr. play a significant role?",
      "How many siblings did Tolman Cotton Jr. have?",
      "What position did Tolman Cotton Jr. hold in Michel Delving?"
    ]
  },
  {
    "id": "baa382d2-30e6-4d3c-b7c4-7a663042d9de",
    "questions": [
      "What message was Borondir tasked with delivering to Eorl the Young?",
      "In which battle did Borondir die while defending Cirion?",
      "What was the fate of Borondir's companions during their mission?",
      "When did Borondir set out to deliver the message to Eorl?",
      "Where was Borondir laid to rest after his death?"
    ]
  },
  {
    "id": "bacf8f53-ed1a-4977-9eb4-df18bd36b7d9",
    "questions": [
      "What year was Bingo Baggins born?",
      "Who is Bingo Baggins' brother?",
      "What is the name of Bingo Baggins' spouse?",
      "How many children did Bingo Baggins have?",
      "In what year did Bingo Baggins die?"
    ]
  },
  {
    "id": "bd275e97-8731-429e-8e30-13173d2572e4",
    "questions": [
      "What is the birth year of Marroc Brandybuck?",
      "Who were Marroc Brandybuck's parents?",
      "What is the race of Marroc Brandybuck?",
      "How many older brothers did Marroc Brandybuck have?",
      "What is known about Marroc Brandybuck's descendants?"
    ]
  },
  {
    "id": "bd51bbba-8037-4b0e-bcbb-37669f65b09c",
    "questions": [
      "What year did Argonui become the Chieftain of the Dúnedain?",
      "Who raised Argonui in Rivendell?",
      "What significant event occurred in TA 2850 involving Gandalf and the White Council?",
      "In what year did Argonui die, and what event preceded his death?",
      "Who succeeded Argonui as Chieftain of the Dúnedain after his death?"
    ]
  },
  {
    "id": "bd99ad77-3432-4e7a-908a-e840c3f23ace",
    "questions": [
      "What is the full name of Saradoc Brandybuck's spouse?",
      "In which year did Saradoc Brandybuck attend Bilbo Baggins's birthday party?",
      "What is the relationship between Saradoc Brandybuck and Frodo Baggins?",
      "Who is Saradoc Brandybuck's father?",
      "What years did Saradoc Brandybuck live between in Shire Reckoning?"
    ]
  },
  {
    "id": "bdc70c55-3751-4f26-81d5-82cb45347287",
    "questions": [
      "What position did Robin Smallburrow hold in TA 3012?",
      "Why did Robin apply for the position of Shirriff?",
      "In which town did Robin serve as a Shirriff during Sharkey's Scouring of the Shire?",
      "What significant action did Robin Smallburrow take during the Hobbits' uprising?",
      "How is Robin Smallburrow connected to Samwise Gamgee's family?"
    ]
  },
  {
    "id": "bde128ed-9739-4379-a2d7-f91d0a41b865",
    "questions": [
      "What was the birth year of Háma?",
      "Who was Háma's father?",
      "What significant event led to the War between Rohan and Dunland?",
      "In which year did Háma die?",
      "Who succeeded the throne of Rohan after the death of Háma and his family?"
    ]
  },
  {
    "id": "bde7edf6-361a-47a0-8cab-50904d24a44b",
    "questions": [
      "What year was Narmacil I born?",
      "Who was Narmacil I's father?",
      "What significant action did Narmacil I take regarding the rule of Gondor?",
      "In what year did Narmacil I die?",
      "Who succeeded Narmacil I as king?"
    ]
  },
  {
    "id": "be90be71-a4fb-4b77-a2a5-b9879954a7a7",
    "questions": [
      "What position did Númendil hold in Númenor?",
      "Who was Númendil's son and what did he inherit?",
      "In what era was Númendil born?",
      "What was the relationship between Númendil and Tar-Palantir?",
      "In which location did Númendil serve as Lord?"
    ]
  },
  {
    "id": "bedf8b35-39ea-46cf-8d99-f73859244854",
    "questions": [
      "What year did Eärendur ascend the throne of Arnor?",
      "Who was Eärendur's father?",
      "What significant event occurred after Eärendur's death?",
      "Which of Eärendur's sons became the first King of Arthedain?",
      "In what year did Eärendur die?"
    ]
  },
  {
    "id": "bf0e5b81-9e5a-4d53-ae07-b6d02db35565",
    "questions": [
      "What is the full name of Imrazôr's spouse?",
      "In which year was Imrazôr born?",
      "What is the name of Imrazôr's son?",
      "During which Age did Imrazôr live?",
      "How is Imrazôr referred to in the legends of Dol Amroth?"
    ]
  },
  {
    "id": "bf809efe-5f31-4049-b74a-c1a86088a58d",
    "questions": [
      "What significant battles did Elfhelm participate in during the War of the Ring?",
      "Who were Elfhelm's notable companions during the Battles of the Fords of Isen?",
      "What role did Elfhelm play in the Battle of the Pelennor Fields?",
      "What position was Elfhelm granted after the War of the Ring?",
      "In which realm did Elfhelm serve as Marshal after the war?"
    ]
  },
  {
    "id": "bf9680cf-3d24-4592-8a4e-97602c91b3c1",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier of Wilimar Bolger?",
      "Is there any information available regarding the race or gender of Wilimar Bolger?",
      "What details are provided about Wilimar Bolger's biography?",
      "What realm is Wilimar Bolger associated with?"
    ]
  },
  {
    "id": "bfd55edc-a0e6-478c-8e49-3b9effa25878",
    "questions": [
      "What year was Valandur born?",
      "Who was Valandur's father?",
      "In what year did Valandur ascend the throne of Arnor?",
      "How long did Valandur rule as king?",
      "Who succeeded Valandur after his death?"
    ]
  },
  {
    "id": "bfd7d948-147d-401d-b43a-53f59e85410b",
    "questions": [
      "What was the name of Haldir's spouse?",
      "In which year was Haldir born?",
      "What title did Haldir hold in Brethil?",
      "Who did Haldir foster during their childhood years?",
      "What event led to Haldir's death?"
    ]
  },
  {
    "id": "c0695a0e-ed24-41d9-a30c-620da3663cd2",
    "questions": [
      "What race does Flói belong to?",
      "In what year was Flói born?",
      "What significant event did Flói participate in during TA 2989?",
      "How did Flói die?",
      "Where was Flói buried?"
    ]
  },
  {
    "id": "c069e273-e870-41fe-bb52-04f5803be30f",
    "questions": [
      "What year was Dinodas Brandybuck born?",
      "Who were the parents of Dinodas Brandybuck?",
      "How many siblings did Dinodas Brandybuck have?",
      "What is the name of the mother of Frodo Baggins in relation to Dinodas Brandybuck?",
      "In what year did Dinodas Brandybuck pass away?"
    ]
  },
  {
    "id": "c0a40c7f-360f-48f1-ac58-ba23b79be51e",
    "questions": [
      "What was Legolas's role during the Fall of Gondolin?",
      "Who did Legolas serve under as a scout?",
      "What name was Legolas given after moving to Tol Eressëa?",
      "What geographical area was Legolas knowledgeable about?",
      "What house was Legolas a member of?"
    ]
  },
  {
    "id": "c0a8fc72-fe0a-41e5-a4a0-cc2174903565",
    "questions": [
      "What year was Hallacar born?",
      "Who was Hallacar's spouse?",
      "What name did Hallacar use while living as a shepherd?",
      "In what year did Hallacar and Ancalimë get married?",
      "What was the name of Hallacar and Ancalimë's son?"
    ]
  },
  {
    "id": "c10ffe26-6086-4236-8a51-311a09915929",
    "questions": [
      "What year was Ar-Gimilzôr born?",
      "Who was Ar-Gimilzôr's spouse?",
      "What actions did Ar-Gimilzôr take against the Faithful during his reign?",
      "In what year did Ar-Gimilzôr forbid the use of Elvish languages in Númenor?",
      "Who was the daughter of Inzilbêth and what was her lineage?"
    ]
  },
  {
    "id": "c15aebbe-7281-4f9c-8b22-4dfb7b407630",
    "questions": [
      "What is the birth year of Jago Boffin?",
      "Who were Jago Boffin's parents?",
      "In what year did Jago Boffin die?",
      "How many children did Jago Boffin have?",
      "What is the race of Jago Boffin?"
    ]
  },
  {
    "id": "c17b392d-6d06-419f-afd9-3ee91e4f373b",
    "questions": [
      "What was the name of Balin's younger brother?",
      "In which year did Balin lead an expedition to reclaim Moria?",
      "Who did Balin accompany to visit Bilbo in the Shire seven years after the Quest for Erebor?",
      "What title did Balin claim when he ruled over Moria?",
      "How did Balin die and where was he buried?"
    ]
  },
  {
    "id": "c1b83ca5-baee-4c37-b12e-f6e9a14cfe02",
    "questions": [
      "What year was Paladin Took II born?",
      "Who was Paladin Took II's spouse?",
      "How many children did Paladin Took II have?",
      "In what year did Paladin Took II become Shire-thain?",
      "What significant event did Paladin Took II resist during his lifetime?"
    ]
  },
  {
    "id": "c20be228-21af-4e18-817b-735c9151d623",
    "questions": [
      "What significant battles did Celebrimbor fight in during the First Age?",
      "Who were the recipients of the three Elven rings forged by Celebrimbor?",
      "What was Celebrimbor's relationship to Curufin and Fëanor?",
      "How did Celebrimbor's actions impact the creation of the One Ring?",
      "In what year did Celebrimbor die, and what event was he involved in at that time?"
    ]
  },
  {
    "id": "c2912309-b591-4ad1-a212-66cda2ec205a",
    "questions": [
      "Who were Dora Baggins' parents?",
      "What was Dora Baggins' relation to Frodo?",
      "What gift did Bilbo give to Dora at his Farewell Birthday Party?",
      "How old was Dora Baggins when she died?",
      "Did Dora Baggins ever get married?"
    ]
  },
  {
    "id": "c31b827c-c095-4145-bad2-2b49b659d583",
    "questions": [
      "What was Dírhavel's race and gender?",
      "In which age was Dírhavel born and when did he die?",
      "What significant work did Dírhavel compile regarding Túrin's life?",
      "Who did Dírhavel learn about Túrin's life from, and what was their connection to Túrin?",
      "What event led to Dírhavel's death during the Third Kinslaying?"
    ]
  },
  {
    "id": "c375f5bc-fd6c-40e7-b0ee-363a5f811ae2",
    "questions": [
      "What was the name of Amroth's father and how did he die?",
      "In what year did Amroth die?",
      "Who was Amroth's spouse and what condition did she set for their marriage?",
      "What significant event caused Amroth and Nimrodel to separate during their journey?",
      "What legend is associated with Amroth and Nimrodel after their disappearance?"
    ]
  },
  {
    "id": "c4a4ac10-045f-4768-98e3-00a31b26c4b2",
    "questions": [
      "Who was Amandil's father?",
      "What relationship did Amandil have with Pharazôn?",
      "What did Amandil urge his son Elendil to do regarding the impending war?",
      "In what year did Amandil set sail for Valinor?",
      "What was Amandil's fate after he departed into the West?"
    ]
  },
  {
    "id": "c4e3db54-bb11-4ea7-bb12-f7ff276a852b",
    "questions": [
      "What role did Duinhir play during the War of the Ring?",
      "Who were Duinhir's sons?",
      "What notable physical characteristics are mentioned about Duinhir?",
      "What was the fate of Duinhir's sons during the Battle of the Pelennor Fields?",
      "What was the reason for most of Duinhir's men remaining in the south during the battle?"
    ]
  },
  {
    "id": "c57f126a-85cc-496c-a350-a6e781c300e9",
    "questions": [
      "What role did Glirhuin have among the Haladin?",
      "In what year did Glirhuin compose a song about the Stone of the Hapless?",
      "What significant event occurred after Húrin's stay among the Haladin in the year 501?",
      "What did Glirhuin prophesy regarding the Stone of the Hapless?",
      "What is known about Glirhuin's fate?"
    ]
  },
  {
    "id": "c5befd51-627d-4638-8e1d-57914eea630d",
    "questions": [
      "What is the birth year of Halfred Gamgee?",
      "Who are the siblings of Halfred Gamgee?",
      "In which region did Halfred Gamgee move later in his life?",
      "What is the gender of Halfred Gamgee?",
      "When did Halfred Gamgee die?"
    ]
  },
  {
    "id": "c5fb9295-96ab-4835-a611-16ae3415e833",
    "questions": [
      "What is the full name of Rorimac Brandybuck's spouse?",
      "How many children did Rorimac Brandybuck have?",
      "Who are the children of Rorimac Brandybuck?",
      "What notable event did Rorimac Brandybuck attend that involved Bilbo Baggins?",
      "What years did Rorimac Brandybuck live between in Shire Reckoning?"
    ]
  },
  {
    "id": "c5fc375b-5a63-4911-8ee0-2f9d62837031",
    "questions": [
      "What year was Milo Burrows born?",
      "Who is Milo Burrows' spouse?",
      "How many children did Milo and Peony have?",
      "Which family did Milo marry into?",
      "What was Milo known for regarding his correspondence?"
    ]
  },
  {
    "id": "c6225ff3-655e-4ff4-aea7-ea175e60c39a",
    "questions": [
      "What significant construction project did Isengrim Took II begin in the Green-Hill Country?",
      "In what year did Isengrim Took II become Shire-thain?",
      "Who succeeded Isengrim Took II as Thain after his death?",
      "What notable event regarding the Shire Reckoning occurred during Isengrim Took II's time in office?",
      "What is the birth year of Isengrim Took II?"
    ]
  },
  {
    "id": "c7078c68-aa1e-4031-afc8-59260bef8aff",
    "questions": [
      "What year did Tar-Atanamir succeed his father as king?",
      "Who was Tar-Atanamir's spouse?",
      "What significant action did Tar-Atanamir take regarding the throne before his death?",
      "Which two ancestors did Tar-Atanamir question regarding the nature of eternal life?",
      "How long did Tar-Atanamir rule Númenor?"
    ]
  },
  {
    "id": "c747020f-a835-4e12-b715-0ad3c4206634",
    "questions": [
      "What was the name of Eorl the Young's horse, and what significance did it have?",
      "In which year did Eorl the Young succeed his father as the leader of the Éothéod?",
      "What major event prompted Eorl to ride south to aid Gondor in TA 2510?",
      "How long did Eorl the Young reign as King of the Mark before his death?",
      "What oath did Eorl the Young swear to Cirion, and how did it impact the relationship between Rohan and Gondor?"
    ]
  },
  {
    "id": "c7cd6551-b701-461e-a58d-f2126be62c10",
    "questions": [
      "What year was Fengel born?",
      "Who were Fengel's elder brothers and how did they die?",
      "In what year did Fengel become King of Rohan?",
      "What characterized Fengel's rule as King?",
      "What was the relationship between Fengel and his son Thengel?"
    ]
  },
  {
    "id": "c803bb08-fbe1-4de5-99dd-14220fe175cb",
    "questions": [
      "What significant item did Azaghâl give to Maedhros, and who originally made it?",
      "In which battle was Azaghâl slain, and by whom?",
      "What was the relationship between Azaghâl and the Dwarf-Road in East Beleriand?",
      "What did Azaghâl's kin do after his death on the battlefield?",
      "What possible title is Azaghâl associated with in relation to the Broadbeams?"
    ]
  },
  {
    "id": "c818043c-52c9-4660-bc22-e8f4db852455",
    "questions": [
      "What year was Gróin born?",
      "Who was Gróin's older brother?",
      "What are the names of Gróin's sons?",
      "In which significant events was Gróin likely present?",
      "What is the relationship between Glóin and Gimli?"
    ]
  },
  {
    "id": "c8b13b64-669f-4701-ac1b-8584864d11a2",
    "questions": [
      "What is the birth year of Hildigrim Took?",
      "Who was Hildigrim Took's spouse?",
      "How many siblings did Hildigrim Took have?",
      "At what age did Hildigrim Took's son Adalgrim born?",
      "In what year did Hildigrim Took die?"
    ]
  },
  {
    "id": "c90efcb1-c26a-42e9-be54-ca33974cf5f4",
    "questions": [
      "What is the race of Mithrellas?",
      "What is the gender of Mithrellas?",
      "Who is the spouse of Mithrellas?",
      "What is the full name of Mithrellas?",
      "Is Mithrellas a character from a specific realm or story?"
    ]
  },
  {
    "id": "c93d5a99-e778-4b39-aff6-f7626611d02a",
    "questions": [
      "What is the birth year of Farin?",
      "Who are the children of Farin?",
      "In which mountain did Farin live?",
      "What significant event forced Farin to flee to Dunland?",
      "Who is the great-grandson of Farin?"
    ]
  },
  {
    "id": "ca13c6c5-c159-4053-9625-217e4ee37cb1",
    "questions": [
      "What is the birth year of Odovacar Bolger?",
      "Who is Odovacar Bolger's spouse?",
      "How many children did Odovacar Bolger have?",
      "What was the cause of Odovacar Bolger becoming the head of the Bolger family?",
      "In which year did Odovacar Bolger pass away?"
    ]
  },
  {
    "id": "ca57315e-de1b-480f-8a8c-eeca16ec8168",
    "questions": [
      "What was the race of Eärendur?",
      "During which age was Eärendur born?",
      "Who was the king during Eärendur's reign as lord?",
      "What was the relationship between Eärendur and Tar-Palantir?",
      "Who succeeded Eärendur as Lord of Andúnië?"
    ]
  },
  {
    "id": "cb3177dd-0bfb-481c-9aac-a54292055453",
    "questions": [
      "What is the birth year of Beldir?",
      "Who is Beldir's father?",
      "What is the name of Beldir's son?",
      "What race does Beldir belong to?",
      "Who is Beldir's spouse?"
    ]
  },
  {
    "id": "cb72ff07-9c71-4eec-9a19-bf49bff2af06",
    "questions": [
      "What musical instrument was Nori skilled at playing?",
      "In which year was Nori born?",
      "Who did Nori travel with during the Quest for Erebor?",
      "What significant battle did Nori survive after the quest?",
      "Where did Nori live after the events of the Quest for Erebor?"
    ]
  },
  {
    "id": "cbc4df0c-e284-49a2-bf32-f58974c7dd66",
    "questions": [
      "What is the full name of Hamfast Gamgee's spouse?",
      "In what year was Hamfast Gamgee born?",
      "How many children did Hamfast Gamgee have?",
      "What was Hamfast Gamgee's profession on the Baggins property?",
      "What significant event did Hamfast encounter on the evening that Frodo Baggins left Bag End?"
    ]
  },
  {
    "id": "cbc7c4c0-53ea-40d9-b382-48cec248b2a6",
    "questions": [
      "What is the race of Nessanië?",
      "Who was Nessanië's father?",
      "In what year was Nessanië born?",
      "What is known about Nessanië's brother's marriage?",
      "Is there any information on whether Nessanië lived in Hyarastorni or Armenelos?"
    ]
  },
  {
    "id": "cc1cadcc-7d06-400d-b3e8-9dd5d6d8cf90",
    "questions": [
      "What year was Isumbras Took I born?",
      "Who did Isumbras Took I succeed as Shire-thain?",
      "What is known about Isumbras Took I's marital status and children?",
      "Who succeeded Isumbras Took I as Shire-thain?",
      "In what year did Isumbras Took I die?"
    ]
  },
  {
    "id": "cc238b39-a41f-4643-8cd6-08c89ea40a3d",
    "questions": [
      "What is the full name of Ponto Baggins' spouse?",
      "In what year was Ponto Baggins born?",
      "How many siblings did Ponto Baggins have?",
      "What were the names of Ponto Baggins' children?",
      "In which year did Ponto Baggins pass away?"
    ]
  },
  {
    "id": "cc85518b-a451-4dec-90fa-48f86f15b35a",
    "questions": [
      "Who was Gundor's father?",
      "In which battle did Gundor and his father die?",
      "What race does Gundor belong to?",
      "What year did Gundor die?",
      "How is Gundor related to the House of Hador?"
    ]
  },
  {
    "id": "ccf6f84b-51ab-4ed0-984b-91406c298fc9",
    "questions": [
      "What year was Denethor I born?",
      "Who was Denethor I's spouse?",
      "In what year did Denethor I become the tenth Ruling Steward of Gondor?",
      "What significant event marked the end of the Watchful Peace during Denethor I's rule?",
      "Who succeeded Denethor I after his death in TA 2477?"
    ]
  },
  {
    "id": "cd9a3b33-425a-4211-80ca-67d85a7fdd20",
    "questions": [
      "What year was Folca born?",
      "How did Folca become King of Rohan?",
      "What was Folca's oath regarding Orcs?",
      "In what year did Folca die and what was the cause of his death?",
      "Who succeeded Folca as King of Rohan?"
    ]
  },
  {
    "id": "cdd34fc2-99b7-427a-8e89-85a2a9f800ef",
    "questions": [
      "What year was Helm Hammerhand born?",
      "Who was Helm Hammerhand's father?",
      "What significant event occurred in TA 2754 involving Freca and Helm Hammerhand?",
      "What was the outcome of the battle at the Fords of Isen for Helm Hammerhand?",
      "How did Helm Hammerhand earn the nickname 'Hammerhand'?"
    ]
  },
  {
    "id": "ceaaf682-0b37-464d-9b8a-696b275e4fd3",
    "questions": [
      "What is the full name of Peregrin Took's spouse?",
      "In which year was Peregrin Took born?",
      "Who were Peregrin Took's parents?",
      "What significant event occurred during the Skirmish at Amon Hen involving Peregrin Took?",
      "What position did Peregrin Took hold in the Shire before renouncing it?"
    ]
  },
  {
    "id": "cec2c1e9-d69f-4271-9b19-f1b3b86c2f68",
    "questions": [
      "What race is Radhruin?",
      "Who did Radhruin remain with after the Dagor Bragollach?",
      "In what year did Radhruin die?",
      "What event led to Radhruin and his companions being betrayed?",
      "Where were Radhruin and his group killed?"
    ]
  },
  {
    "id": "ced38e1e-57c8-45f6-a31d-4737d2ac6167",
    "questions": [
      "What year was Thorin I born?",
      "Who succeeded Thorin I as king?",
      "What significant event did Thorin I undertake in TA 2210?",
      "Who was Thorin I's grandfather?",
      "What is the relationship between Thorin I and Thorin Oakenshield?"
    ]
  },
  {
    "id": "cf93dc62-52ab-47fe-acb9-be669379d110",
    "questions": [
      "What year did Eärwen marry Finarfin?",
      "Who are the children of Eärwen?",
      "What significant event did Eärwen's husband, Finarfin, repent for?",
      "In which realms was Eärwen possibly born?",
      "Did Eärwen accompany her husband into exile during the Revolt of the Ñoldor?"
    ]
  },
  {
    "id": "cfa34095-8530-49f4-979f-2bfd5d74329e",
    "questions": [
      "What year did Argeleb I succeed his father Malvegil?",
      "What was the royal prefix that Argeleb I took to signify his claim to the Kingship of Arnor?",
      "In which battle was Argeleb I killed?",
      "Who succeeded Argeleb I as king?",
      "How old was Argeleb I at the time of his death?"
    ]
  },
  {
    "id": "cffc31f8-d0d8-40e3-abbc-6d1faa78be4c",
    "questions": [
      "What significant action did Finrod take during the Dagor Bragollach that involved Barahir of the House of Bëor?",
      "What was the name of the city that Finrod founded in the Pass of Sirion?",
      "Who was Finrod's close friend from the House of Bëor, and what was the nature of their conversations?",
      "What was the outcome of Finrod's battle with Sauron at Tol-in-Gaurhoth?",
      "Why did Finrod never marry Amarië despite their betrothal?"
    ]
  },
  {
    "id": "d0387065-2cf4-413f-9e6b-04504685eb1c",
    "questions": [
      "What was Saruman's original name as a Maia before he became known as Saruman?",
      "In which realm did Saruman establish his stronghold?",
      "What significant event occurred on 3 November 3019 in relation to Saruman?",
      "How did Saruman's relationship with Gandalf change over time, particularly in regard to the One Ring?",
      "What was Saruman's fate after his defeat in the Shire?"
    ]
  },
  {
    "id": "d069ebc5-08bb-4956-bda2-13bf88e18843",
    "questions": [
      "What year was Lobelia Sackville-Baggins born?",
      "Who was Lobelia Sackville-Baggins' spouse?",
      "What was Lobelia's relationship to Bilbo Baggins?",
      "How did Lobelia Sackville-Baggins acquire Bag End?",
      "What action did Lobelia take during the War of the Ring?"
    ]
  },
  {
    "id": "d0af3153-6110-4248-a3fd-9e8a108bf86d",
    "questions": [
      "What race is Sangahyando?",
      "In which age was Sangahyando born?",
      "What significant event did Sangahyando participate in during TA 1634?",
      "Who was the king that Sangahyando's forces attacked?",
      "What is known about Sangahyando's ultimate fate?"
    ]
  },
  {
    "id": "d0cfa968-8e66-4e89-af87-971442704416",
    "questions": [
      "What is the name of Finarfin's spouse?",
      "In which realm does Finarfin currently reside?",
      "Who are Finarfin's elder siblings?",
      "What significant event did Finarfin witness after the death of Finwë?",
      "How many children did Finarfin and Eärwen have, and can you name one of them?"
    ]
  },
  {
    "id": "d0e2236e-dfbd-4613-bc37-e3d20e0e98e9",
    "questions": [
      "What is the name of Angrod's spouse?",
      "In which year did Angrod die?",
      "Who are Angrod's siblings?",
      "What significant event led to Angrod's death?",
      "What was Angrod's relationship to Finrod Felagund?"
    ]
  },
  {
    "id": "d0ef1748-89e5-4eff-ac5a-07124dc847f0",
    "questions": [
      "What year was Goldwine born?",
      "Who was Goldwine's father?",
      "In what year did Goldwine ascend to the throne of Rohan?",
      "How long did Goldwine rule as king?",
      "Who succeeded Goldwine after his death?"
    ]
  },
  {
    "id": "d17a474b-af4e-4291-b39a-60b0fa8064a1",
    "questions": [
      "What is the birth year of Bereg?",
      "Who is Bereg's grandfather?",
      "In which year did Bereg lead a thousand men away from Estolad?",
      "What was Bereg's dissatisfaction that prompted his departure from Estolad?",
      "Which group of people might be descended from Bereg's lineage?"
    ]
  },
  {
    "id": "d2095fd0-f63e-423b-8b77-5e543fda3503",
    "questions": [
      "What year was Gundahar Bolger born?",
      "Who were Gundahar Bolger's parents?",
      "What are the names of Gundahar Bolger's siblings?",
      "Who did Gundahar Bolger marry?",
      "How many children did Gundahar Bolger have?"
    ]
  },
  {
    "id": "d24d8a94-ef3f-4099-a153-44d027d9eb82",
    "questions": [
      "What is the race of Alphros?",
      "Who was Alphros's father?",
      "In what year was Alphros born?",
      "What title did Alphros hold after succeeding his father?",
      "In which year did Alphros die?"
    ]
  },
  {
    "id": "d2b7fcb2-3cbf-4ef8-9a18-cd2fb77ca3e3",
    "questions": [
      "What is the race of Bob?",
      "In which age was Bob born?",
      "Who was Bob's counterpart at the stables?",
      "What establishment did Bob work near?",
      "Who hired Bob and Nob for their respective positions?"
    ]
  },
  {
    "id": "d2bf1868-f7cd-473b-ba78-507d50160140",
    "questions": [
      "What is the birth year of Ferumbras Took II?",
      "Who was Ferumbras Took II's father?",
      "In which battle was Ferumbras Took II's brother, Bandobras, recognized?",
      "Who succeeded Ferumbras Took II as Shire-thain?",
      "What is the name of Ferumbras Took II's spouse?"
    ]
  },
  {
    "id": "d2caa0c2-1a9c-4532-af93-f210aa24eb18",
    "questions": [
      "What significant battle did Dwalin fight in at the age of 27?",
      "In what year was Dwalin born?",
      "Who were Dwalin's parents and brother?",
      "What did Dwalin do when he first arrived at Bag End for the unexpected party?",
      "What was Dwalin's fate after the Battle of Five Armies?"
    ]
  },
  {
    "id": "d30f0c5b-f2c4-48f4-a449-3ca0e8141c69",
    "questions": [
      "What is the birth year of Sadoc Brandybuck?",
      "Who are Sadoc Brandybuck's parents?",
      "How many children did Sadoc Brandybuck have?",
      "What are the names of Sadoc Brandybuck's brothers?",
      "What is the name of Sadoc Brandybuck's daughter?"
    ]
  },
  {
    "id": "d3155c10-bd2a-42c4-b6f6-86bb7f51c6e8",
    "questions": [
      "What year was Melilot Brandybuck born?",
      "Who are Melilot Brandybuck's siblings?",
      "What event did Melilot participate in on September 22, 3001?",
      "Who was Melilot Brandybuck's boyfriend during Bilbo's birthday party?",
      "What is Melilot Brandybuck's relationship to Meriadoc Brandybuck?"
    ]
  },
  {
    "id": "d33820c1-1f0f-476d-9fa5-d30554371912",
    "questions": [
      "What year was Eärnil I born?",
      "Who was Eärnil I's spouse?",
      "In what year did Eärnil I succeed to the throne of Gondor?",
      "What significant action did Eärnil I take in TA 933?",
      "Who succeeded Eärnil I after his death?"
    ]
  },
  {
    "id": "d3551b88-338f-4464-b0e4-6b8f63f39a43",
    "questions": [
      "What significant event did Guthláf participate in during the War of the Ring?",
      "On what date did Guthláf die?",
      "What happened to the banner that Guthláf held when he fell?",
      "Who took the horn from Guthláf to sound the charge?",
      "In which song is Guthláf mentioned?"
    ]
  },
  {
    "id": "d37c0320-c5ba-4d55-abd5-70798b1cb039",
    "questions": [
      "What significant act did Fingon perform to help Maedhros during the events at Thangorodrim?",
      "In which realm did Fingon serve as High King after the death of Fingolfin?",
      "What was Fingon's role during the Siege of Angband?",
      "What ultimately led to Fingon's defeat in the Nírnaeth Arnoediad?",
      "Where was Fingon born, and what is the likely location of his birthplace?"
    ]
  },
  {
    "id": "d4d9cf31-c232-4249-96ba-fa3934937d38",
    "questions": [
      "What was the race of Inzilbêth?",
      "Who was Inzilbêth's spouse?",
      "Which King of Númenor was Inzilbêth a descendant of?",
      "What beliefs did Inzilbêth secretly adhere to?",
      "What was the relationship between Inzilbêth's sons, Tar-Palantir and Gimilkhâd?"
    ]
  },
  {
    "id": "d536119f-caa0-4f35-981f-07142dd40f99",
    "questions": [
      "What was the name of Halmir's father?",
      "Who were the children of Halmir?",
      "What significant action did Halmir take against the Orc-Host?",
      "Which Elven lord did Halmir seek aid from?",
      "What happened to the leadership of the House of Haleth after Halmir's death?"
    ]
  },
  {
    "id": "d5f25a6c-f797-4548-9505-efb94aa90462",
    "questions": [
      "What race does Dervorin belong to?",
      "In which significant historical event did Dervorin participate?",
      "How many men did Dervorin march to Minas Tirith?",
      "How did Dervorin arrive at Minas Tirith?",
      "Is there any mention of Dervorin's fate after the battles he fought in?"
    ]
  },
  {
    "id": "d670df94-38c7-4b99-b114-1b507d5cf31e",
    "questions": [
      "What was Aerin's relationship to Húrin Thalion?",
      "Who was Aerin's spouse and what was the nature of their marriage?",
      "In what year did Aerin die?",
      "How did Aerin assist Morwen and Sador?",
      "What event led to the burning of Brodda's Hall?"
    ]
  },
  {
    "id": "d6e6d4c4-3c46-48ef-a6d3-bcc87e430310",
    "questions": [
      "What year did Arveleg II ascend the throne?",
      "Who succeeded Arveleg II after his death?",
      "In which realm did Arveleg II rule?",
      "What was the duration of Arveleg II's reign?",
      "What conflict was ongoing during Arveleg II's rule?"
    ]
  },
  {
    "id": "d71152cb-2e8b-43aa-94ec-9b88c7624e73",
    "questions": [
      "What was the name of Elendil's father and what position did he hold?",
      "In which year did Elendil die?",
      "What significant cities did Elendil's sons Isildur and Anárion found in Gondor?",
      "What was the oath that Elendil proclaimed upon arriving in Middle-earth?",
      "Who killed Sauron during the Last Alliance and what happened to Elendil during that battle?"
    ]
  },
  {
    "id": "d78aed13-fe64-4734-be1f-bd54a4987a13",
    "questions": [
      "What year was Pippin Gamgee born?",
      "Who are Pippin Gamgee's parents?",
      "How many siblings does Pippin Gamgee have?",
      "Who is Pippin Gamgee's namesake?",
      "What relationship does Pippin Gamgee have with Goldilocks?"
    ]
  },
  {
    "id": "d8513fa1-deaf-4762-84a6-58ec0eff0b07",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier for Théodwyn?",
      "Is there any information about Théodwyn's race or gender?",
      "What notable details are provided in Théodwyn's biography?",
      "What realm does Théodwyn belong to?"
    ]
  },
  {
    "id": "d9a8c254-8d4e-4147-9368-7509f27b18da",
    "questions": [
      "What significant event occurred during Araphor's youth that impacted his reign?",
      "Who was Araphor's father and what happened to him during the invasion of Angmar?",
      "In which realm did Araphor rule and for how long?",
      "What was the name of Araphor's successor?",
      "Which groups of people were affected by the wars during Araphor's reign?"
    ]
  },
  {
    "id": "d9ea0bcd-de10-4932-a701-6226ba7e6822",
    "questions": [
      "What is the race of Tatië?",
      "Who is Tatië's spouse?",
      "In which era was Tatië awakened?",
      "What is known about Tatië's biography?",
      "Who was the second Elf to be awakened?"
    ]
  },
  {
    "id": "db41089d-b888-4dae-966d-05f4b14ee049",
    "questions": [
      "What year was Grór born?",
      "Who were Grór's older brothers?",
      "In what year did Grór establish himself as Lord of the Iron Hills?",
      "Who succeeded Grór as Lord of the Iron Hills?",
      "What significant battle occurred shortly before Grór's death?"
    ]
  },
  {
    "id": "db81b6d5-0369-4e6b-8b6e-2c1f0b0ec188",
    "questions": [
      "What significant event did Erestor attend on October 25, 3018?",
      "What suggestion did Erestor make regarding Tom Bombadil during the Council of Elrond?",
      "Which wedding did Erestor attend after the War of the Ring?",
      "On what date did Erestor arrive in Minas Tirith for Arwen's wedding?",
      "Is it known whether Erestor left Middle-earth with Elrond in September of 3021?"
    ]
  },
  {
    "id": "db985912-f496-4939-8823-2c95cd7f0cea",
    "questions": [
      "What year was Sapphira Boffin born?",
      "Who is Sapphira Boffin's spouse?",
      "How many children did Sapphira Boffin have?",
      "What are the names of Sapphira Boffin's children?",
      "What is the race of Sapphira Boffin?"
    ]
  },
  {
    "id": "dc41a29a-e7b4-4729-b470-492adc119a50",
    "questions": [
      "What is the birth year of Isilmë?",
      "Who are Isilmë's siblings?",
      "Which position did Isilmë's younger brother hold?",
      "What race does Isilmë belong to?",
      "What is the gender of Isilmë?"
    ]
  },
  {
    "id": "dccf8d3e-dfc3-4f68-be60-1757cc45d664",
    "questions": [
      "What is the name of Boron's spouse?",
      "Who is Boron's father?",
      "What position did Boron hold in the House of Bëor?",
      "Name one of Boron's children.",
      "In which age did Boron live and die?"
    ]
  },
  {
    "id": "dd426d6f-6155-44d6-b4c9-e1c02fdd34d3",
    "questions": [
      "What was the heritage of Wulf's father, Freca?",
      "In what year did Wulf die?",
      "Who did Wulf's father attempt to arrange a marriage with?",
      "What significant event did Wulf lead in the winter of TA 2758?",
      "Who killed Wulf and where did this event take place?"
    ]
  },
  {
    "id": "dd7fd076-a99b-45cd-a9a4-cee7e3af1ad8",
    "questions": [
      "What is the birth year of Daisy (Baggins) Boffin?",
      "Who is Daisy (Baggins) Boffin's spouse?",
      "How is Daisy (Baggins) Boffin related to Frodo Baggins?",
      "What is the name of Daisy (Baggins) Boffin's child?",
      "Who are Daisy (Baggins) Boffin's parents?"
    ]
  },
  {
    "id": "ddd40000-d676-4021-9bc9-bf993dfc55e0",
    "questions": [
      "What is the name of Idril's spouse?",
      "In which year was Idril born?",
      "Who was Idril's father?",
      "What significant action did Idril take to prepare for the danger facing Gondolin?",
      "What is the name of Idril and Tuor's son?"
    ]
  },
  {
    "id": "de68210f-1b60-40ee-9b51-18daaed855c7",
    "questions": [
      "What significant role did Bergil play during the Siege of Minas Tirith?",
      "How old was Bergil when the War of the Ring began?",
      "Who did Bergil guide throughout Minas Tirith?",
      "What was Bergil's relationship with Faramir during the war?",
      "What is known about Bergil's family, specifically his brother?"
    ]
  },
  {
    "id": "deea6034-1ef0-4619-b416-317069377164",
    "questions": [
      "What year was Huor born?",
      "Who was Huor's spouse?",
      "In which battle did Huor meet Turgon again?",
      "What was the cause of Huor's death?",
      "Who is Huor remembered as the grandfather of?"
    ]
  },
  {
    "id": "df26f881-d0b4-433e-8945-06b4ddf8a6dc",
    "questions": [
      "What significant event in Thrór's life occurred in TA 2589 that led to him inheriting the kingship?",
      "Which two realms did Thrór lead his people to after the destruction of Erebor?",
      "What was the name of the dragon that attacked and destroyed Erebor under Thrór's leadership?",
      "Who accompanied Thrór on his final journey to Moria, and what warning did he give?",
      "What was the outcome of the War of the Dwarves and Orcs that was sparked by Thrór's death?"
    ]
  },
  {
    "id": "df9453f0-38a9-461b-93bb-c1528551ac57",
    "questions": [
      "What was Gamling's role during the defense of Helm's Dike?",
      "Which language did Gamling understand?",
      "On what date did King Théoden arrive at the Hornburg with reinforcements?",
      "Who did Gamling charge with during the battle to block the opening under the Deeping Wall?",
      "What event marked the end of the Battle of the Hornburg for Gamling and his men?"
    ]
  },
  {
    "id": "e0262eeb-ab85-4497-90a8-6e905ad0f1c5",
    "questions": [
      "What year was Bell (Goodchild) Gamgee born?",
      "Who was Bell (Goodchild) Gamgee's husband?",
      "How many children did Bell (Goodchild) Gamgee have?",
      "Which of Bell's children became famous for helping Frodo?",
      "What is the full name of Bell (Goodchild) Gamgee's son who is well-known in hobbit history?"
    ]
  },
  {
    "id": "e096854e-fa7b-4312-b49b-a2731db25658",
    "questions": [
      "What year was Éofor born?",
      "Who is the spouse of Éofor?",
      "Which fortress did Éofor live in with his family?",
      "Who are the notable descendants of Éofor mentioned in the biography?",
      "What significant lineage did Éofor found?"
    ]
  },
  {
    "id": "e1023b54-c4ec-46f3-a0ee-307be8f1794c",
    "questions": [
      "What is the race of Írimë?",
      "Who are Írimë's parents?",
      "During which period was Írimë born?",
      "With whom did Írimë join the Rebellion of the Ñoldor?",
      "What is known about Írimë's fate?"
    ]
  },
  {
    "id": "e1639cbe-be74-49e0-9f03-57c2b1f4f562",
    "questions": [
      "What year was Olo Proudfoot born?",
      "Who were Olo Proudfoot's parents?",
      "What is the name of Olo Proudfoot's son?",
      "What significant event did Olo and his son attend?",
      "In what year did Olo Proudfoot die?"
    ]
  },
  {
    "id": "e1c79eaa-3879-486d-822e-6fd2d295bbe8",
    "questions": [
      "What significant historical event did Arvegil witness during his father's reign?",
      "How long did Arvegil rule Arthedain?",
      "What was the age of Arvegil at the time of his death?",
      "Who succeeded Arvegil as king of Arthedain?",
      "What notable characteristic distinguishes Arvegil's lifespan compared to his ancestors?"
    ]
  },
  {
    "id": "e1e02320-3673-46a3-94a7-ba3d2334a502",
    "questions": [
      "What race is Ragnor?",
      "In which age was Ragnor born?",
      "Who did Ragnor remain with after the Dagor Bragollach?",
      "How did Ragnor and his companions meet their end?",
      "What significant event led to Ragnor becoming an outlaw?"
    ]
  },
  {
    "id": "e1ea94c9-6fd0-4217-8b5c-8910d99fccac",
    "questions": [
      "What was the name of Bregor's spouse?",
      "Who were Bregor's siblings?",
      "How many children did Bregor have and can you name them?",
      "What significant event is Bregor most likely associated with regarding his death?",
      "What became of the Bow of Bregor after the First Age?"
    ]
  },
  {
    "id": "e1fe09cc-fa1f-449d-969f-4d70cf2704d9",
    "questions": [
      "What family did Mimosa Baggins belong to before her marriage?",
      "Who did Mimosa Baggins marry?",
      "How many children did Mimosa Baggins have?",
      "What are the names of Mimosa Baggins' children?",
      "In what year was Mimosa Baggins' daughter Rosa born?"
    ]
  },
  {
    "id": "e2af6b3a-5cdf-4407-8052-b50bf034b6e7",
    "questions": [
      "Who was Sagroth under the command of?",
      "Which race does Sagroth belong to?",
      "During which event did Sagroth encounter Húrin?",
      "What is the gender of Sagroth?",
      "What location did Sagroth meet Húrin?"
    ]
  },
  {
    "id": "e41702d7-e394-40fb-84a3-f21c1da20607",
    "questions": [
      "What was Gríma Wormtongue's birth year?",
      "Who was Gríma Wormtongue's father?",
      "What significant event occurred on September 20, 3018, involving Gríma Wormtongue?",
      "What choice did Théoden give Gríma after revealing his betrayal?",
      "How did Gríma Wormtongue die?"
    ]
  },
  {
    "id": "e45afcbf-5ed5-4d1d-99f0-9b7f159b8b33",
    "questions": [
      "What race does Herefara belong to?",
      "When was Herefara born?",
      "What is the date of Herefara's death?",
      "Who was Herefara's spouse?",
      "What color is Herefara's hair?"
    ]
  },
  {
    "id": "e47903b9-162b-41cc-9285-8edb011a32fe",
    "questions": [
      "What is the birth year of Fortinbras Took I?",
      "Who was Fortinbras Took I's father?",
      "In what year did Fortinbras Took I become Shire-thain?",
      "Who succeeded Fortinbras Took I as Shire-thain?",
      "What is the race of Fortinbras Took I?"
    ]
  },
  {
    "id": "e47d0ac0-18fe-4ab2-8c4a-fd786fa9ef6a",
    "questions": [
      "Who was Gimilzagar's father?",
      "In which year was Gimilzagar born?",
      "What is Gimilzagar's relation to Ar-Adûnakhôr?",
      "Which royal name tradition did Ar-Adûnakhôr break?",
      "Who is Inzilbeth in relation to Gimilzagar?"
    ]
  },
  {
    "id": "e5a65d0e-2eac-4d0e-847b-b1ba5d81b967",
    "questions": [
      "What is the race of Herubrand?",
      "When was Herubrand born?",
      "What is the gender of Herubrand?",
      "On what date did Herubrand die?",
      "Who was Herubrand's spouse?"
    ]
  },
  {
    "id": "e5b4c68a-ebf2-43a0-894f-1109afef8efd",
    "questions": [
      "What year was Lily Baggins Goodbody born?",
      "Who were Lily's parents?",
      "What was the name of Lily's spouse?",
      "How many siblings did Lily have?",
      "In what year did Lily Baggins Goodbody die?"
    ]
  },
  {
    "id": "e61f17d2-cb9f-448d-a9e2-e158e834a873",
    "questions": [
      "What is the birth year of Primrose Gardner?",
      "Who are the parents of Primrose Gardner?",
      "How many siblings does Primrose Gardner have?",
      "Which child is Primrose Gardner in her family order?",
      "Who is the first child of Samwise Gamgee to not have a namesake?"
    ]
  },
  {
    "id": "e752d6da-e74f-4b40-8593-5af50e3f1f73",
    "questions": [
      "What year was Eärnil II born?",
      "Who was Eärnil II's predecessor as king?",
      "In which battle did Eärnil II achieve a great victory over the Haradrim?",
      "What was the relationship between Eärnil II and Arvedui?",
      "What significant change occurred to Minas Ithil during Eärnil II's reign?"
    ]
  },
  {
    "id": "e7875010-b152-4847-b086-7925fceb5c29",
    "questions": [
      "What race does Gelmir belong to?",
      "Who is Gelmir's brother?",
      "In which battle was Gelmir executed?",
      "How long was Gelmir enslaved in Angband?",
      "What cruel tactic did Morgoth use involving Gelmir during the conflict?"
    ]
  },
  {
    "id": "e7b9c232-6831-4f1c-8a46-44ab2a7a5129",
    "questions": [
      "What year did Cemendur succeed his father to the throne of Gondor?",
      "How long did Cemundur rule Gondor?",
      "Who succeeded Cemendur after his death?",
      "What was notable about Cemundur's reign as King of Gondor?",
      "In what year did Cemundur die?"
    ]
  },
  {
    "id": "e7bc4189-7e30-4667-92bc-abb456c654c2",
    "questions": [
      "What is the full name of the character Bandobras Took's spouse?",
      "In which year did Bandobras Took lead the Hobbits at the Battle of the Green Fields?",
      "What notable physical characteristic distinguished Bandobras Took among Hobbits?",
      "Who was Bandobras Took's famous ancestor mentioned in the biography?",
      "What significant event did Bandobras Took achieve during the battle against the goblins?"
    ]
  },
  {
    "id": "e7c96a81-1c46-4d0b-97ce-9f81e2580b4d",
    "questions": [
      "What year was Belecthor II born?",
      "Who succeeded Belecthor II as the Ruling Steward?",
      "What significant event occurred when Belecthor II died?",
      "How long did Belecthor II rule as the Ruling Steward?",
      "What was Belecthor II's relation to Beregond?"
    ]
  },
  {
    "id": "e80c6db5-21bd-4dd6-9109-5b8ba1f045d1",
    "questions": [
      "What is the birth year of Adaldrida Brandybuck?",
      "Who are the parents of Adaldrida Brandybuck?",
      "What is the name of Adaldrida's spouse?",
      "How many children did Adaldrida Brandybuck have?",
      "What are the names of Adaldrida's well-known children?"
    ]
  },
  {
    "id": "e84396ef-0432-40ab-8802-90f7ade4f99f",
    "questions": [
      "What is the race of Tar-Ardamin?",
      "In which realm did Tar-Ardamin live?",
      "What year was Tar-Ardamin born?",
      "Who was the spouse of Tar-Ardamin?",
      "What name did Tar-Ardamin's followers use for him in the Adûnaic language?"
    ]
  },
  {
    "id": "e87be1b9-1221-414a-af8f-439c14dbecc1",
    "questions": [
      "What was Déorwine's role during the War of the Ring?",
      "When did Déorwine die?",
      "Where was Déorwine buried?",
      "How many knights accompanied Déorwine in battle?",
      "In which battle were Déorwine and his knights slain?"
    ]
  },
  {
    "id": "e8b126f1-5b6b-43f4-8872-f6cb0067c61d",
    "questions": [
      "What was the name of Imin's spouse?",
      "In which location was Imin awoken?",
      "Who were the other two Elves that awoke alongside Imin?",
      "What did Imin found that later became known as the Vanyar?",
      "Who was Imin's descendant that was invited to Aman as an ambassador?"
    ]
  },
  {
    "id": "e99ca0ea-eed5-461c-bb24-0524d952b201",
    "questions": [
      "What significant event prompted Marach and his people to cross the Blue Mountains into Beleriand?",
      "What title was more commonly known as the House of Marach?",
      "Who was the elder son of Bëor that Marach formed an alliance with?",
      "What were the names of Marach's two sons?",
      "Who succeeded Marach as the ruler of the Marachians after his death?"
    ]
  },
  {
    "id": "e9a48e10-fb54-48da-9f7c-f328dc811cf9",
    "questions": [
      "What was the birth period of Berelach?",
      "Who was Berelach's father?",
      "In which fleet did Berelach serve?",
      "What significant event did Berelach discuss with his father during his last visit in April 220?",
      "Who contradicted Berelach's account of the missing Shipmen?"
    ]
  },
  {
    "id": "ea450e2a-dbaf-4fed-8596-66e167a4aa1c",
    "questions": [
      "What is the race of Hanna (Goldworthy) Brandybuck?",
      "Who is Hanna (Goldworthy) Brandybuck's spouse?",
      "In what year was Hanna (Goldworthy) Brandybuck born?",
      "What is the name of Hanna (Goldworthy) Brandybuck's son?",
      "What is the gender of Hanna (Goldworthy) Brandybuck?"
    ]
  },
  {
    "id": "ea89b595-168b-41f1-9505-ccbadb5c5789",
    "questions": [
      "What is the race of Baran?",
      "Who was Baran's father?",
      "In which realm did Baran live?",
      "What are the names of Baran's sons?",
      "When did Baran die?"
    ]
  },
  {
    "id": "eaa57474-ac2e-4958-8f73-54137e4de5e7",
    "questions": [
      "What was the birth year of Hyarmendacil I?",
      "Who was Hyarmendacil I's father?",
      "What significant military action did Hyarmendacil I undertake in TA 1050?",
      "How long did Hyarmendacil I reign over Gondor?",
      "Who succeeded Hyarmendacil I after his death?"
    ]
  },
  {
    "id": "eac586de-8955-4ee1-9f76-3e70361bea7e",
    "questions": [
      "What is the full name of Belemir's spouse?",
      "In which year was Belemir born?",
      "Who was Belemir's father?",
      "How many children did Belemir have with Adanel?",
      "Who is the renowned figure that is a descendant of Belemir?"
    ]
  },
  {
    "id": "eaed447f-9db1-4f9b-996f-db259dcbb35b",
    "questions": [
      "What nickname was given to Urwen and why?",
      "In what year did Lalaith (Urwen) die?",
      "How did Túrin express his feelings towards his sister Lalaith during her life?",
      "What illness affected both Urwen and Túrin in Dor-lómin?",
      "How did Morwen respond to Túrin's request to speak Urwen's nickname after her death?"
    ]
  },
  {
    "id": "eb572b9b-8fb0-44d4-8fd6-db96fb87a315",
    "questions": [
      "What year was Uffo Boffin born?",
      "Who were Uffo Boffin's parents?",
      "What is the name of Uffo Boffin's spouse?",
      "How many children did Uffo Boffin have?",
      "What are the names of Uffo Boffin's children?"
    ]
  },
  {
    "id": "eb7a127c-e676-49be-bcbf-c15aa5cdc93d",
    "questions": [
      "What significant event occurred during Aranarth's youth that affected his family and kingdom?",
      "Who was Aranarth's father, and what happened to him during the conflict with Angmar?",
      "What title did Aranarth choose not to claim after the fall of his kingdom?",
      "In which region did Aranarth's people become known as the Rangers of the North?",
      "Who succeeded Aranarth as Chieftain after his death in TA 2106?"
    ]
  },
  {
    "id": "eb9994bb-4868-40aa-907a-b4cc01b0d391",
    "questions": [
      "What is the birth year of Thingol?",
      "Who is Thingol's spouse?",
      "In which realm did Thingol rule?",
      "What significant event did Thingol lead his people to victory against?",
      "Who was Thingol's daughter?"
    ]
  },
  {
    "id": "eb9cea3a-e979-4b2d-a764-8f60d3c83d92",
    "questions": [
      "What notable herb did Tobias Hornblower discover and cultivate?",
      "In which village did Tobias Hornblower reside?",
      "What is the name of the Pipe-weed variety named after Tobias Hornblower?",
      "What was the time period during which Tobias Hornblower was born?",
      "According to Meriadoc Brandybuck, where did Tobold Hornblower learn about Pipe-weed?"
    ]
  },
  {
    "id": "eca746b2-9cd4-4c9f-9ab3-9faf96c1a98d",
    "questions": [
      "What year was Beleg of Arnor born?",
      "Who succeeded Beleg of Arnor after his death?",
      "In what year did Beleg become king of Arthedain?",
      "What significant event involving Hobbits occurred during Beleg's reign?",
      "What was the age of Beleg when he died?"
    ]
  },
  {
    "id": "ecd01777-e2bf-4b19-bd52-96e6be43fb3f",
    "questions": [
      "What was the birth year of Ar-Sakalthôr?",
      "In which realm did Ar-Sakalthôr rule?",
      "Who succeeded Ar-Sakalthôr as King of Númenor?",
      "How long did Ar-Sakalthôr rule Númenor?",
      "What is the traditional Quenya version of Ar-Sakalthôr's name?"
    ]
  },
  {
    "id": "ecdc7bbd-bba3-4d6c-95f1-1ce1dd6e8898",
    "questions": [
      "What race does Durin VII belong to?",
      "In which realm did Durin VII re-establish his kingdom?",
      "What significant event was foretold at the conclusion of the Battle of Five Armies regarding Durin VII?",
      "What was Durin VII's mission after traveling from the Lonely Mountain?",
      "What was the outcome for Durin VII's people after he re-founded the kingdom?"
    ]
  },
  {
    "id": "ed0f6c06-4a89-4197-b4a2-90362f8dbc8f",
    "questions": [
      "What is the birth year of Ivriniel?",
      "Who are the siblings of Ivriniel?",
      "What is the title held by Imrahil, Ivriniel's brother?",
      "What race does Ivriniel belong to?",
      "What gender is Ivriniel?"
    ]
  },
  {
    "id": "ed9a324a-a09b-453c-9322-f6e0dbca24df",
    "questions": [
      "What is the birth year of Fréa?",
      "Who was Fréa's father?",
      "In which realm did Fréa rule as king?",
      "How long did Fréa reign as the King of Rohan?",
      "Who succeeded Fréa after his death?"
    ]
  },
  {
    "id": "edcd7c1e-c5f1-4cf8-82d0-a1cf9f2866f3",
    "questions": [
      "What year was Wilcome Cotton born?",
      "Who are Wilcome Cotton's siblings?",
      "What battle did Wilcome Cotton and his brothers fight in?",
      "What is the relationship between Rosie Gamgee and Wilcome Cotton?",
      "How many siblings does Wilcome Cotton have in total?"
    ]
  },
  {
    "id": "ede462f7-bd64-4870-b1ee-fa1f24ea9f76",
    "questions": [
      "What significant event occurred in TA 2509 involving Elladan and Elrohir?",
      "Who are the grandsons of Lady Galadriel and Lord Celeborn?",
      "What role did Elladan and Elrohir play during the War of the Ring?",
      "In which year were Elladan and Elrohir born?",
      "What happened to their mother Celebrían after her rescue from Orcs?"
    ]
  },
  {
    "id": "edeb76f8-b460-4946-81a7-3fc34ecf591a",
    "questions": [
      "What was the birth year of Théodred?",
      "Who commanded western Rohan during the War of the Ring?",
      "In which battle was Théodred slain?",
      "What happened to Théodred's body after his death?",
      "Who became the heir to the throne of Rohan after Théodred's death?"
    ]
  },
  {
    "id": "edf7f2bf-b76e-43db-b8d8-e38a1978ce72",
    "questions": [
      "What year was Falco Chubb-Baggins born?",
      "Who were Falco Chubb-Baggins' parents?",
      "What is the name of Falco Chubb-Baggins' daughter?",
      "Who did Poppy Chubb-Baggins marry?",
      "How old was Falco Chubb-Baggins when he died?"
    ]
  },
  {
    "id": "ee2e7ad8-d364-4807-8be4-e16daa1832ba",
    "questions": [
      "What year was Éomer born?",
      "Who was Éomer's sister?",
      "What title did Éomer hold before becoming King of Rohan?",
      "In which battle did Éomer fight after Théoden's death?",
      "What was the name of Éomer's son?"
    ]
  },
  {
    "id": "ee388a3f-5e4a-4e1c-9770-bcb4e6cbeeee",
    "questions": [
      "What was Dúnhere's role in the War of the Ring?",
      "When did Dúnhere die?",
      "Which location did Dúnhere oversee during the muster of the Rohirrim?",
      "What significant event was Dúnhere present for in Dunharrow?",
      "How is Dúnhere remembered after his death?"
    ]
  },
  {
    "id": "ee84f965-ecde-480d-8f5f-1594c63fcb0f",
    "questions": [
      "What was the race of Almiel?",
      "In which province was Almiel born?",
      "Who were Almiel's siblings?",
      "What time period did Almiel live in?",
      "What is known about Almiel's life beyond her birth and family?"
    ]
  },
  {
    "id": "eee94f9a-7fbe-48fa-8aaf-3189ec19cf72",
    "questions": [
      "What is the full name of the character?",
      "What is the unique identifier for Pimpernel Took?",
      "Is there any information available about Pimpernel Took's race or gender?",
      "What significant events or details are associated with Pimpernel Took?",
      "Does Pimpernel Took have any known relationships or family connections?"
    ]
  },
  {
    "id": "efb010e2-d188-44f1-b08c-d52f861626a4",
    "questions": [
      "What is the name of Thráin I's spouse?",
      "In what year was Thráin I born?",
      "What significant event led to Thráin I fleeing Khazad-dûm?",
      "Which kingdom did Thráin I establish in TA 1999?",
      "Who succeeded Thráin I as king after his death?"
    ]
  },
  {
    "id": "f024a00f-c2f8-459f-ba48-9d30943e3d1e",
    "questions": [
      "What significant political divisions emerged among the Númenóreans during Tar-Ancalimon's reign?",
      "What was the duration of Tar-Ancalimon's rule over Númenor?",
      "Who succeeded Tar-Ancalimon after his death?",
      "What language was discouraged from being taught to Númenórean children during Tar-Ancalimon's reign?",
      "How did Tar-Ancalimon's policies contribute to the eventual Fall of Númenor?"
    ]
  },
  {
    "id": "f1da6001-d5cd-4d9d-98de-a05af5dc09d3",
    "questions": [
      "What is the birth year of Wiseman Gamwich?",
      "Who is Wiseman Gamwich's father?",
      "What is the name of Wiseman Gamwich's child?",
      "In which location did Wiseman Gamwich move to?",
      "Who is Wiseman Gamwich's spouse?"
    ]
  },
  {
    "id": "f2e3c667-761b-485e-8a0e-171207e318a6",
    "questions": [
      "What year was Mardil Voronwë born?",
      "Who was the king during the early part of Mardil's stewardship?",
      "What significant event occurred in TA 2063 during Mardil's rule?",
      "What was the nickname given to Mardil Voronwë and what does it mean?",
      "Who succeeded Mardil Voronwë as the Ruling Steward of Gondor?"
    ]
  },
  {
    "id": "f2eb93f7-fc8e-4b8c-8ab4-5cdc599ae0a7",
    "questions": [
      "What race is the character Black Serpent?",
      "When did Black Serpent die?",
      "What significant event involved Black Serpent during the battle against the Rohirrim?",
      "Who was the leader of the Rohirrim that confronted Black Serpent?",
      "What was the standard associated with Black Serpent during the battle?"
    ]
  },
  {
    "id": "f3358b92-30a8-42a3-8e2f-bb078f55818b",
    "questions": [
      "Who is Linda Proudfoot's brother?",
      "What is the name of Linda Proudfoot's husband?",
      "What is the name of Linda Proudfoot's son?",
      "In what year was Linda Proudfoot's son, Odo, born?",
      "How is Linda Proudfoot related to Bilbo Baggins?"
    ]
  },
  {
    "id": "f33ea8d4-1504-493b-b6ee-0e3144528ad0",
    "questions": [
      "What year was Angelimir born?",
      "Who was Angelimir's father?",
      "Who succeeded Angelimir after his death?",
      "What is known about Angelimir's reign?",
      "What is the name of Angelimir's spouse?"
    ]
  },
  {
    "id": "f3bdcef7-9a16-4611-bf25-142d2e09bfa3",
    "questions": [
      "Who was Ruby Baggins married to?",
      "How many children did Ruby Baggins have?",
      "What are the names of Ruby Baggins' children?",
      "What is Ruby Baggins' relationship to Frodo?",
      "What is the full name of Ruby Baggins' spouse?"
    ]
  },
  {
    "id": "f4ee8d1e-d1ed-4219-a840-2887e1abb71e",
    "questions": [
      "What was the name of Almarian's father?",
      "Who was Almarian married to?",
      "What was the name of Almarian's son who became King of Númenor?",
      "How did Almarian feel about her son's desire to follow in his grandfather's footsteps?",
      "What notable characteristic is mentioned about Almarian?"
    ]
  },
  {
    "id": "f53e8ec5-ae0c-4711-a1ee-0d2ff13b6265",
    "questions": [
      "What year was Marmadoc Brandybuck born?",
      "Who were Marmadoc Brandybuck's parents?",
      "What title did Marmadoc Brandybuck hold after his father's death?",
      "How many children did Marmadoc Brandybuck have, and what are their names?",
      "In what year did Marmadoc Brandybuck die?"
    ]
  },
  {
    "id": "f59d7e0a-7a83-4b28-9ad5-5d527b8547c7",
    "questions": [
      "What year was Araglas born?",
      "Who raised Araglas during his childhood?",
      "In what year did Araglas become the Chieftain of the Dúnedain?",
      "How long did Araglas serve as chieftain before his death?",
      "Who succeeded Araglas as Chieftain after his death?"
    ]
  },
  {
    "id": "f5e96305-d8f5-44c7-a241-cd53fd2c2f16",
    "questions": [
      "What was the birth year of Eärendur of Númenor?",
      "Who was Eärendur's father?",
      "What relationship did Eärendur have with Caliondo?",
      "Who was considered a possible heir to Tar-Aldarion?",
      "What significant change occurred regarding the line of succession during Eärendur's time?"
    ]
  },
  {
    "id": "f619a916-e49d-4e5b-95ad-a6d33d99f475",
    "questions": [
      "What is the original name given to Galadriel by her father Finarfin?",
      "In which realms did Galadriel reside during her life?",
      "Who was Galadriel's spouse, and what is the name of their daughter?",
      "What significant event did Galadriel witness during the Kinslaying at Alqualondë?",
      "What gift did Galadriel give to Aragorn as a token of hope during the Fellowship's stay in Lothlórien?"
    ]
  },
  {
    "id": "f625ff85-905c-49da-b86f-e235d4674075",
    "questions": [
      "What is the race of Ciryon?",
      "In which year was Ciryon born?",
      "What significant events did Ciryon not participate in during his lifetime?",
      "Who were Ciryon's brothers?",
      "At what location was Ciryon slain?"
    ]
  },
  {
    "id": "f63d5eef-d696-4020-b28b-591153b0fa2e",
    "questions": [
      "What year was Orodreth born?",
      "Who was Orodreth's father?",
      "In what year did Orodreth succeed his father as Steward?",
      "What was the major threat to Gondor during Orodreth's stewardship?",
      "Who succeeded Orodreth after his death?"
    ]
  },
  {
    "id": "f64bc039-e2ac-4fe0-987e-f7dc15e2f82c",
    "questions": [
      "What year was Fredegar Bolger born?",
      "What event caused Fredegar to run from the Nazgûl?",
      "What was Fredegar's role during Saruman's rule of the Shire?",
      "How did Fredegar attempt to keep up appearances after Frodo and the others left Crickhollow?",
      "In what age did Fredegar Bolger die?"
    ]
  },
  {
    "id": "f67239de-2555-4af5-89a3-63c64d871404",
    "questions": [
      "What is the birth year of Mairen?",
      "Who is Mairen's father?",
      "What is Mairen's relationship to Tar-Elendil?",
      "How many siblings did Mairen have?",
      "What is known about Mairen's life?"
    ]
  },
  {
    "id": "f6b61614-e77a-4651-beb5-8cacba55324e",
    "questions": [
      "What title did Forlong hold in the lands of Lossarnach?",
      "In what year did Forlong die?",
      "How did Forlong meet his end during the Battle of the Pelennor Fields?",
      "What was Forlong famously known for regarding his physical appearance?",
      "Which city did Forlong aid with his men during the War of the Ring?"
    ]
  },
  {
    "id": "f6dc076c-0c1c-4638-94f5-f4e98e0df681",
    "questions": [
      "What significant event did Gléowine commemorate with a song?",
      "What was the subject of Gléowine's song during King Théoden's funeral?",
      "What happened to Gléowine's songwriting after the funeral of King Théoden?",
      "In which age was Gléowine born?",
      "What themes are present in Gléowine's song about King Théoden?"
    ]
  },
  {
    "id": "f7144548-0272-4b94-b4b5-b5f457991241",
    "questions": [
      "What is the race of Eglantine (Banks) Took?",
      "Who was Eglantine (Banks) Took's spouse?",
      "In what era was Eglantine (Banks) Took born?",
      "How many children did Eglantine (Banks) Took have, and can you name them?",
      "Did Eglantine (Banks) Took attend any notable events, and if so, which one?"
    ]
  },
  {
    "id": "f7427ca5-fb15-4470-8509-287324fb7deb",
    "questions": [
      "What year was Egalmoth born?",
      "Who was Egalmoth's spouse?",
      "How long did Egalmoth serve as Steward?",
      "What significant event occurred in TA 2698 related to Egalmoth?",
      "Who succeeded Egalmoth after his death?"
    ]
  },
  {
    "id": "f750f09c-f31e-41e1-a2de-65f1f3a9b3cf",
    "questions": [
      "What year was Rían born?",
      "Who was Rían's spouse?",
      "What significant event occurred when Rían was a young child?",
      "How old was Rían when she gave birth to her son Tuor?",
      "What happened to Rían in FA 473?"
    ]
  },
  {
    "id": "f7b60542-68fb-4819-acf4-7837a691d905",
    "questions": [
      "What is the name of Uinen's spouse?",
      "How did Uinen help bring Ossë back to the allegiance of Ulmo?",
      "What role did Uinen and Ossë have in governing the waves and the Inner Seas?",
      "What was Uinen's reaction to the Kinslaying at Alqualondë?",
      "How did the Númenórean mariners view Uinen during the Second Age?"
    ]
  },
  {
    "id": "f7ed6355-5b54-41c4-a0ff-af1bc8108d42",
    "questions": [
      "What year was Aragost born?",
      "Who was Aragost's father?",
      "In what year did Aragost become the Chieftain of the Dúnedain?",
      "How long did Aragost serve as chieftain?",
      "Who succeeded Aragost after his death?"
    ]
  },
  {
    "id": "f8085fe7-de07-46d7-a86c-097c8d3af796",
    "questions": [
      "What role did Arien serve before she was charged to sail the vessel of the Sun?",
      "How did Arien's form change when she left Valinor?",
      "What was the significance of Arien's first journey across the sky?",
      "Who created the vessel to hold the last golden fruit of Laurelin?",
      "How did Morgoth react to the rising of the Sun and Arien's power?"
    ]
  },
  {
    "id": "f8d1eb1e-1794-4fe3-b6ce-f36b294b666c",
    "questions": [
      "What year was Gram born?",
      "Who was Gram's father?",
      "At what age did Gram become king?",
      "What was the primary conflict during Gram's reign?",
      "Who succeeded Gram as king?"
    ]
  },
  {
    "id": "f91eae32-4d9b-4beb-b5e7-741d76c4cc33",
    "questions": [
      "What was the name of Andreth's spouse, and why did they never marry?",
      "In which year was Andreth born and in which year did she die?",
      "What title was given to Andreth by the Elves, and what does it signify?",
      "Who was Andreth's close friend and what was the nature of their discussions?",
      "What significant event occurred in FA 455 that likely led to Andreth's death?"
    ]
  },
  {
    "id": "f9e6427f-01e0-4450-9790-124c30fdd842",
    "questions": [
      "Who is Vairë's spouse?",
      "What is Vairë's race?",
      "Who was one of the visitors that Vairë and Lindo entertained?",
      "What was Vairë's father's name?",
      "In which location did Vairë and her husband live?"
    ]
  },
  {
    "id": "f9eebaf8-029e-485e-8325-7983fdd4b9c7",
    "questions": [
      "What year was Boromir born?",
      "Who was Boromir's father?",
      "What significant military action did Boromir lead in TA 2475?",
      "How long did Boromir rule as the Ruling Steward of Gondor?",
      "Who succeeded Boromir after his death?"
    ]
  },
  {
    "id": "facf5895-3e2d-4232-a410-4d84f4a8fe0c",
    "questions": [
      "What is the birth year of Saradas Brandybuck?",
      "Who were the parents of Saradas Brandybuck?",
      "How many siblings did Saradas Brandybuck have?",
      "What significant event was Saradas Brandybuck present at?",
      "What is the name of Saradas Brandybuck's son and when was he born?"
    ]
  },
  {
    "id": "fb4c3e19-8d5b-468b-9096-97664ee4c0a6",
    "questions": [
      "What year was Aravir born?",
      "Who raised Aravir during his childhood?",
      "In what year did Aravir become the Chieftain of the Dúnedain?",
      "How long did Aravir serve as Chieftain before his death?",
      "Who succeeded Aravir as Chieftain after his death?"
    ]
  },
  {
    "id": "fbc92193-58e0-4cea-89a9-af81cd197274",
    "questions": [
      "What year was Aragorn I born?",
      "Who succeeded Aragorn I as the Chieftain of the Dúnedain?",
      "In what year did Aragorn I die?",
      "What event led to the end of Aragorn I's reign?",
      "Who was Aragorn I's father?"
    ]
  },
  {
    "id": "fbea64fd-4564-44d3-a6ee-c8409a3d33de",
    "questions": [
      "What race is Éothain?",
      "In which year did Éothain participate in the battle against the Orcs?",
      "What was Éothain's initial opinion about Halflings?",
      "Who were the two Halflings that Éothain's éored encountered?",
      "Which characters did Éothain encounter after the battle with the Orcs?"
    ]
  },
  {
    "id": "fc2fd9aa-6edb-425f-b314-366bf7014871",
    "questions": [
      "What was the name of Vidumavi's spouse?",
      "In what year did Vidumavi give birth to her son Eldacar?",
      "What was the fear of the Dúnedain of Gondor regarding Vidumavi's marriage to Valacar?",
      "What alternate name was Vidumavi known by after moving to Gondor?",
      "What significant event occurred eighty-eight years after the birth of Eldacar?"
    ]
  },
  {
    "id": "fc48e834-5752-4a77-bf66-4353638105c7",
    "questions": [
      "What lands did Freca rule?",
      "In what year was Freca born and when did he die?",
      "What was Freca's relationship with Helm, the king of Rohan?",
      "Who was Freca's son and what did he do in response to his father's death?",
      "What was the long-term impact of Freca's actions on the relationship between Rohan and the Dunlendings?"
    ]
  },
  {
    "id": "fcb62554-53ac-4139-9c45-5389d8a0a408",
    "questions": [
      "What year was Thorondir born?",
      "Who was Thorondir's father?",
      "What decision did Thorondir make regarding the White Tree of Gondor?",
      "In what year did Thorondir die?",
      "Who succeeded Thorondir as the Ruling Steward?"
    ]
  },
  {
    "id": "fcb8483e-3c5e-476d-bcea-2ba7c4a700c3",
    "questions": [
      "What year did Adrahil II succeed his father as ruler?",
      "Who were the children of Adrahil II?",
      "In what year was Adrahil II born?",
      "How long did Adrahil II reign?",
      "What is the name of Adrahil II's spouse?"
    ]
  },
  {
    "id": "fd10f116-7b75-4f6d-ae43-c106d70cd33d",
    "questions": [
      "What was Radagast's original name before he was called Radagast?",
      "In which era did Radagast arrive in Middle-earth?",
      "What role did Radagast play during the War of the Ring?",
      "Where did Radagast reside during the late Third Age?",
      "Which Valar did Radagast serve before descending into Arda?"
    ]
  },
  {
    "id": "fdde8270-612d-4c55-921a-88ba78563d72",
    "questions": [
      "What race does Enerdhil belong to?",
      "What is known about Enerdhil's birth?",
      "What did Enerdhil create that was beloved by many?",
      "To whom did Enerdhil give the great green gem?",
      "Who is the son of Idril that received the gem from her?"
    ]
  },
  {
    "id": "fdfada99-b003-47a6-9513-c7939b6b79dd",
    "questions": [
      "What is the race of Hathol?",
      "What is the gender of Hathol?",
      "In which year was Hathol born?",
      "What is the full name of the character described?",
      "Is there any information about Hathol's death or relationships?"
    ]
  },
  {
    "id": "fe7d1fd3-26f9-4b0d-9489-6c43c6f26379",
    "questions": [
      "What is the birth year of Aulendil?",
      "Who was Aulendil's father?",
      "What race does Aulendil belong to?",
      "How many siblings did Aulendil have?",
      "What is known about Aulendil's marital status?"
    ]
  },
  {
    "id": "feff938e-6f5b-4dfe-862c-5bdd571e9219",
    "questions": [
      "What is the race of Eärendil of Gondor?",
      "In which realm did Eärendil rule?",
      "Who succeeded Eärendil after his death?",
      "How long did Eärendil rule Gondor?",
      "What year did Eärendil die?"
    ]
  },
  {
    "id": "ff00cc3a-5a77-4bf0-ad04-3262098a100c",
    "questions": [
      "What race is Lóni?",
      "In which year did Lóni enter Moria?",
      "Who were Lóni's companions when he attempted to form a colony in Moria?",
      "In what year did Lóni die?",
      "Where was Lóni killed during the battle?"
    ]
  },
  {
    "id": "ff154e35-fe3f-4994-a56c-ec9a4a772f85",
    "questions": [
      "What significant item did Elrond give to Aragorn when he revealed his true name and ancestry?",
      "Who was Aragorn's spouse, and what choice did she make regarding her lineage?",
      "In which year was Aragorn born?",
      "What title was Aragorn known by when he first met the Hobbits in Bree?",
      "What was the name of the sword that Aragorn wielded after it was reforged?"
    ]
  },
  {
    "id": "ff227bb1-666f-4d2b-a83c-3bb3a2cb1982",
    "questions": [
      "What race is Wídfara?",
      "In which significant battle did Wídfara fight during the War of the Ring?",
      "What notable event did Wídfara report to his lord while passing through the Drúadan Forest?",
      "When was Wídfara born and when did he die?",
      "Who was Wídfara's spouse?"
    ]
  },
  {
    "id": "ff4bc863-46bd-44f9-967d-176bf84b9038",
    "questions": [
      "Who was Húrin of Emyn Arnen's king during his service as Steward?",
      "What significant lineage did Húrin of Emyn Arnen originate?",
      "In which historical period did Húrin of Emyn Arnen live?",
      "What event is believed to have caused Húrin of Emyn Arnen's death?",
      "What is the significance of Húrin of Emyn Arnen in the history of Gondor's Stewards?"
    ]
  },
  {
    "id": "ff647c94-1f53-4853-938e-5202c7adeb97",
    "questions": [
      "What was the birth year of Amlaith?",
      "Which realm did Amlaith rule over?",
      "Who succeeded Amlaith as ruler after his death?",
      "What significant historical event resulted from Amlaith's disputes with his brothers?",
      "What heirlooms of the House of Isildur did Amlaith possess?"
    ]
  }
]